Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard/how_to_build_dashboard_part2.po
Languages: de, es, fr, nl

source: on the right, we will put our data visualizations (the table, and underneath the map and the chart one next to the other)
de: auf der rechten Seite bringen wir unsere Datenvisualisierungen (die Tabelle und darunter die Karte und das Diagramm nebeneinander) an
es: A la derecha, colocaremos las visualizaciones de datos (la tabla y debajo el mapa y el gráfico uno junto al otro).
fr: à droite, nous allons placer nos visualisations de données (le tableau, et en dessous la carte et le graphe, côte à côte).
nl: rechts plaatsen we onze dataweergaven (de tabel en daaronder de kaart en de grafiek netjes naast elkaar)

source: Now, how can we achieve that look for our dashboard? Picture your page as a container. Inside this container, you can have as many rows as you want. Each one of these rows is split into 12 columns of the same size.
de: Wie können wir dieses Aussehen für unser Dashboard erreichen? Stellen Sie sich Ihre Seite als Container vor. Innerhalb dieses Containers können Sie beliebig viele Zeilen haben. Und jede dieser Zeilen ist in 12 gleich große Spalten unterteilt.
es: ¿Pero cómo podemos conseguir ese estilo para nuestro panel? Imagine la página como si fuera un contenedor. Dentro del contenedor, puede tener tantas filas como desee. Cada una de estas filas se divide en 12 columnas del mismo tamaño.
fr: Et maintenant, comment peaufiner le look de notre tableau de bord ? Imaginez que votre page est un conteneur. Dans ce conteneur, vous pouvez avoir autant de lignes que vous souhaitez. Chacune de ces lignes est divisée en 12 colonnes de la même taille.
nl: Hoe kunnen we er nu voor zorgen dat ons dashboard er zo uitziet? Beeld uw pagina in als een container. In deze container kunt u zoveel rijen hebben als u wil. Elk van deze rijen is onderverdeeld in 12 kolommen van dezelfde grootte.

source: In HTML code, this is what it looks like:
de: Im HTML-Code sieht das Ganze so aus:
es: Esta es la apariencia en código HTML:
fr: En code HTML, voici à quoi cela ressemble :
nl: In HTML-code ziet dit er als volgt uit:

source: When your create a page and want to organize the elements that compose your page, you must put them in rows. For each element, you must decide how many columns you want to allocate to that element.
de: Wenn Sie eine Seite erstellen und deren Elemente organisieren möchten, müssen Sie sie in Zeilen einordnen. Und für jedes Element müssen Sie bestimmen, wie viele Spalten Sie diesem Element zuordnen möchten.
es: Si crea una página y desea organizar los elementos que la componen, debe ponerlos en filas. Debe decidir cuántas columnas desea asignar a cada uno de los elementos.
fr: Quand vous créez une page et souhaitez organiser les éléments qui la composent, vous devez les placer dans des lignes. Pour chaque élément, vous devez décider du nombre de colonnes à allouer.
nl: Wanneer u een pagina aanmaakt en de elementen waaruit uw pagina is samengesteld, wil organiseren, moet u deze in rijen plaatsen. Voor elk element moet u beslissen hoeveel kolommen u aan dat element wil toewijzen.

source: 24 + Let's reorganize our dashboard in rows and columns. For our example, we will put both the navigation part and the data visualization part in the same row. We will use 3 columns for the navigation elements, and the remaining 9 columns for our visualization elements. Since we wanted to put the map and chart visualizations one next to the other, we will create a row for these 2 : each using 6 columns.
de: 24 + Jetzt können wir unser Dashboard in Zeilen und Spalten neu organisieren. In unserem Beispiel werden wir die Navigation und die Datenvisualisierung in der gleichen Zeile einordnen. Wir verwenden 3 Spalten für die Navigationselemente und die restlichen 9 Spalten für die Visualisierungselemente. Und da wir die Karten- und Diagrammvisualisierungen nebeneinander anbringen möchten, werden wir eine Zeile für diese beiden erstellen, wobei beide jeweils 6 Spalten nutzen.
es: 24 + Vamos a reorganizar nuestro panel en filas y columnas. En este ejemplo, colocaremos la parte de navegación y la parte de visualización de datos en la misma fila. Utilizaremos 3 columnas para los elementos de navegación y las 9 columnas restantes para los elementos de visualización. Como hemos decidido colocar las visualizaciones de mapa y gráfico una junto a la otra, crearemos una fila para estas 2: cada una con 6 columnas.
fr: 24 + Réorganisons notre tableau de bord en lignes et en colonnes. Pour notre exemple, nous allons placer la partie navigation et la partie visualisation de données dans la même ligne. Nous allons utiliser 3 colonnes pour les éléments de navigation, et les 9 colonnes restantes sont destinées à nos éléments de visualisation. Puisque nous voulions placer les visualisations de carte et de graphe côte à côte, nous allons créer une ligne pour chacune d'entre elles, avec 6 colonnes.
nl: 24 + We gaan nu ons dashboard herorganiseren in rijen en kolommen. Voor ons voorbeeld plaatsen we zowel het navigatiedeel als het deel dataweergave in dezelfde rij. We gebruiken 3 kolommen voor de navigatie-elementen en de resterende 9 kolommen voor onze weergave-elementen. Aangezien we de kaart- en grafiekweergaven naast elkaar willen plaatsen, maken we een rij aan voor deze 2, elk met 6 kolommen.

source: In HTML code, this is what our dashboard will look like:
de: Im HTML-Code sieht unser Dashboard dann so aus:
es: Esta será la apariencia del panel en código HTML:
fr: En code HTML, voici à quoi ressemble notre tableau de bord :
nl: In HTML-code zal ons dashboard er als volgt uitzien:

source: 25 + Save your page and click on :tutorial-keycap:`Preview`. What a cool dashboard we have created!
de: 25 + Speichern Sie Ihre Seite und klicken Sie auf:tutorial-keycap:`Vorschau`. Unser Dashboard sieht wirklich schick aus!
es: 25 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`. ¡Hemos creado un panel magnífico!
fr: 25 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu`. Quel magnifique tableau de bord nous avons créé !
nl: 25 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`. We hebben een cool dashboard aangemaakt, niet?

source: 26 + Maybe a little bit more space between the table and the 2 other visualizations would be better though. Let's add a ``br`` tag under the table widget, right before the row containing both the map widget and the chart widget. This tag signifies that we want to add an extra empty ligne at the place of the tag. It is also one of the HTML tags that does not come in a pair!
de: 26 + Vielleicht wäre es angemessen etwas mehr Platz zwischen der Tabelle und den beiden anderen Visualisierungen zu haben. Fügen wir ein ``br`` Tag unter dem Tabellen-Widget ein, direkt vor der Zeile, die das Karten- und das Diagramm-Widget enthält. Dieses Tag bedeutet, dass wir eine zusätzliche leere Zeile an der Stelle des Tags sehen möchten. Es handelt sich außerdem um eines der HTML-Tags, die nicht aus zwei Teilen bestehen.
es: 26 + Aunque quizás sería mejor añadir algo más de espacio entre la tabla y las 2 visualizaciones restantes. Vamos a añadir una etiqueta ``br`` bajo el widget de tabla, justo antes de la fila que contiene el widget de mapa y el widget de gráfico. Esta etiqueta significa que queremos añadir una línea vacía adicional en el lugar de la etiqueta. ¡También es una de las etiquetas HTML que no necesitan acompañante!
fr: 26 + Toutefois, nous pourrions peut-être ajouter un peu plus d'espace entre le tableau et les 2 autres visualisations. Ajoutons un tag ``br``sous le widget de tableau, juste avant la ligne qui contient le widget de graphe et le widget de carte. Ce tag signifie que nous souhaitons ajouter une ligne vide supplémentaire à la place du tag. C'est également l'un des tags HTML qui ne fonctionne pas par paire !
nl: 26 + Misschien zou iets meer ruimte tussen de tabel en de andere 2 weergaven nog beter zijn. We gaan een label "br" toevoegen onder de tabelwidget, net voor de rij waarin zowel de kaartwidget als de grafiekwidget staan. Dit label betekent dat we een extra lege lijn gaan toevoegen op de plaats van het label. Het is ook een van de HTML-labels die niet met twee worden gebruikt!

source: 27 + Save again and click the Open page button to see the final result!
de: 27 + Speichern Sie erneut und klicken Sie auf den Button Seite öffnen, um das Endergebnis zu sehen!
es: 27 + ¡Vuelva a guardar y haga clic en el botón Abrir página para ver el resultado!
fr: 27 + Enregistrez une nouvelle fois, et cliquez sur le bouton Ouvrir la page pour voir le résultat final !
nl: 27 + Sla opnieuw op en klik op de knop "Open pagina" om het eindresultaat te zien!

source: **CONGRATULATIONS!**
de: **HERZLICHEN GLÜCKWUNSCH!**
es: **¡ENHORABUENA!**
fr: **FÉLICITATIONS !**
nl: **GEFELICITEERD!**

source: You have finished this tutorial and you now know how to create a complete dashboard with linked widgets and how to format it with CSS classes! If you want to go further with these CSS classes and learn more about responsiveness, don't hesitate to `check our documentation about these topics <https://help.opendatasoft.com/platform/en/customizing_look_and_feel/07_designing_responsive_portal/responsive.html#responsive-page-layouts>`_!
de: Sie haben dieses Tutorial abgeschlossen und wissen jetzt, wie man ein komplettes Dashboard mit verknüpften Widgets erstellt und wie man es mit CSS-Klassen formatiert! Wenn Sie mehr über CSS-Klassen und Responsivität erfahren möchten, können Sie unsere Dokumentation zu diesen Themen lesen <https://help.opendatasoft.com/platform/en/customizing_look_and_feel/07_designing_responsive_portal/responsive.html#responsive-page-layouts>`_!
es: ¡Ha completado este tutorial, y ahora ya sabe cómo crear un panel completo con widgets vinculados y cómo darle formato con clases CSS! Si quiere continuar avanzando con estas clases CSS y obtener más información sobre la capacidad de respuesta, no dude en `consultar nuestra documentación en torno a estos temas <https://help.opendatasoft.com/platform/en/customizing_look_and_feel/07_designing_responsive_portal/responsive.html#responsive-page-layouts>`_!
fr: Vous avez terminé ce tutoriel et savez maintenant créer un tableau de bord complet, avec des widgets liés. Vous avez également appris à le mettre en forme avec des classes CSS ! Si vous souhaitez découvrir plus en détail ces classes CSS, notamment leur réactivité, n'hésitez pas à `consulter notre documentation dédiée à ces sujets <https://help.opendatasoft.com/platform/en/customizing_look_and_feel/07_designing_responsive_portal/responsive.html#responsive-page-layouts>`_ !
nl: U heeft deze handleiding nu gevogld en weet nu hoe uw een volledig dashboard kunt aanmaken met gekoppelde widgets en hoe u dit kunt formatteren met CSS-klassen! Wilt u nog verder gaan met deze CSS-klassen en meer te weten komen over reactiviteit, aarzel dan niet om onze documentatie over deze onderwerpen te raadplegen <https://help.opendatasoft.com/platform/en/customizing_look_and_feel/07_designing_responsive_portal/responsive.html#responsive-page-layouts>`_!

source: how to add other Opendatasoft widgets
es: Cómo añadir otros widgets de Opendatasoft
nl: hoe andere Opendatasoft-widgets toevoegen

source: In order to create a dashboard, you need to have access to the back office of an Opendatasoft portal and the "Edit all pages" permission.
es: Para crear un panel, debe tener acceso al back office de un portal Opendatasoft y el permiso "Editar todas las páginas".
nl: Om een dashboard te kunnen aanmaken, moet u toegang hebben tot de back-office van een Opendatasoft-portaal en moet u de toelating "Alle pagina's bewerken" hebben.

source: Add more Opendatasoft widgets
es: Añadir más widgets de Opendatasoft
nl: Meer Opendatasoft-widgets toevoegen

source: 5 + Now that our widgets are linked, why not add more widgets to make our dashboard even better? Let's start by adding a search bar. It would allow us to make a textual research on all the visualizations at the same time. Go to the Opendatasoft widgets documentation to learn more about the widget we are goint to use, which is called `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_.
es: 5 + Ahora que nuestros widgets están vinculados, ¿por qué no añadir más widgets para mejorar aún más la apariencia del panel? Vamos a empezar añadiendo una barra de búsqueda. Nos permitirá hacer una búsqueda textual en todas las visualizaciones de forma simultánea. Vaya a la documentación de los widgets de Opendatasoft para obtener más información sobre el widget que vamos a usar, denominado `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_.
nl: 5 + Nu onze widgets aan elkaar zijn gekoppeld, waarom niet meer widgets toevoegen om ons dashboard zelfs nog beter te maken? We beginnen met het toevoegen van een zoekbalk. Hiermee kunnen we tezelfdertijd tekstzoekopdrachten uitvoeren op alle weergaven. Ga naar de documentatie over Opendatasoft-widgets voor meer informatie over de widget die we gaan gebruiken, genaamd `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_.

source: 11 + Let's add another very useful element to our dashboard: filters! It would allow us to apply filters on our visualizations, just like when navigating a dataset. Go to the Opendatasoft widgets documentation to learn more about the widget we are goint to use, which is called `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.
es: 11 + Vamos a añadir otro elemento muy útil a nuestro panel: ¡los filtros! Nos permitirán aplicar filtros a nuestras visualizaciones, igual que cuando navegamos por un conjunto de datos. Vaya a la documentación de los widgets de Opendatasoft para obtener más información del widget que vamos a utilizar, denominado `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.
nl: 11 + We gaan nu nog een ander, bijzonder nuttig element aan ons dashboard toevoegen: filters! Hiermee kunnen we filters op onze weergaven toepassen, net zoals wanneer we door een dataset navigeren. Ga naar de documentatie over OpenDataSet-widgets voor meer informatie over de widget die we gaan gebruiken, genaamd `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.
