Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard/how_to_build_dashboard_part2.po
Languages: de, es, fr, nl

source: Do not save your page yet! Since the attributes of the widget are not completed yet, the platform will consider your widget as invalid and it will create an error.
de: Speichern Sie Ihre Seite noch nicht! Da die Attribute des Widgets noch nicht abgeschlossen sind, ist Ihr Widget für die Plattform ungültig und erzeugt einen Fehler.
es: ¡No guarde la página todavía! Como los atributos del widget aún no se han completado, la plataforma considerará que el widget no es válido y generará un error.
fr: N'enregistrez pas encore votre page ! Puisque les attributs du widget ne sont pas renseignés pour le moment, la plateforme considérera votre widget comme invalide et générera une erreur.
nl: Sla uw pagina nog niet op! Aangezien de attributen van de widget nog niet zijn ingevuld, zal het platform uw widget als ongeldig beschouwen en zal hierdoor een fout worden gegenereerd.

source: 8 + As it is now, the search bar cannot work. First, we need to determine which attributes we need, and fill their values up. For this widget, only the ``context`` attribute is mandatory. To keep things simple for this tutorial, let's delete all other attributes.
de: 8 + In diesem Zustand kann die Suchleiste nicht funktionieren. Zuerst müssen wir bestimmen, welche Attribute wir benötigen, und ihre Werte ausfüllen. Für dieses Widget ist nur das Attribut ``Kontext`` obligatorisch. Löschen wir zum Zwecke der Einfachheit dieses Tutorials die anderen Attribute.
es: 8 + Tal como está ahora, la barra de búsqueda no puede funcionar. En primer lugar, tenemos que determinar qué atributos necesitamos y especificar sus valores. Para este widget, solo es obligatorio el atributo ``context``. Para hacerlo sencillo en este tutorial, vamos a suprimir todos los demás atributos.
fr: 8 + Dans l'état actuel, la barre de recherche ne peut pas fonctionner. Nous devons commencer par déterminer les attributs dont nous avons besoin, et renseigner leurs valeurs. Pour ce widget, seul l'attribut ``context`` est obligatoire. Afin de simplifier les choses pour ce tutoriel, supprimons tous les autres attributs.
nl: 8 + De zoekbalk kan als dusdanig niet werken. Allereerst moeten we bepalen welke attributen we nodig hebben en de waarden ervan invullen. Voor deze widget is enkel het attribuut "context" verplicht. Om de zaken voor deze handleiding eenvoudig te houden, gaan we alle andere attributen verwijderen.

source: 9 + At the beginning of this tutorial (see step 2), we created a unique context that can be used throughout our whole page. The name of our context is "worldheritagelistpublicus". It is that same context name that we must use to fill up the context attribute of our odsTextSearch widget.
de: 9 + Zu Beginn dieses Tutorials (siehe Schritt 2) haben wir einen einzigen Kontext erstellt, den wir auf unserer gesamten Seite verwenden können. Der Name unseres Kontexts lautet "worldheritagelistpublicus". Es handelt sich um denselben Kontextnamen, den wir verwenden müssen, um das Kontextattribut unseres odsTextSearch-Widgets auszufüllen.
es: 9 + Al principio de este tutorial (vea el paso 2), hemos creado un contexto único que se puede utilizar en toda la página. El nombre del contexto es "worldheritagelistpublicus". Ese mismo nombre de contexto es el que debemos emplear para especificar el atributo de contexto de nuestro widget odsTextSearch.
fr: 9 + Au début de ce tutoriel (voir étape 2), nous avons créé un contexte qui peut être utilisé dans l'ensemble de notre page. Le nom de notre contexte est "worldheritagelistpublicus". Il s'agit du même nom de contexte que celui que nous devons utiliser pour renseigner l'attribut ``context`` de notre widget odsTextSearch.
nl: 9 + Bij het begin van deze handleiding (zie stap 2), hebben we een unieke context aangemaakt die voor de volledige pagina gebruikt kan worden. De naam van onze context is "worldheritagelistpublicus". Het is diezelfde context die we moeten gebruiken om het attribuut "context" van onze odsTextSearch-widget in te vullen.

source: 10 + Save your page and click on :tutorial-keycap:`Preview`. We now have a search bar in our dashboard!
de: 10 + Speichern Sie Ihre Seite und klicken Sie auf :tutorial-keycap:`Vorschau`. Unser Dashboard hat jetzt eine Suchleiste!
es: 10 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`. ¡Ahora tenemos una barra de búsqueda en nuestro panel!
fr: 10 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu`. Notre tableau de bord est maintenant doté d'une barre de recherche !
nl: 10 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`. We hebben nu een zoekbalk in ons dashboard!

source: 11 + Let's add another very useful element to our dashboard: filters! It would allow us to apply filters on our visualizations, just like when navigating a dataset. Go to the OpenDataSoft widgets documentation to learn more about the widget we are goint to use, which is called `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.
de: 11 + Fügen wir unserem Dashboard ein weiteres sehr nützliches Element hinzu: Filter! Auf diese Weise können wir Filter für unsere Visualisierungen anwenden, genau wie bei der Navigation in einem Datensatz. In der OpenDataSoft-Dokumentation finden Sie weitere Informationen über das von uns verwendete Widget mit der Bezeichnung `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.
fr: 11 + Ajoutons un autre élément très utile à notre tableau de bord : des filtres ! Ils vont nous permettre de filtrer nos visualisations, comme lorsque nous parcourons un jeu de données. Accédez à la documentation sur les widgets OpenDataSoft pour en apprendre davantage sur le widget que nous allons utiliser, appelé `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: The odsFacets widget allows to retrieve the filters already set for the dataset. It means that if you use this widget for a dashboard, but which related dataset does not have any defined filter, your widget won't be able to display anything.
de: Das Widget odsFacets ermöglicht es, die bereits für den Datensatz eingerichteten Filter abzurufen. Das bedeutet, dass Ihr Widget nichts anzeigen kann wenn Sie es für ein Dashboard verwenden, aber der zugehörige Datensatz keinen definierten Filter hat.
es: El widget odsFacets permite recuperar los filtros ya establecidos para el conjunto de datos. Esto significa que si utiliza este widget para un panel, pero el conjunto de datos asociado aún no tiene definido ningún filtro, el widget no podrá visualizar nada.
fr: Le widget odsFacets permet de récupérer les filtres déjà définis pour le jeu de données. Cela signifie que si vous utilisez ce widget pour un tableau de bord, mais que le jeu de données associé n'a pas de filtres définis, votre widget ne pourra rien afficher.
nl: Met de odsFacets-widget kunnen we de filters ophalen die al ingesteld zijn voor de dataset. Dit betekent dat wanneer u deze widget voor een dashboard gebruikt, maar waarvan de aanverwante dataset geen gedefinieerde filter heeft, uw widget niets kan weergeven.

source: 12 + Copy the odsFacets widget code.
de: 6 + Kopieren Sie den odsFacets Widget-Code.
es: 12 + Copie el código del widget odsFacets.
fr: 12 + Copiez le code du widget odsFacets.
nl: 12 + Kopieer de odsFacets widget code.

source: 13 + Paste the widget code in the code of your page, where you want it to be displayed. Let's put it under our search bar.
de: 13 + Fügen Sie den Widget-Code an die Stelle des Codes Ihrer Seite ein, wo er angezeigt werden soll. Fügen wir ihn unter die Suchleiste ein.
es: 13 + Pegue el código de widget en el código de la página, donde desea que aparezca. Vamos a colocarlo bajo la barra de búsqueda.
fr: 13 + Collez le code du widget dans le code de votre page, à l'endroit où vous souhaitez qu'il soit affiché. Plaçons-le sous notre barre de recherche.
nl: 13 + Plak de widget code in de code van uw pagina waar u wilt dat deze wordt weergegeven. We gaan deze onder onze zoekbalk plaatsen.

source: 14 + Just like we did with the odsTextSearch widget, we need to fill up the attributes of the odsFacets widget. The latter only has one: the ``context`` attribute! Let's fill it up with the name of our page context, exactly as we did for the odsTextSearch widget!
de: 14 + Genau wie beim odsTextSearch-Widget müssen die Attribute des odsFacets-Widgets ausgefüllt werden. Letzteres hat nur eines: das Attribut ``Kontext``! Füllen wir es mit dem Namen unseres Seitenkontexts aus, ebenso wie beim odsTextSearch-Widget!
es: 14 + Igual que hicimos con el widget odsTextSearch, tenemos que especificar los atributos del widget odsFacets. Este último solo tiene uno: ¡el atributo ``context``! Vamos a especificarlo con el nombre del contexto de nuestra página, ¡exactamente igual que hicimos para el widget odsTextSearch!
fr: 14 + Comme nous l'avons fait pour le widget odsTextSearch, nous devons renseigner les attributs du widget odsFacets. Celui-ci n'en a qu'un : l'attribut ``context`` ! Renseignons-le avec le nom du contexte de notre page, de la même façon que nous l'avons fait pour le widget odsTextSearch !
nl: 14 + Net zoals bij de odsTextSearch-widget, moeten we de attributen van de odsFacets-widget aanvullen. Laatstgenoemde heeft er slechts één: het attribuut "context"! We vullen hier de naam van onze paginacontext in, net zoals voor de odsTextSearch-widget!

source: 15 + Save your page and click on :tutorial-keycap:`Preview`. The filters of our dataset are now displayed in our dashboard!
de: 15 + Speichern Sie Ihre Seite und klicken Sie auf :tutorial-keycap:`Vorschau`. Die Filter unseres Datensatzes werden nun in unserem Dashboard angezeigt!
es: 15 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`. ¡Los filtros de nuestro conjunto de datos ahora se visualizan en el panel!
fr: 15 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu`. Les filtres de notre jeu de données s'affichent désormais dans notre tableau de bord !
nl: 15 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`. De filters van onze dataset staan nu weergegeven in ons dashboard!

source: 16 + Now, say we don't want to display all the filters of our dataset. In our UNESCO World Heritage example, let's say we only want to be able to filter by category and country. Copy the following piece of code (also available in the odsFacets widget documentation):
de: 16 + Nehmen wir jetzt einmal an, dass wir nicht alle Filter unseres Datensatzes anzeigen möchten. In unserem Beispiel der UNESCO-Weltkulturerbe wollen wir nur das Filtern nach Kategorie und Land ermöglichen. Kopieren Sie den folgenden Code (auch in der odsFacets Widget-Dokumentation verfügbar):
es: 16 + Ahora, pongamos que no deseamos mostrar todos los filtros de nuestro conjunto de datos. En nuestro ejemplo de la Lista del Patrimonio de la UNESCO, imaginemos que solo queremos poder filtrar por categoría y país. Copie el fragmento de código siguiente (disponible también en la documentación del widget odsFacets):
fr: 16 + Imaginons maintenant que nous ne souhaitions pas afficher tous les filtres de notre jeu de données. Pour notre exemple UNESCO World Heritage, nous voulons pouvoir appliquer un filtre par catégorie et par pays uniquement. Copiez l'extrait de code suivant (également disponible dans la documentation sur le widget odsFacets) :
nl: 16 + Stel nu dat we niet alle filters van onze dataset willen weergeven. Stel dat we in ons UNESCO Werelderfgoed-voorbeeld, enkel willen kunnen filteren per categorie en per land. Kopieer het volgende stukje code (ook terug te vinden in de documentatie over de odsFacets-widget):

source: 17 + Paste it in replacement of the previous, simple odsFacets widget code we used earlier.
de: 17 + Fügen Sie ihn als Ersatz für den vorherigen, einfachen odsFacets Widget-Code ein, den wir im Vorfeld verwendet haben.
es: 17 + Péguelo en sustitución del anterior código del widget odsFacets sencillo que hemos utilizado previamente.
fr: 17 + Collez-le à la place du code du widget odsFacets simple précédent.
nl: 17 + Plak deze ter vervanging van de vorige, eenvoudige odsFacets-widget code die we eerder hebben gebruikt.

source: 18 + Fill up the context attribute correctly, with the name of your page context.
de: 18 + Füllen Sie das Kontext-Attribut korrekt mit dem Namen Ihres Seitenkontexts aus.
es: 18 + Especifique el atributo de contexto correctamente, con el nombre del contexto de la página.
fr: 18 + Renseignez correctement l'attribut ``context`` avec le nom du contexte de votre page.
nl: 18 + Vul het attribuut "context" correct in met de naam van uw paginacontext.

source: 19 + Let's now take a look at the rest of the odsFacets widget advanced code. The 2 ``h3`` tags indicate that we have added titles: these will be used to write the name of the filters we want to display, meaning "Category" and "Country". ``ods-facet name`` is the attribute which will indicate the technical identifier of the field on which the filter is based.
de: 19 + Werfen wir jetzt einen Blick auf den Rest des erweiterten odsFacets Widget-Codes. Die beiden ``h3``-Tags weisen darauf hin, dass wir Titel hinzugefügt haben: sie werden verwendet, um den Namen der Filter zu schreiben, die wir anzeigen möchten, also "Kategorie" und "Land". Das Attribut ``ods-facet name`` gibt die technische Kennung des Feldes an, auf dem der Filter basiert.
es: 19 + Ahora vamos a examinar el resto del código avanzado del widget odsFacets. Las 2 etiquetas ``h3`` indican que hemos añadido títulos: estos se utilizarán para escribir el nombre de los filtros que queremos visualizar, que significan "categoría" y "país". ``ods-nombre de faceta`` es el atributo que indicará el identificador técnico del campo en que se basa el filtro.
fr: 19 + Observons maintenant le reste du code avancé du widget odsFacets. Les 2 tags ``h3`` indiquent que nous avons ajouté des titres : ces derniers seront utilisés pour écrire le nom des filtres que nous souhaitons afficher, c'est-à-dire "Catégorie" et "Pays". ``ods-facet name`` correspond à l'attribut qui indiquera l'identifiant technique du champ sur lequel le filtre est basé.
nl: 19 + We gaan nu de rest van de geavanceerde odsFacets widget code bekijken. De 2 "h3" labels geven aan dat we titels hebben toegevoegd: deze worden gebruikt om de naam van de filters te schrijven die we willen weergeven, zijnde "Categorie" en "Land". "ods-facet name" is een attribuut dat de technische identifier van het veld aangeeft waarop de filter is gebaseerd.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: To get the technical identifier of a field, you need to be aware of the dataset schema. It is available in the Information tab of the dataset. The dataset schema shows all information about each field: name (label), description, identifier, type, and a value exemple. It's often convenient to know the type and the identifier of each field when using advanced widget parameters.
de: Um die technische Kennung zu erhalten, müssen Sie das Schema des Datensatzes kennen. Sie finden es in der Registerkarte Informationen des Datensatzes. Das Schema des Datensatzes bietet alle Informationen zu jedem Feld: Name (Beschriftung), Beschreibung, Kennung, Typ und ein Wertbeispiel. Es ist oft angebracht, den Typ und die Kennung jedes Feldes zu kennen, wenn Sie mit erweiterten Widget-Parametern arbeiten.
es: Para obtener el identificador técnico de campo, tiene que conocer el esquema del conjunto de datos. Está disponible en la ficha de información del conjunto de datos. El esquema del conjunto de datos muestra toda la información de cada uno de los campos: nombre (etiqueta), descripción, identificador, tipo y un ejemplo de valor. Suele ser útil conocer el tipo y el identificador de cada uno de los campos al usar parámetros de widgets avanzados.
fr: Pour récupérer l'identifiant technique d'un champ, vous devez connaître le modèle de données. Ce dernier se trouve dans l'onglet Informations du jeu de données. Le modèle de données présente toutes les informations de chaque champ : nom (label), description, identifiant, type et exemple de valeur. Il est souvent pratique de connaître le type et l'identifiant de chaque champ quand vous utilisez des paramètres de widget avancés.
nl: Om de technische identifier van een veld terug te vinden, moet u zich bewust zijn van het datasetschema. Dit staat in het informatietabblad van de dataset. Het datasetschema toont alle informatie over elk veld: naam (label), beschrijving, identifier, type en een waardevoorbeeld. Het is vaak gemakkelijk om het type en de identifier van elk veld te kennen wanneer geavanceerde widgetparameters worden gebruikt.

source: In the code below, comment were added just in order to help you see the different elements that we have.
de: Im folgenden Code wurden Kommentare hinzugefügt, damit Sie die verschiedenen Elemente sehen, die uns vorliegen.
es: En el código siguiente, hemos añadido comentarios simplemente a modo de ayuda para que vea los distintos elementos que tenemos.
fr: Dans le code ci-dessous, nous avons ajouté des commentaires pour vous aider à distinguer les différents éléments présents.
nl: In de onderstaande code werd commentaar toegevoegd om u te helpen om de verschillende elementen te zien die we hebben.

source: 20 + Go to the Dataset schema section of the Information tab of your dataset.
de: 20 + Wechseln zum Datenschema-Bereich der Registerkarte Informationen des Datensatzes.
es: 20 + Vaya a la sección Esquema de conjunto de datos de la ficha Información del conjunto de datos.
fr: 20 + Accédez à la section Modèle de données de l'onglet Informations de votre jeu de données.
nl: 20 + Ga naar de rubriek Datasetschema van het informatietabblad van uw dataset;

source: 21 + Find the technical identifiers of the fields on which are based the filters you want to add to the dashboard. In our UNESCO World Heritage example dataset, we wanted to filter by category and country. Respectively, the technical identifiers of the fields we want to use as filters are ``category`` and ``states``.
de: 21 + Suchen Sie die technischen Kennungen der Felder, auf denen die Filter basieren, die Sie dem Dashboard hinzufügen möchten. In unserem UNESCO-Welterbe-Beispieldatensatz wollten wir nach Kategorie und Land filtern. Entsprechend sind die technischen Kennungen der Felder, die wir als Filter verwenden möchten ``Kategorie`` und ``Länder``.
es: 21 + Busque los identificadores técnicos de los campos en que se basan los filtros que desea añadir al panel. En nuestro conjunto de datos de la Lista del Patrimonio de la UNESCO de ejemplo, hemos querido filtrar por categoría y país. Respectivamente, los identificadores técnicos de los campos que queremos usar como filtros son ``category`` y ``states``.
fr: 21 + Recherchez les identifiants techniques des champs sur lesquels les filtres sont basés et que vous souhaitez ajouter au tableau de bord. Dans notre exemple de jeu de données UNESCO World Heritage, nous souhaitions appliquer des filtres par catégorie et par pays. Les identifiants des champs que nous voulons utiliser comme filtres sont, respectivement, ``category`` et ``states``.
nl: 21 + Zoek de technische identifiers van de velden waarop de filters zijn gebaseerd die u wilt toevoegen aan het dashboard. In onze voorbeelddataset UNESCO Werelderfgoed, willen we filteren per categorie en per land. De technische identifiers van de velden die we willen gebruiken als filters zijn respectievelijk "categorie" en "landen".

source: 22 + Back to the code of your dashboard, fill up both the titles and the ``ods-facet name`` attributes.
de: 22 + Zurück im Code Ihres Dashboards füllen Sie sowohl die Titel als auch die Attribute ``ods-facet name`` aus.
es: 22 + Vuelva al código de su panel, especifique los títulos y los atributos ``ods-nombre de faceta``.
fr: 22 + Revenez au code de votre tableau de bord pour renseigner les titres et les attributs ``ods-facet name``.
nl: 22 + Vul in de code van uw dashboard zowel de titels als de attributen "ods-facet name" in.

source: 23 + Save your page and click on :tutorial-keycap:`Preview`. Our 2 chosen filters are displayed on our dashboard!
de: 23 + Speichern Sie Ihre Seite und klicken Sie auf :tutorial-keycap:`Vorschau`. Unsere beiden ausgewählten Filter werden auf unserem Dashboard angezeigt!
es: 23 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`. ¡Los 2 filtros seleccionados se visualizan en el panel!
fr: 23 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu`. Les 2 filtres que nous avons choisis s'affichent sur notre tableau de bord !
nl: 23 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`. Onze 2 gekozen fitlers staan weergegeven op ons dashboard!

source: Format your dashboard: organize your widgets in rows and columns
de: Formatieren Sie Ihr Dashboard: Organisieren Sie Ihre Widgets in Zeilen und Spalten
es: Dar formato al panel: organizar los widgets en filas y columnas
fr: Mettre en forme votre tableau de bord : organiser vos widgets en lignes et en colonnes
nl: Uw dashboard formatteren: organiseer uw widgets in rijen en kolommen

source: Our dashboard is quite nice, but to make it even nicer we should now give it some style and organize it differently. For now, we have simply piled up all our elements (both titles and widgets). Let's change that!
de: Unser Dashboard sieht ganz nett aus, aber um es noch ansehnlicher zu gestalten, können wir ihm jetzt etwas Stil verleihen und es anders organisieren. Bisher haben wir einfach alle unsere Elemente (Titel und Widgets) aufgereiht. Das sollten wir jetzt ändern!
es: Nuestro panel tiene un aspecto bastante bueno, pero para que sea aún mejor ahora deberíamos darle estilo y organizarlo de otro modo. De momento, simplemente tenemos apilados todos los elementos (títulos y widgets). ¡Eso va a cambiar!
fr: Notre tableau de bord est plutôt esthétique, mais pour l'améliorer davantage, nous devons le personnaliser et l'organiser différemment. Pour le moment, nous avons simplement empilé tous nos éléments (les titres et les widgets). Il est temps de changer tout cela !
nl: Ons dashboard ziet er netjes uit, maar het zou nog mooier zijn mochten we het nu een beetje stijl geven en het op een andere manier organiseren. Tot nu toe hebben we al onze elementen (zowel titels als widgets) op elkaar gestapeld. We gaan dit nu veranderen!

source: We will organize our dashboard in 2 parts:
de: Wir werden unser Dashboard in 2 Teile unterteilen:
es: Organizaremos nuestro panel en 2 partes:
fr: Nous allons organiser notre tableau de bord en 2 parties :
nl: We organiseren ons dashboard in 2 delen:

source: on the left, we will put our navigation elements (the search bar, and the filters underneath)
de: auf der linken Seite bringen wir unsere Navigationselemente (die Suchleiste und die Filter darunter) an
es: A la izquierda, colocaremos los elementos de navegación (la barra de búsqueda y los filtros debajo).
fr: à gauche, nous allons placer nos éléments de navigation (la barre de recherche et les filtres en dessous) ;
nl: links plaatsen we onze navigatie-elementen (de zoekbalk en daaronder de filters)
