Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard/how_to_build_dashboard_part2.po
Languages: de, es, fr, nl

source: How to build a dashboard (part 2)
de: Ein Dashboard aufbauen (2. Teil)
es: Cómo crear un panel (parte 2)
fr: Créer un tableau de bord (2e partie)
nl: Hoe een dashboard bouwen (deel 2)

source: ★★☆ Intermediate - time: 1 hour
de: ★★☆ Fortgeschrittene - Dauer: 1 Stunde
es: ★★☆ Intermedio - Tiempo: 1 hora
fr: ★★☆ Intermédiaire - durée : 1 heure
nl: ★★☆ Intermediate - tijd: 1 uur

source: *This tutorial will teach you how to go from a simple dashboard with 3 visualizations to an organized, formatted dashboard with interactive widgets linked with one another!*
de: *In diesem Tutorial erfahren Sie, wie Sie von einem einfachen Dashboard mit 3 Visualisierungen zu einem organisierten, formatierten Dashboard mit interaktiven Widgets, die miteinander verbunden sind, übergehen können!*
es: *Con este tutorial aprenderá a pasar de un panel sencillo con 3 visualizaciones a un panel con un formato adecuado y organizado, ¡con widgets interactivos vinculados entre sí!*
fr: *Ce tutoriel va vous guider tout au long des étapes de transformation d'un simple tableau de bord avec 3 visualisations en un tableau de bord organisé et mis en forme avec des widgets interactifs liés les uns aux autres !*
nl: *In deze handleiding leert u hoe u van een eenvoudig dashboard met 3 weergaven kunt gaan naar een georganiseerd, geformatteerd dashboard met interactieve widgets die aan elkaar zijn gekoppeld!*

source: During this tutorial, you will learn:
de: Dieses Tutorial vermittelt Ihnen Folgendes:
es: En este tutorial, aprenderá:
fr: Au cours de ce tutoriel, vous allez apprendre :
nl: Met deze handleiding leert u:

source: how to link widgets together using a context
de: Wie Sie Widgets mithilfe eines Kontexts miteinander verbinden
es: Cómo vincular widgets entre sí mediante un contexto
fr: à lier des widgets à l'aide d'un contexte ;
nl: hoe met behulp van een context widgets aan elkaar koppelen

source: how to add other OpenDataSoft widgets
de: Wie Sie weitere OpenDataSoft-Widgets hinzufügen können
fr: à ajouter d'autres widgets OpenDataSoft ;

source: how to use CSS classes to format and organize your dashboard
de: Wie Sie CSS-Klassen verwenden, um Ihr Dashboard zu formatieren und zu organisieren
es: Cómo utilizar las clases CSS para dar formato al panel y organizarlo
fr: à utiliser des classes CSS pour mettre en forme et organiser votre tableau de bord.
nl: hoe CSS-klassen gebruiken om uw dashboard te formatteren en te organiseren

source: **PREREQUISITES**
de: **VORRAUSSETZUNGEN**
es: **REQUISITOS PREVIOS**
fr: **PRÉREQUIS**
nl: **VOORVEREISTEN**

source: In order to create a dashboard, you need to have access to the back office of an OpenDataSoft portal and the "Edit all pages" permission.
de: Um ein Dashboard zu erstellen, benötigen Sie Zugriff auf das Backoffice eines OpenDataSoft-Portals und die Berechtigung "Alle Seiten bearbeiten".
fr: Pour créer un tableau de bord, vous avez besoin d'un accès à l'interface d'administration d'un portail OpenDataSoft, ainsi que de la permission "Éditer toutes les pages".

source: You are highly recommended to follow the first part of this dashboard tutorial, :doc:`"How to build a dashboard (part 1)" <how_to_build_dashboard_part1>`, since this second part starts with what we ended with in the first part. The prerequisites of the first part also contain all information about the chosen example dataset.
de: Wir empfehlen Ihnen dringend, den ersten Teil dieses Tutorials :doc:`"Ein Dashboard aufbauen (1. Teil)" <how_to_build_dashboard_part1>` zu beachten, da dieser zweite Teil an der Stelle weitermacht, wo wir mit dem ersten Teil aufgehört haben. Die Voraussetzungen des ersten Teils enthalten außerdem alle Informationen über den gewählten Beispieldatensatz.
es: Recomendamos vivamente que siga la primera parte de este tutorial sobre paneles, :doc:`"Cómo crear un panel (parte 1)" <how_to_build_dashboard_part1>`, dado que la segunda parte es una continuación de la primera. Los requisitos previos de la primera parte también contienen toda la información necesaria sobre el conjunto de datos de ejemplo seleccionado.
fr: Nous vous recommandons vivement de suivre la première partie de ce tutoriel, doc:`"Créer un tableau de bord (1re partie)"<how_to_build_dashboard_part1> `, puisque la seconde partie commence avec ce que nous avons fait dans la première partie. Les prérequis de la première partie contiennent également toutes les informations sur l'exemple de jeu de données choisi.
nl: U wordt sterk aangeraden om het eerste deel van deze dashboardhandleiding , :doc:`"Hoe een dashboard bouwen (deel1)" <how_to_build_dashboard_part1>` te volgen omdat dit tweede deel begint met het datgene waarmee we in het eerste deel zijn geëindigd. De voorvereisten van het eerste deel bevatten ook alle informatie over de gekozen voorbeelddataset.

source: Show all images
de: Alle Bilder anzeigen
es: Mostrar todas las imágenes
fr: Afficher toutes les images
nl: Alle afbeeldingen tonen

source: Hide all images
de: Alle Bilder verbergen
es: Ocultar todas las imágenes
fr: Masquer toutes les images
nl: Alle afbeeldingen verbergen

source: Link your widgets together
de: Widgets miteinander verbinden
es: Vincular los widgets entre sí
fr: Lier vos widgets
nl: Uw widgets aan elkaar koppelen

source: At the end of the first part of this tutorial to build a dashboard, we had a simple dashboard with a title and 3 widgets (a table view, a map view and a chart from one same dataset) one on top of the other. Now, in the previous part, we saw that the great advantage of widgets is that they can interact with each other. However, if we draw a shape on the map, it filters the displayed items of the map, but unfortunatly only the map reacts. Both the table and chart ignore our filter.
de: Am Ende des ersten Teils dieses Tutorials zum Erstellen eines Dashboards hatten wir ein einfaches Dashboard mit einem Titel und 3 Widgets (eine Tabellenansicht, eine Kartenansicht und ein Diagramm aus demselben Datensatz). In diesem vorherigen Teil haben wir festgestellt, dass der große Vorteil von Widgets darin besteht, dass sie miteinander interagieren können. Wenn wir jedoch eine Form auf der Karte zeichnen, werden die angezeigten Elemente der Karte gefiltert, wobei jedoch nur die Karte reagiert. Sowohl die Tabelle als auch das Diagramm ignorieren den Filter.
es: Al final de la primera parte de este tutorial para crear un panel, teníamos un panel sencillo con 1 título y 3 widgets (una vista de tabla, una vista de mapa y un gráfico de un mismo conjunto de datos) uno sobre otro. En la parte anterior, hemos visto que la gran ventaja de los widgets es que pueden interactuar entre sí. No obstante, si dibujamos una forma en el mapa, se filtran los elementos visualizados del mapa, pero solo reacciona el mapa. La tabla y el gráfico pasan por alto nuestro filtro.
fr: À la fin de la première partie de ce tutoriel de création d'un tableau de bord, nous avions un simple tableau de bord avec un titre et 3 widgets (une vue Tableau, une vue Carte et un graphe provenant du même jeu de données), les uns au-dessus des autres. Dans la partie précédente, nous avons également vu que l'avantage des widgets était qu'ils pouvaient interagir entre eux. Toutefois, si nous dessinons une forme sur la carte, celle-ci filtre les éléments affichés, mais elle est la seule à réagir. Le tableau et le graphe ignorent notre filtre.
nl: Op het einde van het eerste deel van deze handleiding over hoe een dashboard kan worden gebouwd, hadden we een gewoon dashboard met een titel en 3 widgets (een tabelweergave, een kaartweergave en een grafiek uit eenzelfde dataset) boven elkaar. In het vorige deel zagen we dat het grote voordeel van widgets is dat ze met elkaar kunnen interageren. Wanneer we echter een vorm op een kaart tekenen, filtert deze de weergegeven items op de kaart maar jammer genoeg reageert enkel de kaart. Zowel de tabel als de grafiek negeren onze filter.

source: It is because our widgets are not yet linked to one another. The secret to do this, is to use the same context for all widgets. The context is the pivot between each element of your page, this is why all the widgets that should interact together must use the same context. More than that, the context is the link between your widgets and the dataset behind: it defines on which dataset your widgets should work, the data from which dataset your widgets should use.
de: Das liegt daran, dass unsere Widgets noch nicht miteinander verbunden sind. Um dies zu erreichen, muss der gleiche Kontext für alle Widgets verwendet werden. Der Kontext ist der Knotenpunkt zwischen allen Elementen Ihrer Seite. Deshalb müssen alle Widgets, die miteinander interagieren sollen, den gleichen Kontext verwenden. Darüber hinaus ist der Kontext das Bindeglied zwischen Ihren Widgets und dem zugrunde liegenden Datensatz: Er bestimmt, auf Grundlage welchen Datensatzes Ihre Widgets funktionieren und welche Daten aus welchem Datensatz Ihre Widgets verwenden.
es: Esto se debe a que nuestros widgets aún no están vinculados entre sí. Para ello, el secreto reside en usar el mismo contexto para todos los widgets. Dado que el contexto es el pivote clave que existe entre cada uno de los elementos de las páginas, todos los widgets que tienen que interactuar deben usar el mismo contexto. Además, el contexto es el vínculo entre los widgets y el conjunto de datos que los sustenta: define qué conjunto de datos deben utilizar los widgets como base para trabajar, o los datos de qué conjunto de datos deben utilizar los widgets.
fr: Cela s'explique par le fait que nos widgets ne sont pas encore liés les uns aux autres. Pour résoudre ce problème, il suffit d'utiliser le même contexte pour tous les widgets. Le contexte joue un rôle de pivot entre chaque élément de votre page, et c'est pour cette raison que tous les widgets qui ont besoin d'interagir ensemble doivent utiliser le même contexte. En plus de cela, le contexte est le lien entre vos widgets et le jeu de données sous-jacent : il définit le jeu de données sur lequel vos widgets doivent fonctionner, ainsi que les données du jeu de données que vos widgets doivent utiliser.
nl: Dit is omdat onze widgets nog niet aan elkaar zijn gekoppeld. Het geheim hiervoor is om dezelfde context voor alle widgets te gebruiken. De context is het scharnierpunt tussen elk element van uw pagina. Daarom moeten alle widgets die met elkaar zouden moeten interageren, dezelfde context hebben. Bovendien is de context de link tussen uw widgets en de achterliggende dataset: hij definieert op welke dataset uw widgets zouden moeten werken, de data uit welke dataset die uw widgets zouden moeten gebruiken.

source: 1 + Let's find this context! Look at the HTML code of your page. For each widget we added, its code contains 2 main elements: an ``ods-dataset-context`` first, then an ``ods-map`` or ``ods-table`` or ``ods-chart`` depending on the widget. In the code below, we added comments just in order to help you see the different elements that we have.
de: 1 + Dann sehen wir uns diesen Kontext einmal genauer an! Schauen Sie sich den HTML-Code Ihrer Seite an. Für jedes von uns hinzugefügte Widget enthält der Code zwei Hauptelemente: zunächst ``ods-dataset-context`` und dann ``ods-map`` oder ``ods-table`` oder ``ods-chart``, je nach Widget. Im folgenden Code haben wir Kommentare hinzugefügt, damit Sie die verschiedenen Elemente sehen können.
es: 1 + ¡Vamos a buscar este contexto! Examine el código HTML de la página. Para cada uno de los widgets añadidos, el código contiene 2 elementos principales: primero ``ods-dataset-context`` y después ``ods-map`` u ``ods-table`` u ``ods-chart`` según el widget. En el código siguiente, hemos añadido comentarios simplemente a modo de ayuda para que vea los distintos elementos que tenemos.
fr: 1 + Partons à la recherche de ce fameux contexte ! Observez le code HTML de votre page. Pour chacun des widgets que nous avons ajoutés, son code contient 2 éléments principaux : un élément ``ods-dataset-context`` au début, puis un élément ``ods-map`` ou ``ods-table`` ou ``ods-chart`` en fonction du widget. Dans le code ci-dessous, nous avons ajouté des commentaires pour vous aider à distinguer les différents éléments présents.
nl: 1 + We gaan eerste deze context zoeken! Bekijk de HTML-code van uw pagina. Voor elke widget die we hebben toegevoegd, bevat de code ervan 2 hoofdelementen: eerste een ``ods-dataset-context`` en daarna een ``ods-map`` of ``ods-table`` of ``ods-chart`` afhankelijk van de widget. In de code eronder hebben we commentaren toegevoegd om u te helpen om de verschillende elementen die we hebben, te zien.

source: As you can see, we have a context for each widget. First, it is not so useful in our case, since all our widgets use the same data from the same dataset. Second, it prevents us to link our widgets together. We must have a unique context.
de: Wie Sie sehen können, haben wir für jedes Widget einen eigenen Kontext. Das ist im vorliegenden Fall nicht besonders nützlich, da all unsere Widgets die gleichen Daten aus demselben Datensatz verwenden. Außerdem wird so verhindert, dass wir unsere Widgets miteinander verbinden können. Aus diesem Grund benötigen wir einen einzigen Kontext.
es: Como puede ver, tenemos un contexto para cada uno de los widgets. En primer lugar, no es algo demasiado útil en nuestro caso, ya que todos nuestros widgets emplean los mismos datos del mismo conjunto de datos. En segundo lugar, nos impide vincular los widgets entre sí. Debemos tener un contexto único.
fr: Comme vous pouvez le voir, chaque widget a un contexte. Premièrement, il n'est pas si utile dans notre cas, puisque tous nos widgets utilisent les mêmes données issues du même jeu de données. Deuxièmement, il nous empêche de lier nos widgets entre eux. Nous devons avoir un contexte unique.
nl: Zoals u kunt zien, hebben we een context voor elke widget. Ten eerste is dit niet echt nuttig in ons geval omdat al onze widgets dezelfde data uit dezelfde dataset gebruiken. Ten tweede verhindert deze ons onze widgets aan elkaar te koppelen. We moeten een unieke context hebben.

source: 2 + At the very beginning of your code, above the div tag with the container-fluid class, declare the unique context of your page. Just like for the widgets, use the tag ``ods-dataset-context`` (and don't forget the closing tag!). Look at the code below to understand how this tag works (once again, comments are used to add explainations to the code).
de: 2 + Geben Sie ganz zu Beginn Ihres Codes, oberhalb des div-Tags mit der Klasse container-fluid den spezifischen Kontext Ihrer Seite an. Verwenden Sie wie bei den Widgets das Tag ``ods-dataset-context`` (und vergessen Sie nicht das abschließende Tag!). Sehen Sie sich den folgenden Code an, um zu verstehen, wie dieses Tag funktioniert (wieder einmal werden Kommentare verwendet, um dem Code Erklärungen hinzuzufügen).
es: 2 + Al principio del todo de su código, sobre la etiqueta div con la clase container-fluid, declare el contexto único de la página. Como con los widgets, utilice la etiqueta ``ods-dataset-context`` (¡y no olvide la etiqueta final!). Eche una ojeada al código siguiente para entender cómo funciona esta etiqueta (como antes, los comentarios añaden explicaciones al código).
fr: 2 + Au tout début de votre code, au-dessus du tag div avec la classe container-fluid, déclarez le contexte unique de votre page. À l'instar des widgets, utilisez le tag ``ods-dataset-context`` (sans oublier le tag fermant !). Observez le code ci-dessous pour comprendre le fonctionnement des tags (une fois de plus, nous avons ajouté des commentaires pour expliquer le code).
nl: 2 + Helemaal in het begin van uw code, boven het div-label met de container-fluid klasse, staat de unieke context van uw pagina. Gebruik net zoals voor de widgets het label "ods-dataset-context" (en vergeet het eindlabel niet). Bekijk de onderstaande code om te begrijpen hoe dit label werkt (opnieuw worden er commentaren gebruikt om uitleg aan de code toe te voegen).

source: 3 + Delete the context of each widget. Don't forget that tags come in pairs: you must delete both the opening tag and closing tag for each widget. Your code should now look like this, with a unique context followed by the 3 widgets tags:
de: 3 + Löschen Sie den Kontext jedes Widgets. Vergessen Sie nicht, dass Tags aus zwei Teilen bestehen: Sie müssen sowohl das öffnende Tag als auch das schließende Tag für jedes Widget löschen. Ihr Code sollte nun so aussehen, mit einem einzigen Kontext, gefolgt von den 3 Widget-Tags:
es: 3 + Suprima el contexto de cada uno de los widgets. No olvide que las etiquetas van de dos en dos: debe suprimir la etiqueta inicial y la etiqueta final de cada uno de los widgets. Ahora el código debería mostrar esta apariencia, con un contexto único seguido de las etiquetas de los 3 widgets:
fr: 3 + Supprimez le contexte de chaque widget. N'oubliez pas que les tags vont par paire : vous devez supprimer le tag ouvrant et le tag fermant de chaque widget. Votre code doit maintenant ressembler à ce qui suit, avec un contexte unique suivi de 3 tags de widgets :
nl: 3 + Verwijder de context van elke widget. Vergeet niet dat labels altijd met twee zijn: uw moet voor elke widget zowel het openingslabel als het eindlabel verwijderen. Uw code zou er nu als volgt moeten uitzien, met een unieke context gevolgd door de 3 widgetlabels:

source: 4 + Save your page and click the :tutorial-keycap:`Open page` button. Now, if you draw a shape on the map, the map will be filtered according to that shape, but both the table and chart will be filtered as well according to that same filter. Our widgets are linked together!
de: 4 + Speichern Sie Ihre Seite und klicken Sie auf den Button :tutorial-keycap:`Seite öffnen`. Wenn Sie nun eine Form auf der Karte zeichnen, wird die Karte entsprechend dieser Form gefiltert, und die Tabelle als auch das Diagramm werden ebenfalls gefiltert. Unsere Widgets sind miteinander verknüpft!
es: 4 + Guarde la página y haga clic en el botón :tutorial-keycap:`Abrir página`. Ahora, si dibuja una forma en el mapa, el mapa se filtrará según esa forma, pero tanto la tabla como el gráfico se filtrarán también conforme a ese mismo criterio. ¡Nuestros widgets están vinculados entre sí!
fr: 4 + Enregistrez votre page et cliquez sur le bouton :tutorial-keycap:`Ouvrir la page`. Désormais, si vous dessinez une forme sur la carte, la carte sera filtrée en fonction de cette forme, tout comme le tableau et le graphe. Nos widgets sont maintenant liés !
nl: 4 + Sla uw pagina op en klik op de knop :tutorial-keycap:`Open page` . Wanneer u nu een vormt op de kaart tekent, zal de kaart worden gefilterd volgens die vorm, maar zullen zowel de tabel als de grafiek worden gefilterd volgens diezelfde filter. Onze widgets zijn aan elkaar gekoppeld!

source: Add more OpenDataSoft widgets
de: Weitere OpenDataSoft-Widgets hinzufügen
fr: Ajouter d'autres widgets OpenDataSoft

source: 5 + Now that our widgets are linked, why not add more widgets to make our dashboard even better? Let's start by adding a search bar. It would allow us to make a textual research on all the visualizations at the same time. Go to the OpenDataSoft widgets documentation to learn more about the widget we are goint to use, which is called `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_.
de: 5 + Jetzt, wo unsere Widgets miteinander verbunden sind, können wir weitere Widgets hinzufügen, um unser Dashboard noch besser zu machen. Beginnen wir mit dem Hinzufügen einer Suchleiste. Damit können wir eine Textsuche für alle Visualisierungen gleichzeitig durchführen. In der OpenDataSoft-Dokumentation finden Sie weitere Informationen über das von uns verwendete Widget mit der Bezeichnung `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_
fr: 5 + Maintenant que nos widgets sont liés, pourquoi ne pas en ajouter d'autres pour avoir un tableau de bord encore plus perfectionné ? Commençons par ajouter une barre de recherche. Elle nous permettra d'effectuer des recherches textuelles sur toutes les visualisations en même temps. Accédez à la documentation sur les widgets OpenDataSoft pour en apprendre davantage sur le widget que nous allons utiliser, appelé `odsTextSearch <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsTextSearch>`_.

source: In the odsTextSearch widget documentation, you have several information:
de: In der Dokumentation des Widgets odsTextSearch finden Sie unterschiedliche Informationen:
es: En la documentación del widget odsTextSearch puede encontrar diversa información:
fr: Dans la documentation sur le widget odsTextSearch, vous avez plusieurs informations :
nl: In de documentatie over de odsTextSearch widget vindt u allerhande informatie terug:

source: the description, to know what the widget can be used for
de: eine Beschreibung, um zu erfahren, wofür das Widget verwendet werden kann
es: La descripción, para saber para qué sirve el widget
fr: une description, pour connaître l'utilité du widget ;
nl: de beschrijving om te weten waarvoor de widget kan worden gebruikt

source: the widget code, to copy and paste in the code of your page
de: den Widget-Code, den Sie kopieren und in den Code Ihrer Seite einfügen können
es: El código del widget, para copiarlo y pegarlo en el código de la página
fr: le code du widget, à copier et coller dans le code de votre page ;
nl: de widget code om deze te kopiëren en in de code van uw pagina te plakken

source: a table with the attributes of the widget, which values you must fill up for the widget to work
de: eine Tabelle mit den Attributen des Widgets und welche Werte Sie ausfüllen müssen, damit das Widget funktioniert
es: Una tabla con los atributos del widget, y los valores que debe especificar para que el widget funcione
fr: un tableau avec les attributs du widget, ainsi que les valeurs que vous devez renseigner pour que le widget fonctionne ;
nl: een tabel met de attributen van de widget. U moet de waarden ervan aanvullen, zo niet werkt uw widget niet

source: example of both the final code and the final result
de: ein Beispiel für den endgültigen Code und das Endergebnis
es: Un ejemplo del código final y el resultado
fr: un exemple du code final et du résultat final.
nl: voorbeeld van zowel de eindcode als het eindresultaat

source: 6 + Copy the odsTextSearch widget code.
de: 6 + Kopieren Sie den odsTextSearch Widget-Code.
es: 6 + Copie el código del widget odsTextSearch.
fr: 6 + Copiez le code du widget odsTextSearch.
nl: 6 + Kopieer de odsTextSearch widget code.

source: 7 + Paste the widget code in the code of your page, where you want it to be displayed. Let's put it under the title, above the first visualization widget.
de: 7 + Fügen Sie den Widget-Code an die Stelle des Codes Ihrer Seite ein, wo er angezeigt werden soll. Fügen wir ihn unter dem Titel ein, über dem ersten Visualisierungs-Widget.
es: 7 + Pegue el código del widget en el código de la página, donde desea que se muestre. Vamos a colocarlo bajo el título, sobre el primer widget de visualización.
fr: 7 + Collez le code du widget dans le code de votre page, à l'endroit où vous souhaitez qu'il soit affiché. Plaçons-le sous le titre, au-dessus du premier widget de visualisation.
nl: 7 + Plak de widget code in de code van uw pagina waar u wilt dat deze wordt weergegeven. We gaan deze onder de titel en boven de eerste weergavewidget plaatsen.the widget code in the code of your page, where you want it to be displayed. Let's put it under the title, above the first visualization widget.

source: Caution
de: Vorsicht
es: Precaución
fr: Avertissement
nl: Opgelet
