Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard/how_to_build_dashboard_part1.po
Languages: de, es, fr, nl

source: How to build a dashboard (part 1)
de: Ein Dashboard aufbauen (1. Teil)
es: Cómo crear un panel (parte 1)
fr: Créer un tableau de bord (1re partie)
nl: Hoe een dashboard bouwen (deel 1)

source: ★☆☆ Beginner - time: 30 minutes
de: ★☆☆ Anfänger - Dauer: 30 Minuten
es: ★☆☆ Principiante - Tiempo: 30 minutos
fr: ★☆☆ Débutant - durée : 30 minutes
nl: ★☆☆ Beginner - tijd: 30 minuten

source: *This tutorial will teach you how to create a dashboard using 3 visualizations from a dataset published on an Opendatasoft portal.*
de: *In diesem Tutorial erfahren Sie, wie Sie ein Dashboard mit 3 Visualisierungen aus einem Datensatz erstellen, der auf einem Opendatasoft-Portal veröffentlicht wurde*.
es: *Con este tutorial aprenderá a crear un panel utilizando 3 visualizaciones de un conjunto de datos publicado en un portal Opendatasoft.*

source: During this tutorial, you will learn:
de: Dieses Tutorial vermittelt Ihnen Folgendes:
es: En este tutorial, aprenderá:
fr: Au cours de ce tutoriel, vous allez apprendre :
nl: Met deze handleiding leert u:

source: what a widget is
de: Was ein Widget ist
es: Qué es un widget
fr: ce qu'est un widget ;
nl: wat een widget is

source: what an iframe is
de: Was ein Iframe ist
es: Qué es un iframe
fr: ce qu'est un iframe ;
nl: wat een iframe is

source: what is the difference between a widget and an iframe
de: Der Unterschied zwischen einem Widget und einem Iframe
es: Cuál es la diferencia entre un widget y un iframe
fr: la différence entre un widget et un iframe ;
nl: wat het verschil is tussen een widget en een iframe

source: how to use a widget in a content page created with Opendatasoft
de: Wie Sie ein Widget in einer mit Opendatasoft erstellten Inhaltsseite verwenden
es: Cómo usar un widget en una página de contenido creada con Opendatasoft

source: **PREREQUISITES**
de: **VORRAUSSETZUNGEN**
es: **REQUISITOS PREVIOS**
fr: **PRÉREQUIS**
nl: **VOORVEREISTEN**

source: In order to create a dashboard, you need to have access to the back office of an Opendatasoft portal and the "Edit all pages" permission.
de: Um ein Dashboard zu erstellen, benötigen Sie Zugriff auf das Backoffice eines Opendatasoft-Portals und die Berechtigung "Alle Seiten bearbeiten".
es: Para crear un panel, debe tener acceso al back office de un portal Opendatasoft y el permiso "Editar todas las páginas".

source: We highly recommend to follow the tutorial with the `World Heritage List dataset published on our data network, Data <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. This dataset will be our example dataset used throughout the whole tutorial. If you however choose to follow the tutorial with another dataset, make sure to choose one with a Table view, as well as a Map view and an Analyze view. You will also need to adapt your own page code for it to match your chosen dataset.
de: Wir empfehlen Ihnen, für dieses Tutorial den Datensatz "World Heritage List" (Liste der Weltkulturerbe) zu verwenden, der in unserem Datennetzwerk veröffentlicht wurde <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. Diesen Datensatz verwenden wir als Beispiel im gesamten Tutorial. Wenn Sie das Tutorial mit einem anderen Datensatz fortsetzen möchten, so sollte dieser über eine Tabellenansicht, eine Kartenansicht sowie eine Analyseansicht verfügen. Sie müssen außerdem Ihren eigenen Seitencode an den von Ihnen gewählten Datensatz anpassen.
es: Recomendamos vivamente seguir el tutorial con el `conjunto de datos de la Lista del Patrimonio Mundial publicado en nuestra red de datos, <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. Este será nuestro conjunto de datos de ejemplo a lo largo de todo el tutorial. Sin embargo, si decide seguir el tutorial con otro conjunto de datos, asegúrese de elegir uno con una vista de tabla, además de una vista de mapa y una vista de análisis. También tendrá que adaptar el código de su página para que coincida con el conjunto de datos seleccionado.

source: Show all images
de: Alle Bilder anzeigen
es: Mostrar todas las imágenes
fr: Afficher toutes les images
nl: Alle afbeeldingen tonen

source: Hide all images
de: Alle Bilder verbergen
es: Ocultar todas las imágenes
fr: Masquer toutes les images
nl: Alle afbeeldingen verbergen

source: Create your content page
de: Erstellen Sie Ihre Inhaltsseite
es: Crear la página de contenido
fr: Créer votre page de contenu
nl: Uw contentpagina aanmaken

source: 1 + Go the Back office, in the Pages section.
de: 1 + Öffnen Sie den Seitenbereich des Backoffice.
es: 1 + Vaya a la sección Páginas del back office.
fr: 1 + Accédez à l'interface d'administration, dans la section Pages.
nl: 1 + Ga naar de back-office in de rubriek Pagina's.

source: 2 + Click on the :tutorial-keycap:`+ New page button`, to create a new content page.
de: 2 + Klicken Sie auf den Button :tutorial-keycap:`+ Neue Seite`, um eine neue Inhaltsseite zu erstellen.
es: 2 + Haga clic en el botón :tutorial-keycap:`+ Página nueva` para crear una nueva página de contenido.
fr: 2 + Cliquez sur le bouton :tutorial-keycap:`+ Nouvelle page` pour créer une page de contenu.
nl: 2 + Klik op de knop ":tutorial-keycap:`+ New page button" om een nieuwe contentpagina aan te maken.

source: 3 + By default, you land on the Properties tab. It contains several information about the page, some of which you need to fill up otherwise you will not be able to save the page. Enter a page URL suffix and a title. You can also add a description and tags.
de: 3 + Standardmäßig gelangen Sie zur Registerkarte Eigenschaften. Diese enthält verschiedene Informationen über die Seite. Einige hiervon müssen ausgefüllt werden, da Sie die Seite sonst nicht speichern können. Geben Sie einen URL-Suffix sowie einen Titel der Seite an. Sie können auch eine Beschreibung und Tags hinzufügen.
es: 3 + De forma predeterminada, accederá a la ficha Propiedades. Esta contiene varios campos de información acerca de la página, algunos de los cuales deberá rellenar para poder guardar la página. Especifique un sufijo de dirección URL de la página y un título. También puede añadir una descripción y etiquetas.
fr: 3 + Vous êtes redirigé par défaut sur l'onglet Propriétés. Il contient diverses informations sur la page, dont certaines à renseigner pour pouvoir enregistrer la page. Entrez un titre et un suffixe d'URL. Vous pouvez également ajouter une description et des tags.
nl: 3 + U komt standaard terecht op het tabblad Eigenschappen. Deze bevat verschillende inlichtingen over de pagina, waarvan u er sommige moet aanvullen omdat u anders de pagina niet zult kunnen opslaan. Voer een pagina URL-suffix en een titel in. Ook kunt u een beschrijving en tags toevoegen.

source: 4 + Click the :tutorial-keycap:`Save` button to save your newly created content page.
de: 4 + Klicken Sie auf den Button :tutorial-keycap:`Speichern`, um die neu erstellte Inhaltsseite zu speichern.
es: 4 + Haga clic en el botón :tutorial-keycap:`Guardar` para guardar la página de contenido creada.
fr: 4 + Cliquez sur le bouton :tutorial-keycap:`Enregistrer` pour enregistrer votre nouvelle page de contenu.
nl: 4 + Klik op de knop ":tutorial-keycap:`Save`" om uw nieuw aangemaakte contentpagina op te slaan.

source: 5 + Go to the Content tab.
de: 5 + Öffnen Sie die Registerkarte Inhalt.
es: 5 + Vaya a la ficha Contenido.
fr: 5 + Accédez à l'onglet Contenu.
nl: 5 + Ga naar het tabblad Content.

source: 6 + Click on :tutorial-keycap:`Edit in expert mode` to access the HTML/CSS code of the page. A pop up will appear, click on :tutorial-keycap:`Yes, switch to expert mode` for confirmation matter.
de: 6 + Klicken Sie auf :tutorial-keycap:`Im Expertenmodus bearbeiten`, um auf den HTML-/CSS-Code der Seite zuzugreifen. Es erscheint ein Popup-Fenster. Klicken Sie zur Bestätigung auf :tutorial-keycap:`Ja, in den Expertenmodus wechseln`.
es: 6 + Haga clic en :tutorial-keycap:`Editar en modo experto` para acceder al código HTML/CSS de la página. Aparecerá un mensaje emergente; haga clic en :tutorial-keycap:`Sí, cambiar a modo experto` para confirmar.
fr: 6 + Cliquez sur :tutorial-keycap:`Éditer en mode expert` pour accéder au code HTML/CSS de la page. Une fenêtre s'affiche ; cliquez sur :tutorial-keycap:`Oui, basculer en mode expert` pour confirmer.
nl: 6 + Klik op de knop :tutorial-keycap:`Edit in expert mode` om toegang te hebben tot de HTML/CSS-code van de pagina. Er verschijnt een pop up. Klik op de knop :tutorial-keycap:`Yes, switch to expert mode` om te bevestigen.

source: In the HTML/CSS code area, you should see the following code:
de: Im Bereich des HTML-/CSS-Codes sollten Sie den folgenden Code sehen:
es: En el área de código HTML/CSS, debería ver el código siguiente:
fr: Dans la zone de code HTML/CSS, vous devez voir le code suivant :
nl: In de HTML/CSS-codezone ziet u de volgende code:

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: In the HTML language, every element is represented by a tag. This tag is written between ``<`` and ``>`` and almost always comes in a pair, with an opening tag and a closing tag. E.g. ``<p></p>`` for paragraphs, ``<h1></h1>`` for first level title, ``<div></div>`` for a division/section, etc.
de: In der HTML-Sprache wird jedes Element durch ein Tag dargestellt. Dieses Tag wird zwischen den Zeichen ``<`` und ``>`` geschrieben und besteht meist aus zwei Teilen, einem einleitenden Tag und einem abschließenden Tag. Z. b. ``<p></p>`` für Absätze, ``<h1></h1>`` für die Titelzeile, ``<div></div>`` für einen Abschnitt/Unterabschnitt usw.
es: En el lenguaje HTML, cada uno de los elementos se representa mediante una etiqueta. Esta etiqueta se escribe entre ``<`` y ``>``, y casi siempre va acompañada de otra etiqueta con la cual forma una pareja de etiquetas inicial y final: por ej. ``<p></p>`` para párrafos, ``<h1></h1>`` para títulos de primer nivel, ``<div></div>`` para divisiones/secciones, etc.
fr: En langage HTML, chaque élément est représenté par un tag. Ce tag est écrit entre ``<`` et ``>`` et vient toujours par paire, avec un tag ouvrant et un tag fermant. Par exemple, ``<p></p>`` pour des paragraphes, ``<h1></h1>`` pour un titre de premier niveau, ``<div></div>`` pour une division/section, etc.
nl: In de HTML-taal wordt elk element weergegeven door een label. Dit label staat tussen ``<`` en ``>`` en bestaat bijna altijd uit twee, met een openingslabel en een eindlabel. Bijv. ``<p></p>`` voor paragrafen, ``<h1></h1>`` voor eerste niveautitel, ``<div></div>`` voor een afdeling/rubriek, enz.

source: The ``<div class="container-fluid">`` and ``<div class="ods-box" >`` tags help formatting your page the right way, in order for all elements of your content page to be in a predefined frame with borders. All new elements that you will add in the future should be put inside these 2 tags.
de: Die Tags ``<div class="container-fluid">`` und ``<div class="ods-box" >`` helfen Ihnen, Ihre Seite richtig zu formatieren, damit sich alle Elemente Ihrer Inhaltsseite in einem vordefinierten Fenster mit Rändern befinden. Alle neuen Elemente, die Sie später hinzufügen, sollten zwischen diese 2 Tags eingefügt werden.
es: Las etiquetas ``<div class="container-fluid">`` y ``<div class="ods-box" >`` ayudan a dar a la página el formato deseado, a fin de que todos los elementos de la página de contenido se encuentren en un marco con bordes predefinido. Todos los elementos nuevos que añada en adelante deberán encontrarse entre estas dos etiquetas.
fr: Les tags ``<div class="container-fluid">`` et ``<div class="ods-box" >`` permettent de mettre en forme votre page de façon appropriée, pour que tous les éléments de votre page de contenu se trouvent dans un cadre prédéfini avec des bordures. Tous les nouveaux éléments que vous ajouterez à l'avenir doivent être placés entre ces 2 tags.
nl: De labels ``<div class="container-fluid">`` en ``<div class="ods-box" >`` helpen bij het juist formatteren van uw pagina zodat alle elementen van uw contentpagina in een vooraf gedefinieerd kader met randen staan. Alle nieuwe elementen die u in de toekomst toevoegt, moeten tussen deze 2 labels worden geplaatst.

source: 7 + Save your page.
de: 7 + Speichern Sie Ihre Seite.
es: 7 + Guarde la página.
fr: 7 + Enregistrez votre page.
nl: 7 + Uw pagina opslaan.

source: 8 + Click on :tutorial-keycap:`Preview` to see the current result of your page. Click again on :tutorial-keycap:`Preview` to hide the preview window and go back to your code.
de: 8 + Klicken Sie auf :tutorial-keycap:`Vorschau`, um die aktuelle Darstellung Ihrer Seite zu sehen. Klicken Sie erneut auf :tutorial-keycap:`Vorschau`, um das Vorschaufenster auszublenden und zum Code zurückzukehren.
es: 8 + Haga clic en :tutorial-keycap:`Vista previa` para ver el resultado actual de la página. Vuelva a hacer clic en :tutorial-keycap:`Vista previa` para ocultar la ventana de vista previa y regresar al código.
fr: 8 + Cliquez sur :tutorial-keycap:`Aperçu` pour voir à quoi ressemble votre page pour le moment. Cliquez une nouvelle fois sur :tutorial-keycap:`Aperçu` pour masquer la fenêtre d'aperçu et revenir à votre code.
nl: 8 + Klik op de knop :tutorial-keycap:`Preview` om het huidige resultaat van uw pagina te zien. Klik opnieuw op de knop :tutorial-keycap:`Preview` om het venster met de voorbeeldweergave te verbergen en terug te keren naar uw code.

source: Put content in your page: data visualizations
de: Versehen Sie Ihre Seite mit Inhalten: Datenvisualisierungen
es: Poner contenido en la página: visualizaciones de datos
fr: Ajouter du contenu à votre page : visualisations de données
nl: Content in uw pagina plaatsen: weergaven van gegevens

source: Get the widget code of a visualization
de: Rufen Sie den Widget-Code einer Visualisierung ab
es: Obtener el código de widget de una visualización
fr: Obtenir le code du widget d'une visualisation
nl: Neem de widget code voor een weergave

source: A widget is a piece of code that allows anyone to integrate an interactive element directly on a webpage. In Opendatasoft, there are several widgets which are `all listed and explained in the widget documentation <https://help.opendatasoft.com/widgets/#/api/>`_. Some of the most common Opendatasoft widgets -those we will use in this tutorial- are the visualization widgets. Each data visualization of a published dataset is indeed available as a widget, which code is displayed below the visualization, ready to be copied!
de: Ein Widget ist ein Code, der es jedem ermöglicht, ein interaktives Element direkt auf einer Webseite zu integrieren. Opendatasoft bietet unterschiedliche Widgets, die `in der Widget-Dokumentation aufgelistet und erläutert werden <https://help.opendatasoft.com/widgets/#/api/>`_. Einige der häufigsten Opendatasoft-Widgets - die wir in diesem Tutorial verwenden - sind die Visualisierungs-Widgets. Jede Datenvisualisierung eines veröffentlichten Datensatzes ist als Widget verfügbar. Dessen Code wird unterhalb der Visualisierung angezeigt und kann kopiert werden.
es: Un widget es un fragmento de código que permite a cualquier usuario integrar un elemento interactivo directamente en una página web. En Opendatasoft hay varios widgets, `todos ellos especificados y explicados en la documentación de widgets <https://help.opendatasoft.com/widgets/#/api/>`_. Algunos de los widgets de Opendatasoft más comunes (los que usaremos en este tutorial) son los widgets de visualización. En efecto, cada una de las visualizaciones de datos de un conjunto de datos publicado está disponible en forma de widget, el código del cual aparece bajo la visualización, ¡listo para copiar!

source: 9 + Go to Data, where our dataset is published. Make sure you are on the dataset's page, where you can see the available data visualizations.
de: 9 + Öffnen Sie den Datenbereich, wo unser Datensatz veröffentlicht wird. Stellen Sie sicher, dass Sie sich auf der Seite des Datensatzes befinden, auf der Sie die verfügbaren Datenvisualisierungen sehen können.
es: 9 + Vaya a Datos, donde nuestro conjunto de datos está publicado. Compruebe que se halla en la página del conjunto de datos, donde puede ver las visualizaciones de datos disponibles.
fr: 9 + Accédez à Données, l'emplacement où notre jeu de données est publié. Vérifiez que vous vous trouvez sur la page du jeu de données, où vous pouvez voir les visualisations de données disponibles.
nl: 9 + Ga naar Data waar uw dataset is gepubliceerd. Zorg ervoor dat u op de pagina van de dataset staat waar u de beschikbare dataweergaven kunt zien.

source: 10 + Let's start with the Table view. Click on the Table tab.
de: 10 + Beginnen wir mit der Tabellenansicht. Klicken Sie auf die Registerkarte Tabelle.
es: 10 + Vamos a empezar con la vista de tabla. Haga clic en la ficha Tabla.
fr: 10 + Commençons par la vue Tableau. Cliquez sur l'onglet Tableau.
nl: 10 + Begin met de Tabelweergave. Klik op het tabblad Tabel.

source: 11 + Scroll down the table. You should see 3 tabs: Share, Embed and Widget. Share displays the direct URL of the visualization. Embed displays the iframe code of the visualization. Widget displays the widget code of the visualizations. Each, whereas it is a URL or a code, are ready to be copied and pasted. For this tutorial, we will use the widget codes of the Table, Map and Analyze visualizations of our dataset.
de: 11 + Scrollen Sie in der Tabelle nach unten. 3 Registerkarten sollten zu sehen sein: Teilen, Einbettung und Widget. Unter Teilen wird die direkte URL der Visualisierung angezeigt. Unter Einbettung wird der Iframe-Code der Visualisierung angezeigt. Unter Widget wird der Widget-Code der Visualisierungen angezeigt. Ob Code oder URL: jedes Element kann kopiert und dann eingefügt werden. Für dieses Tutorial verwenden wir die Widget-Codes der Tabellen-,Karten- und Analyse-Visualisierungen unseres Datensatzes.
es: 11 + Desplácese hacia abajo por la tabla. Debería ver 3 fichas: Compartir, Incrustar y Widget. La ficha Compartir muestra la dirección URL directa de la visualización. La ficha Incrustar muestra el código iframe de la visualización. La ficha Widget muestra el código de widget de las visualizaciones. Todo ello, ya sea una dirección URL ya sea un código, está listo para copiar y pegar. En este tutorial, utilizaremos los códigos de widget de las visualizaciones de tabla, mapa y análisis de nuestro conjunto de datos.
fr: 11 + Faites défiler le tableau. Vous devriez voir 3 onglets : Partager, Intégrer et Widget. L'onglet Partager affiche l'URL directe de la visualisation, l'onglet Intégrer affiche le code iframe de la visualisation et l'onglet Widget affiche le code du widget des visualisations. Chacun d'entre eux, qu'il s'agisse d'une URL ou d'un code, peut directement être copiée et collée. Dans le cadre de ce tutoriel, nous allons utiliser les codes de widgets des visualisations Tableau, Carte et Analyse de notre jeu de données.
nl: 11 + Scroll naar beneden in de tabel. U ziet 3 tabs: Share, Embed en Widget. Share toont de rechtstreekse URL van de weergave. Embed toont de iframe-code van de weergave. Widget toont de widgetcode van de weergaven. Elk ervan, of het nu een URL of een code is, is klaar om te worden gekopieerd en geplakt. Voor deze handleiding gebruiken we de widget codes van de weergaven Tabel, Kaart en Analyse van onze dataset.

source: An iframe is a way to easily and safely integrate Opendatasoft content in an isolated frame, independent from the rest of the page. If you want to integrate Opendatasoft content outside the Opendatasoft environment, iframes would be the best way to go, even though some interaction and customization work would probably be needed. Widgets could also be integrated into a page outside the Opendatasoft environment, but know that heavy work would be required.
de: Ein Iframe bietet die Möglichkeit, Opendatasoft-Inhalte einfach und sicher in einen isolierten Bereich zu integrieren, unabhängig vom Rest der Seite. Iframes eignen sich ideal, wenn Sie Opendatasoft-Inhalte außerhalb der Opendatasoft-Umgebung integrieren möchten, wobei wahrscheinlich einige Interaktions- und Anpassungsmaßnahmen erforderlich sind. Widgets können auch in eine Seite außerhalb der Opendatasoft-Umgebung integriert werden, doch würde dies einen erheblichen Aufwand mit sich bringen.
es: Un iframe es una manera fácil y segura de integrar contenido de Opendatasoft en un marco aislado, independiente del resto de la página. Si deseara integrar contenido de Opendatasoft fuera del entorno de Opendatasoft, los iframes serían la mejor forma de hacerlo, aunque probablemente serían necesarias algunas tareas de interacción y personalización. Los widgets también pueden integrarse en una página fuera del entorno de Opendatasoft, aunque eso requeriría mucho trabajo.

source: Since we are building a dashboard directly in an Opendatasoft page, using Opendatasoft widgets is the best option. In the Opendatasoft environment, they are indeed easily customizable and very interactive with other widgets.
de: Da wir ein Dashboard direkt auf einer Opendatasoft-Seite erstellen, ist die Verwendung von Opendatasoft-Widgets die beste Option. In der Opendatasoft-Umgebung sind sie leicht anpassbar und sehr interaktiv mit anderen Widgets.
es: Como estamos creando un panel directamente en una página de Opendatasoft, la mejor opción es usar los widgets de Opendatasoft. En el entorno de Opendatasoft, son realmente fáciles de personalizar y muy interactivos con otros widgets.

source: 12 + Still in the Table tab of our dataset, where the widget code is displayed, click the COPY button to copy the widget code of the table visualization.
de: 12 + Klicken Sie in der Registerkarte Tabelle unseres Datensatzes (wo der Widget-Code angezeigt wird) auf den Button KOPIEREN, um den Widget-Code der Tabellenvisualisierung zu kopieren.
es: 12 + Todavía en la ficha Tabla de nuestro conjunto de datos, donde se visualiza el código de widget, haga clic en el botón COPIAR para copiar el código de widget de la visualización de tabla.
fr: 12 + Toujours dans l'onglet Tableau de notre jeu de données, où le code du widget est affiché, cliquez sur le bouton COPIER pour copier le code du widget de la visualisation de tableau.
nl: 12 + Klik nog steeds in het tabblad Tabel van onze dataset, waar de widget code is weergegeven, op de knop KOPIËREN om de widget code van de tabelweergave te kopiëren.

source: Add a visualization widget to your page
de: Fügen Sie Ihrer Seite ein Visualisierungs-Widget hinzu
es: Añadir un widget de visualización a la página
fr: Ajouter un widget de visualisation à votre page
nl: Een weergave widget toevoegen aan uw pagina

source: 13 + Go back to the back office, to continue to edit your Opendatasoft content page.
de: 13 + Wechseln Sie erneut zum Backoffice, um Ihre Opendatasoft-Inhaltsseite weiter zu bearbeiten.
es: 13 + Vuelva al back office para seguir editando la página de contenido de Opendatasoft.

source: 14 + Paste your table visualization widget code at the right place, between the ``ods-box`` tag (see step 6).
de: 14 + Fügen Sie Ihren Widget-Code der Tabellenvisualisierung an der richtigen Stelle ein, d. h. zwischen den Tag ``ods-box`` (siehe 6. Schritt).
es: 14 + Pegue el código de widget de la visualización de tabla en el lugar adecuado, entre la etiqueta ``ods-box`` (vea el paso 6).
fr: 14 + Collez votre code du widget de visualisation de tableau au bon endroit, entre le tag ``ods-box`` (voir étape 6).
nl: 14 + Plak de widget code van uw tabelweergave op de juiste plaats tussen het label "ods-box" (zie stap 6).
