Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard/how_to_build_dashboard_part1.po
Languages: de, es, fr, nl

source: 15 + Save your page and click on :tutorial-keycap:`Preview`: there is now a table visualization in our page!
de: 15 + Speichern Sie Ihre Seite und klicken Sie auf :tutorial-keycap:`Vorschau`: unsere Seite verfügt nun über eine Tabellenvisualisierung!
es: 15 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`: ¡ahora hay una visualización de tabla en la página!
fr: 15 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu` : notre page contient désormais une visualisation de tableau !
nl: 15 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`: er staat nu een tabelweergave in uw pagina!

source: Add more widgets to your page: map and chart
de: Fügen Sie Ihrer Seite weitere Widgets hinzu: Karte und Diagramm
es: Añadir más widgets a la página: mapa y gráfico
fr: Ajouter d'autres widgets à votre page : carte et graphe
nl: Meer widgets aan uw pagina toevoegen: kaart en grafiek

source: 16 + Let's add a map to our page! Just like before, get the widget code of the Map view of our dataset (see steps 9 to 12, but applied to the Map tab).
de: 16 + Fügen wir unserer Seite jetzt eine Karte hinzu! Rufen Sie wie eben den Widget-Code aus der Kartenansicht unseres Datensatzes ab (siehe Schritte 9 bis 12, jedoch unter Verwendung der Registerkarte Karte).
es: 16 + ¡Vamos a añadir un mapa a nuestra página! Igual que antes, obtenga el código de widget de la vista de mapa de nuestro conjunto de datos (vea los pasos 9-12, pero aplicados a la ficha Mapa).
fr: 16 + Ajoutons une carte à notre page ! Comme nous l'avons fait précédemment, récupérez le code du widget de la vue Carte de notre jeu de données (voir les étapes 9 à 12, en les appliquant à l'onglet Carte).
nl: 16 + Nu gaan we een kaart aan uw pagina toevoegen! Neem zoals daarvoor de widget code van de kaartweergave van uw dataset (zie stappen 9 tot 12, maar toegepast op de tab Kaart).

source: 17 + Paste your map visualization widget code below the widget code of the table visualization (see Add a widget to your page).
de: 17 + Fügen Sie Ihren Widget-Code der Kartenvisualisierung unter dem Widget-Code der Tabellenvisualisierung ein (siehe "Fügen Sie Ihrer Seite ein Widget hinzu").
es: 17 + Pegue el código de widget de la visualización de mapa bajo el código de widget de la visualización de tabla (vea Añadir un widget a la página).
fr: 17 + Collez votre code du widget de visualisation de carte sous le code du widget de la visualisation de tableau (voir Ajouter un widget de visualisation à votre page).
nl: 17 + Plak de widget code van uw kaartweergave onder de widget code van de tabelweergave (zie Een widget aan uw pagina toevoegen).

source: 18 + Let's add one more thing: a chart! Get the widget code of the Analyze view of our dataset.
de: 18 + Fügen wir noch etwas hinzu: ein Diagramm! Rufen Sie den Widget-Code aus der Analyseansicht unseres Datensatzes ab.
es: 18 + Vamos a añadir una cosa más: ¡un gráfico! Obtenga el código de widget de la vista de análisis de nuestro conjunto de datos.
fr: 18 + Ajoutons encore une chose : un graphe ! Récupérez le code du widget de la vue Analyse de notre jeu de données.
nl: 18 + Nu gaan we nog één ding toevoegen: een grafiek! Neem de widget code van de Analyseweergave van uw dataset.

source: 19 + Paste your analyze visualization widget code below the widget code of the map visualization.
de: 19 + Fügen Sie Ihren Widget-Code der Analysevisualisierung unter dem Widget-Code der Kartenvisualisierung ein.
es: 19 + Pegue el código de widget de la visualización de análisis bajo el código de widget de la visualización de mapa.
fr: 19 + Collez votre code du widget de visualisation d'analyse sous le code du widget de la visualisation de carte.
nl: 19 + Plak de widget code van uw analyseweergave onder de widget code van de kaartweergave.

source: 20 + Save your page and click on :tutorial-keycap:`Preview`. We have now 3 visualizations on our page!
de: 20 + Speichern Sie Ihre Seite und klicken Sie auf :tutorial-keycap:`Vorschau`: Wir haben jetzt 3 Visualisierungen auf unserer Seite!
es: 20 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`. ¡Ahora tenemos 3 visualizaciones en la página!
fr: 20 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu`. Notre page contient désormais 3 visualisations !
nl: 20 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`. We hebben nu 3 weergaven op onze pagina!

source: Complete your content page with a title
de: Fügen Sie Ihrer Inhaltsseite einen Titel hinzu
es: Completar la página de contenido con un título
fr: Compléter votre page de contenu avec un titre
nl: Vervolledig uw contentpagina met een titel

source: 21 + In HTML, titles (called headers) are generally defined by ``h1`` tags. The h doesnt change, it stands for "header". The number (here 1) can however be replaced by any number from 1 to 6, ``h1`` being the highest level title and ``h6`` the lowest. Above all visualization widget codes added to the page, and right below the ``ods-box`` tag, add a high level title to your content page.
de: 21 + In HTML werden Titel (Header genannt) im Allgemeinen durch ``h1``-Tags definiert. Das h ist unveränderlich, es steht für "header". Die Zahl (hier 1) kann jedoch durch eine beliebige Zahl von 1 bis 6 ersetzt werden, wobei ``h1`` die Hauptüberschrift und ``h6`` die letzte Zwischenüberschrift ist. Fügen Sie über allen der Seite hinzugefügten Widget-Codes der Visualisierung und direkt unter dem Tag ``ods-box`` eine Hauptüberschrift für Ihre Inhaltsseite hinzu.
es: 21 + En HTML, los títulos (conocidos como encabezados) suelen definirse mediante las etiquetas ``h1``. La letra h no cambia, en referencia al vocablo inglés "header" (encabezado). Pero el número (aquí, 1) puede sustituirse por otro valor del 1 al 6, donde ``h1`` corresponde al título de nivel más alto y ``h6`` al más bajo. Por encima de todos los widgets de código de visualización añadidos a la página, y justo por debajo de la etiqueta ``ods-box``, añada un título de nivel alto a la página de contenido.
fr: 21 + En HTML, les titres (appelés en-têtes) sont généralement définis par des tags ``h1``. Le "h" ne change pas, car il signifie "header" (en-tête). Le chiffre (ici, 1) peut toutefois être remplacé par un chiffre compris entre 1 et 6, ``h1`` désignant le titre de plus haut niveau et ``h6`` le titre de plus bas niveau. Au-dessus de tous les codes de widget de visualisation ajoutés à la page, et juste en dessous du tag ``ods-box``, ajoutez un titre de haut niveau à votre page de contenu.
nl: 21 + In HTML worden titels (headers genoemd) over het algemeen gedefinieerd door ``h1`` labels. De h verandert niet, het staat voor "header". Het cijfer (hier 1) kan evenwel vervangen worden door elk cijfer van 1 tot 6. "h1" is de hoogste niveautitel en "h6" de laagste. Voeg boven de widget codes van alle weergaven die zijn toegevoegd aan de pagina en onmiddellijk onder het label "ods-box" een hoge niveautitel aan uw contentpagina toe.

source: 22 + Save your page and click on :tutorial-keycap:`Preview`: our dashboard now has a title!
de: 22 + Speichern Sie Ihre Seite und klicken Sie auf:tutorial-keycap:`Vorschau`: unser Dashboard hat jetzt einen Titel!
es: 22 + Guarde la página y haga clic en :tutorial-keycap:`Vista previa`: ¡el panel ya tiene un título!
fr: 22 + Enregistrez votre page et cliquez sur :tutorial-keycap:`Aperçu` : notre tableau de bord a maintenant un titre !
nl: 22 + Sla uw pagina op en klik op :tutorial-keycap:`Preview`: ons dashboard heeft nu een titel!

source: 23 + Click on the :tutorial-keycap:`Open page` button to see the final result of your page in the portal.
de: 23 + Klicken Sie auf den Button :tutorial-keycap:`Seite öffnen`, um das Endergebnis Ihrer Seite im Portal zu sehen.
es: 23 + Haga clic en el botón :tutorial-keycap:`Abrir página` para ver el resultado de la página en el portal.
fr: 23 + Cliquez sur le bouton :tutorial-keycap:`Ouvrir la page` pour voir à quoi ressemble votre page terminée sur le portail.
nl: 23 + Klik op de knop :tutorial-keycap:`Open page` om het definitieve resultaat van uw pagina in het portaal te zien.

source: **CONGRATULATIONS!**
de: **HERZLICHEN GLÜCKWUNSCH!**
es: **¡ENHORABUENA!**
fr: **FÉLICITATIONS !**
nl: **GEFELICITEERD!**

source: You have finished this tutorial and you now know how to create a simple dashboard with 3 dataset visualizations!
de: Sie haben dieses Tutorial abgeschlossen und wissen jetzt, wie man ein einfaches Dashboard mit 3 Datensatz-Visualisierungen erstellt!
es: ¡Ha completado este tutorial, y ahora ya sabe cómo crear un panel sencillo con 3 visualizaciones de conjuntos de datos!
fr: Vous avez terminé ce tutoriel et savez maintenant comment créer un tableau de bord simple avec 3 visualisations de jeu de données !
nl: U heeft deze handleiding volledig gevolgd en u weet nu hoe u een eenvoudig dashboard kunt aanmaken met 3 datasetweergaven!

source: If you want to go further with your dashboard, you can follow the second part of this tutorial: :doc:`"How to build a dashboard (part 2)" <how_to_build_dashboard_part2>`. It will teach you how to link your widgets together, how to add more advanced widgets but also how to organize and style your dashboard better.
de: Wenn Sie Ihr Dashboard noch mehr anpassen möchten, können Sie sich den zweiten Teil dieses Tutorials ansehen: :doc:`"Ein Dashboard aufbauen (2. Teil)" <how_to_build_dashboard_part2>`. Hier erfahren Sie, wie Sie Ihre Widgets miteinander verknüpfen, erweiterte Widgets hinzufügen und Ihr Dashboard besser organisieren und gestalten können.
es: Si quiere continuar avanzando con su panel, puede seguir la segunda parte de este tutorial: :doc:`"Cómo crear un panel (parte 2)" <how_to_build_dashboard_part2>`. Allí aprenderá a vincular los widgets, añadir widgets más avanzados, y dar estilo al panel y organizarlo.
fr: Pour aller plus loin dans la création de votre tableau de bord, vous pouvez suivre la seconde partie de ce tutoriel : :doc:`"Créer un tableau de bord (2e partie)" <how_to_build_dashboard_part2>`. Vous y apprendrez à lier vos widgets, à ajouter des widgets plus avancés, mais aussi à mieux organiser et personnaliser votre tableau de bord.
nl: Indien u nog verder wilt gaan met uw dashboard, kunt u het tweede deel van deze handleiding : :doc:`"Hoe een dashboard bouwen (deel 2)" <how_to_build_dashboard_part2>` volgen. Hierin leert u hoe u uw widgets aan elkaar kunt koppelen, hoe u meer geavanceerde widgets kunt toevoegen en hoe u uw dashboard beter kunt organiseren en de stijl ervan verbeteren.

source: *This tutorial will teach you how to create a dashboard using 3 visualizations from a dataset published on an OpenDataSoft portal.*
fr: *Ce tutoriel va vous guider tout au long des étapes de création d'un tableau de bord avec 3 visualisations d'un jeu de données publié sur un portail OpenDataSoft.*
nl: *In deze handleiding leert u hoe u een dashboard kunt aanmaken met behulp van 3 weergaven uit een dataset die gepubliceerd is op een OpenDataSoft-portaal.*

source: how to use a widget in a content page created with OpenDataSoft
fr: comment utiliser un widget dans une page de contenu créée avec OpenDataSoft.
nl: hoe u een widget kunt gebruiken in een contentpagina die is aangemaakt met OpenDataSoft

source: In order to create a dashboard, you need to have access to the back office of an OpenDataSoft portal and the "Edit all pages" permission.
fr: Pour créer un tableau de bord, vous avez besoin d'un accès à l'interface d'administration d'un portail OpenDataSoft, ainsi que de la permission "Éditer toutes les pages".
nl: Om een dashboard te kunnen aanmaken, moet u toegang hebben tot de back-office van een OpenDataSoft-portaal en moet u de toelating "Alle pagina's bewerken" hebben.

source: We highly recomment to follow the tutorial with the `World Heritage List dataset published on our data network, Data <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. This dataset will be our example dataset used throughout the whole tutorial. If you however choose to follow the tutorial with another dataset, make sure to choose one with a Table view, as well as a Map view and an Analyze view. You will also need to adapt your own page code for it to match your chosen dataset.
fr: Pour suivre ce tutoriel, nous vous recommandons vivement d'utiliser le `jeu de données World Heritage List publié sur notre réseau de données, Données <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. Ce jeu de données nous servira d'exemple tout au long du tutoriel. Toutefois, si vous choisissez un autre jeu de données pour suivre le tutoriel, veillez à en sélectionner un avec une vue Tableau, une vue Carte et une vue Analyse. Vous aurez également besoin d'adapter le code de votre page au jeu de données choisi.
nl: We raden sterk aan om de handleiding te volgen met de dataset `World Heritage List die gepubliceerd staat op ons datanetwerk, Data <https://data.opendatasoft.com/explore/dataset/world-heritage-list%40public-us/map/?location=2,18.46273,-0.44037&basemap=mapbox.streets>`_. Deze dataset zal onze voorbeelddataset zijn die in de gehele handleiding zal worden gebruikt. Indien u er evenwel voor kiest om de handleiding met een andere dataset te volgen, zorg er dan voor dat u er een kiest met een Tabelweergave, alsook een Kaartweergave en een Analyseweergave. Ook zult u uw eigen paginacode moeten aanpassen zodat deze overeenstemt met de door u gekozen dataset.

source: A widget is a piece of code that allows anyone to integrate an interactive element directly on a webpage. In OpenDataSoft, there are several widgets which are `all listed and explained in the widget documentation <https://help.opendatasoft.com/widgets/#/api/>`_. Some of the most common OpenDataSoft widgets -those we will use in this tutorial- are the visualization widgets. Each data visualization of a published dataset is indeed available as a widget, which code is displayed below the visualization, ready to be copied!
fr: Un widget est un morceau de code permettant d'intégrer un élément interactif directement sur une page Web. OpenDataSoft propose plusieurs widgets, qui sont `tous répertoriés et documentés dans la documentation sur les widgets <https://help.opendatasoft.com/widgets/#/api/>`_. Certains des plus courants, ceux que nous allons utiliser dans ce tutoriel, sont les widgets de visualisation. Chaque visualisation de données d'un jeu de données publié est en effet disponible en tant que widget, dont le code est affiché sous la visualisation, pour être copié.
nl: Een widget is een stukje code waarmee iemand een interactief element rechtstreeks op een internetpagina kan integreren. In OpenDataSoft zijn er verschillende widgets die allemaal opgelijst en uitgelegd worden in de documentatie over widgets <https://help.opendatasoft.com/widgets/#/api/>`_. Sommige van de meest voorkomende OpenDataSoft-widgets - diegene die we in deze handleiding zullen gebruiken - zijn de weergavewidgets. Elke dataweergave van een gepubliceerde dataset is inderdaad beschikbaar als een widget, waarvan de code onder de weergave staat, die klaar is om te worden gekopieerd!

source: An iframe is a way to easily and safely integrate OpenDataSoft content in an isolated frame, independent from the rest of the page. If you want to integrate OpenDataSoft content outside the OpenDataSoft environment, iframes would be the best way to go, even though some interaction and customization work would probably be needed. Widgets could also be integrated into a page outside the OpenDataSoft environment, but know that heavy work would be required.
fr: Un iframe est un moyen d'intégrer facilement et en toute sécurité du contenu OpenDataSoft dans un cadre isolé, indépendant du reste de la page. Si vous souhaitez intégrer du contenu OpenDataSoft en dehors de l'environnement OpenDataSoft, les iframes sont la solution idéale, même si quelques opérations d'interaction et de personnalisation seront probablement nécessaires. Les widgets peuvent aussi être intégrés dans une page en dehors de l'environnement OpenDataSoft, mais gardez à l'esprit que de nombreux ajustements devront être réalisés.
nl: Een iframe is een eenvoudige en veilige manier om content van OpenDataSoft te integreren in een losstaand kader, los van de rest van de pagina. Indien u content van OpenDataSoft wil integreren buiten de OpenDataSoft-omgeving, zijn iframes de beste manier om dit te doen, hoewel hiervoor waarschijnlijk enig interactie- en aanpassingswerk voor nodig zal zijn. Er zouden ook widgets geïntegreerd kunnen worden in een pagina buiten de OpenDataSoft-omgeving, maar weet dat hiervoor heel wat werk nodig zal zijn.

source: Since we are building a dashboard directly in an OpenDataSoft page, using OpenDataSoft widgets is the best option. In the OpenDataSoft environment, they are indeed easily customizable and very interactive with other widgets.
fr: Puisque nous créons un tableau de bord directement sur une page OpenDataSoft, l'utilisation de widgets OpenDataSoft est la meilleure option. Dans l'environnement OpenDataSoft, ils sont en effet facilement personnalisables et très interactifs avec les autres widgets.
nl: Aangezien we een dashboard rechtstreeks in een OpenDataSoft-pagina bouwen, is het gebruik van OpenDataSoft-widgets de beste optie. In de OpenDataSoft-omgeving zijn ze immers gemakkelijk aanpasbaar en bijzonder interactief met andere widgets.

source: 13 + Go back to the back office, to continue to edit your OpenDataSoft content page.
fr: 13 + Accédez à l'interface d'administration pour continuer à modifier votre page de contenu OpenDataSoft.
nl: 13 + Ga terug naar de back-office om de OpenDataSoft-contentpagina verder te bewerken.
