Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_create_tabs.po
Languages: de, es, fr, nl

source: Let's take a look at the syntax to understand how to use the ``ng-class`` directive.
de: Werfen wir einen Blick auf die Syntax, um zu verstehen, wie man die Richtlinie ``ng-class`` verwendet.
es: Veamos la sintaxis para entender cómo utilizar la directiva ``ng-class``.
fr: Observons la syntaxe pour comprendre comment utiliser la directive ``ng-class``.
nl: Laten we een kijkje nemen naar de syntax om te begrijpen hoe we de richtlijn ``ng-class`` moeten gebruiken.

source: The structure of the ``ng-class`` directive is the same as for the other directives: the name of the directive is followed right after by an equals sign ``=``, and the expression that will be evaluated by the directive is written between double quotes ``"``.
de: Die Struktur der Richtlinie ``ng-class`` ist die gleiche wie bei den anderen Richtlinien: Auf den Namen der Richtlinie folgt ein Gleichheitszeichen ``=``. Der Ausdruck, der von der Richtlinie ausgewertet wird, steht zwischen doppelten Anführungszeichen ``"``.
es: La estructura de la directiva ``ng-class`` es la misma que la de las demás directivas: el nombre de la directiva va seguido inmediatamente de un signo de igual ``=`` y la expresión que será evaluada por la directiva se escribe entre comillas dobles ``"``.
fr: La structure de la directive ``ng-class`` est identique à celle des autres directives : le nom de la directive est directement suivi d'un signe égal, ``=``, et l'expression évaluée par la directive ``ng-if`` est placée entre des guillemets doubles ``"``.
nl: De structuur van de ``ng-class``-richtlijn is dezelfde als voor de andere richtlijnen: de naam van de richtlijn wordt rechts erachter gevolgd door een gelijkheidsteken``=`` en de uitdrukking die geëvalueerd zal worden door de richtlijn, wordt geschreven tussen dubbele aanhalingstekens ``"``.

source: But here is how the expression should be for this directive:
de: Für diese Richtlinie sollte der Ausdruck folgendermaßen aussehen:
es: Pero así es como debería ser la expresión de esta directiva:
fr: Mais voici le format de l'expression pour cette directive :
nl: Maar dit is hoe de uitdrukking er zou moeten uitzien voor deze richtlijn:

source: The expression must also be enclosed between curly brackets ``{}``.
de: Der Ausdruck muss außerdem von geschweiften Klammern``{}`` umschlossen sein.
es: La expresión también debe ir entre llaves ``{}``.
fr: L'expression doit également être placée entre des accolades ``{}``.
nl: De uitdrukking moet ook tussen accolades ``{}`` staan.

source: Inside the curly brackets ``{}``, first comes the name of the CSS class that should be used. It must be written between single quotes ``'``.
de: Innerhalb der geschweiften Klammern ``{}``, kommt zuerst der Name der CSS-Klasse, die verwendet werden soll. Er muss zwischen einfachen Anführungszeichen (``'``) geschrieben werden.
es: Dentro de las llaves ``{}``, primero viene el nombre de la clase CSS que debe usarse. Debe escribirse entre comillas simples ``'``.
fr: Dans les accolades ``{}``, le nom de la classe CSS doit figurer en premier et être placé entre des guillemets simples ``'``.
nl: Tussen de accolades ``{}`` komt eerst de naam van de CSS-klasse die gebruikt zou moeten worden. Deze moet tussen enkele aanhalingstekens ``'`` geschreven zijn.

source: Right after the name of the CSS class, there must be a colon ``:``.
de: Direkt nach dem Namen der CSS-Klasse folgt ein Doppelpunkt ``:``.
es: Justo después del nombre de la clase CSS, debe haber un carácter de dos puntos ``:``.
fr: Puis, deux-points ``:`` doivent être ajoutés.
nl: Vlak achter de naam van de CSS-klasse moet er een dubbele punt``:`` staan.

source: Then comes the variable/value part that is exactly like the ``ng-if`` expression (see step 10). We should find the name of the variable as well as the name of the value (written between single quotes ``'``). The variable and value must be separated by 2 equals signs ``==``.
de: Dann kommt der Variablen-/Wert-Teil, genau wie beim``ng-if``-Ausdruck (siehe Schritt 10). Wir sollten die Bezeichnung der Variablen sowie des Wertes bestimmen (geschrieben zwischen einfachen Anführungszeichen ``'``). Die Variable und der Wert müssen durch 2 Gleichheitszeichen getrennt werden ``==``.
es: A continuación viene la parte de variable/valor que es exactamente como la expresión ``ng-if`` (consulte el paso 10). Debemos encontrar el nombre de la variable y el nombre del valor (entre comillas simples ``'``). La variable y el valor tienen que separarse con 2 signos de igual ``==``.
fr: Vient ensuite la partie variable/valeur, qui est exactement identique à l'expression ``ng-if`` (cf. étape 10). Nous devons avoir le nom de la variable et le nom de la valeur (placés entre des guillemets simples ``'``). La variable et la valeur doivent être séparées par 2 signes égal, ``==``.
nl: Dan volgt het deel variabele/waarde dat precies hetzelfde is zoals de ``ng-if``-uitdrukking (zie stap 10). We zouden de naam van de variabele alsook de naam van de waarde (geschreven tussen enkele aanhalingstekens ``'`` moeten terugvinden. De variabele en de waarde moeten gescheiden zijn door 2 gelijkheidstekens ``==``.

source: Basically, the ``ng-class`` syntax could be read as such: "``mycssclass`` must be used when ``myvariable`` equals ``myvalue``".
de: Grundsätzlich könnte die ``ng-class``-Syntax folgendermaßen gelesen werden: "``mycssclass`` muss verwendet werden, wenn ``myvariable`` gleich ``myvalue`` ist".
es: En definitiva, la sintaxis de ``ng-class`` puede leerse así: "``mycssclass`` debe utilizarse cuando ``myvariable`` sea igual a ``myvalue``".
fr: Pour faire simple, la syntaxe ``ng-class`` signifie : " ``mycssclass`` doit être utilisé quand ``myvariable`` est égal à ``myvalue`` ".
nl: In essentie zou de ``ng-class``-syntax als volgt kunnen worden gelezen: "``mycssclass`` moet gebruikt worden wanneer ``myvariable`` gelijk is aan ``myvalue``".

source: 17 + Add the ``ng-class`` directive in the HTML ``<a>`` tag of each tab title. Don't forget to put all 3 values to match the 3 tab titles.
de: 17 + Fügen Sie die Richtlinie ``ng-class`` im HTML ``<a>``-Tag jedes Tab-Titels hinzu. Vergessen Sie nicht, alle 3 Werte so zu setzen, dass sie den 3 Tab-Titeln entsprechen.
es: 17 + Añada la directiva ``ng-class`` en la etiqueta HTML ``<a>`` de cada uno de los títulos de las fichas. No olvide poner los 3 valores correspondientes a los 3 títulos de fichas.
fr: 17 + Ajoutez la directive ``ng-class`` dans le tag HTML ``<a>`` de chaque titre d'onglet. N'oubliez pas d'ajouter les 3 valeurs qui correspondent aux 3 titres d'onglet.
nl: 17 + Voeg de ``ng-class``-richtlijn toe in de HTML ``<a>`` tag van elke tabbladtitel. Vergeet niet om alle 3 de waarden te plaatsen om overeen te stemmen met de 3 tabbladtitels.

source: Finalize the tabs
de: Letzte Schritte
es: Finalizar las fichas
fr: Finaliser les onglets
nl: Voltooi de tabbladen

source: 18 + Our ``ng-class`` directive works! But it isn't so pretty, is it? Let's go back to the CSS section to add the finishing touches! Here, we're going to add more space around the tab titles to avoid the border to fall into the tab content area. We are also going to highlight the possible selection of a tab title by building a specific style only visible when the mouse hovers the tab titles.
de: 18 + Unsere ``ng-class``-Richtlinie funktioniert! Aber das Ganze könnte etwas hübscher aussehen, oder? Kehren wir zurück zum CSS-Bereich, um letzte Feinheiten hinzuzufügen! Wir schaffen mehr Platz um die Tab-Titel herum, damit der Rand nicht in den Bereich mit dem Tab-Inhalt rutscht. Außerdem heben wir die mögliche Auswahl eines Tab-Titels hervor, indem wir einen bestimmten Stil erstellen, der nur sichtbar ist, wenn die Maus über die Tab-Titel fährt.
es: 18 + ¡Nuestra ``ng-class`` ya funciona! Pero su apariencia no es nada bonita. ¡Regresemos a la sección CSS para darle los retoques finales! En este caso, vamos a añadir más espacio alrededor de los títulos de las fichas para evitar que el borde alcance el área del contenido de la ficha. Además, vamos a resaltar la posible selección de un título de ficha creando un estilo específico que solo esté visible cuando el cursor se desplace por encima de los títulos de las fichas.
fr: 18 + Notre directive ``ng-class`` fonctionne ! Par contre, l'esthétique n'y est pas... Revenons à la section CSS pour apporter la touche finale. Ici, nous allons ajouter plus d'espace entre les titres d'onglet pour éviter que la bordure ne se retrouve dans la zone du contenu de l'onglet. Nous allons également mettre en valeur la sélection possible du titre d'un onglet en créant un style spécifique uniquement visible lorsque la souris survole les titres d'onglet.
nl: 18 + Onze ``ng-class``-richtlijn werkt! Maar het is niet echt mooi, nietwaar? Laten we terugkeren naar de CSS-sectie om de finishing touch toe te voegen. Hier gaan we extra ruimte toevoegen rond de tabbladtitels om te vermijden dat de rand in de ruimte van de tabcontent valt. We gaan ook de mogelijke selectie van een tabbladtitel beklemtonen door een specifieke stijl op te bouwen die enkel zichtbaar is wanneer de muiscursor over de tabbladtitels wordt bewogen.

source: 19 + Go back to the HTML section to apply the whole new CSS style. Our ``tabs`` CSS class will do very well in the ``div`` tag that wraps all the tab titles. As for ``tab:hover``, since it is built on top of the main CSS class ``tab``, it automatically applies to the HTML elements with the ``tab`` CSS class.
de: 19 + Wechseln Sie zurück zum HTML-Abschnitt, um den neuen CSS-Stil anzuwenden. Unsere CSS-Klasse ``tabs`` passt gut ins ``div``-Tag, das alle Tab-Titel enthält. Weil ``tab:hover`` auf der Haupt-CSS-Klasse ``tab`` aufbaut, wird die Funktion automatisch für alle HTML-Elemente mit der CSS-Klasse ``tab`` angewendet.
es: 19 + Vuelva a la sección HTML para aplicar el nuevo estilo CSS. Nuestra clase CSS ``tabs`` funcionará muy bien en la etiqueta ``div`` que delimita todos los títulos de las fichas. Como con ``tab:hover``, puesto que se ha incorporado en la parte superior de la clase CSS ``tab`` principal, automáticamente se aplica a todos los elementos HTML con la clase CSS ``tab``.
fr: 19 + Revenez à la section HTML pour appliquer le tout nouveau style CSS. Notre classe ``tabs`` fera parfaitement l'affaire dans le tag ``div`` qui enveloppe tous les titres d'onglet. En ce qui concerne ``tab:hover``, puisqu'il repose sur la classe CSS ``tab`` principale, il s'applique automatiquement aux éléments HTML avec la classe CSS ``tab``.
nl: 19 + Keer terug naar de HTML-sectie om de volledig nieuwe CSS-stijl toe te passen. Onze CSS-klasse ``tabs`` zal het bijzonder goed doen in de tag ``div`` die alle tabbladtitels omringt. Wat ``tab:hover`` betreft, aangezien deze bovenop de belangrijkste CSS-klasse ``tab`` is gebouwd, wordt deze automatisch toegepast op de HTML-elementen met de CSS-klasse ``tab``.

source: 20 + There we go! We have created our very own tabs! The only thing left to do is to replace every example text by real content.
de: 20 + Das war's! Wir haben unsere eigenen Tabs erstellt! Jetzt müssen Sie nur noch die Beispieltexte durch echten Inhalt ersetzen.
es: 20 + ¡Genial! ¡Hemos creado nuestras propias fichas! Solo resta sustituir el texto de ejemplo por contenido real.
fr: 20 + Et voilà ! Nous avons créé nos onglets personnalisés ! Il ne nous reste plus qu'à remplacer chaque exemple de texte par du contenu réel.
nl: 20 + Klaar! We hebben onze volledig eigen tabbladen aangemaakt! Het enige wat we nu nog moeten doen is elke voorbeeldtekst vervangen door echte content.

source: You are free to choose the tab titles and to add your own tab contents. For this tutorial, we will complete the tabs using the `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public>`_ dataset. The first tab will contain the table visualization, the second tab will contain a map created with the Map Builder and the third tab will contain a chart visualization. Each tab title will of course indicate what the tab content is about, and they will be preceded by a `Font Awesome <https://fontawesome.com/>`_ icon (just to spice things up a bit!).
de: Sie können die Tab-Titel frei wählen und eigene Tab-Inhalte hinzufügen. Für dieses Tutorial füllen wir die Tabs mit dem Datensatz `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public>`_. Der erste Tab enthält die Tabellenvisualisierung, der zweite Tab enthält eine mit dem Kartenersteller erstellte Karte und der dritte Tab eine Diagrammvisualisierung. Natürlich wird jeder Tab-Titel Hinweise zum jeweiligen Inhalt geben und mit einem `Font Awesome <https://fontawesome.com/>`_ Symbol versehen sein (um das Ganze ein wenig aufzupeppen!).
es: Puede elegir los títulos de las fichas y añadir su propio contenido de las fichas. A los efectos de este tutorial, completaremos las fichas con el conjunto de datos `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public>`_. La primera ficha contendrá la visualización de tabla; la segunda, un mapa creado con el Compilador de mapas; y la tercera, una visualización de gráfico. Por supuesto, cada uno de los títulos de las fichas dará una idea de su contenido y estará precedido de un icono `Font Awesome <https://fontawesome.com/>`_ (¡para darle un toque especial!).
fr: Vous pouvez choisir les titres d'onglet à votre convenance et ajouter les contenus d'onglet souhaités. Dans le cadre de ce tutoriel, nous allons renseigner les onglets avec le jeu de données `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public>`. Le premier onglet hébergera la visualisation de tableau, le deuxième, une carte créée avec l'Éditeur de carte et le troisième, une visualisation de graphe. Chaque titre d'onglet indiquera le contenu de l'onglet et sera précédé d'une icône `Font Awesome <https://fontawesome.com/>`_ (pour corser un peu les choses).
nl: Het staat u volledig vrij om de tabbladtitels te kiezen en om uw eigen tabcontents toe te voegen. Voor deze handleiding zullen we de tabbladen vervolledigen door gebruik te maken van de `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public>`_ dataset. Het eerste tabblad zal de weergave van het tabblad bevatten, het tweede tabblad zal een kaart bevatten die aangemaakt is met de Map Builder en het derde tabblad zal een grafiekweergave bevatten. Elke tabbladtitel zal natuurlijk aangeven waar de tabcontent over gaat en ze zullen worden voorafgegaan door een `Font Awesome <https://fontawesome.com/>`_ icoon (net om het iets pittiger te maken!).

source: **CONGRATULATIONS!**
de: **HERZLICHEN GLÜCKWUNSCH!**
es: **¡ENHORABUENA!**
fr: **FÉLICITATIONS !**
nl: **GEFELICITEERD!**

source: You have finished this tutorial and you now know how to create tabs using AngularJS, and hopefully your now feel comfortable enough with ``ng-click``, ``ng-if``, ``ng-init`` and ``ng-class`` to be able to use them again on your own!
de: Sie haben dieses Tutorial abgeschlossen und wissen jetzt, wie man Tabs mit AngularJS erstellt! Wir hoffen, dass Sie jetzt mit dem Umgang mit ``ng-click``, ``ng-if``, ``ng-init`` und ``ng-class`` vertraut sind und sie das nächste Mal selbstständig nutzen werden!
es: Ha completado este tutorial y ahora ya sabe cómo crear fichas con AngularJS. ¡Esperamos que se sienta lo suficientemente cómodo con el uso de ``ng-click``, ``ng-if``, ``ng-init`` y ``ng-class`` para hacerlo por sí solo en adelante!
fr: Vous avez terminé ce tutoriel et savez maintenant comment créer des onglets à l'aide d'AngularJS. De plus, vous devez suffisamment maîtriser les directives ``ng-click``, ``ng-if``, ``ng-init`` et ``ng-class`` pour les utiliser à votre guise !
nl: U heeft deze handleiding volledig doorlopen en weet nu hoe u tabbladen moet aanmaken met behulp van AngularJS. Hopelijk bent u nu voldoende vertrouwd met ``ng-click``, ``ng-if``, ``ng-init`` en ``ng-class`` om deze later zelfstandig opnieuw te kunnen gebruiken!

source: *This tutorial will teach you how to create tabs using AngularJS. These tabs will be fully customizable and reusable in any dashboard or piece of content created with HTML/CSS on OpenDataSoft.*
es: *Con este tutorial aprenderá a crear fichas con AngularJS. Estas fichas serán totalmente personalizables y reutilizables en cualquier panel o elemento de contenido creado con HTML/CSS en OpenDataSoft.*
fr: *Dans ce tutoriel, vous allez apprendre à créer des onglets à l'aide d'AngularJS. Ces derniers pourront être entièrement personnalisés et réutilisés dans n'importe quel tableau de bord ou élément de contenu créé avec HTML/CSS sur OpenDataSoft.*
nl: *In deze handleiding leert u hoe u tabbladen kunt aanmaken met AngularJS. Deze tabbladen zijn volledig gepersonaliseerd en kunnen in elke dashboard of stuk content gebruikt worden dat op OpenDataSoft is aangemaakt met HTML/CSS.*

source: In order to test this tutorial and/or integrate the tabs in an already existing page, you need to have access to the back office of an OpenDataSoft portal and be granted the "Edit all pages" permission.
es: Para probar este tutorial o integrar las fichas en una página ya existente, debe tener acceso al back office de un portal OpenDataSoft y disponer del permiso "Editar todas las páginas".
fr: Pour tester ce tutoriel et/ou intégrer les onglets à une page existante, vous avez besoin d'un accès à l'interface d'administration d'un portail OpenDataSoft, ainsi que de la permission "Éditer toutes les pages".
nl: Om deze handleiding uit te testen en/of de tabbladen in een reeds bestaande pagina te integreren, moet u toegang hebben tot de back office van een OpenDataSoft-portaal en moet u de toelating "Alle pagina's bewerken" hebben.

source: Depending on whether you try this tutorial on a new page or in an existing dashboard, you will perhaps see the ``<div class="container">`` and ``<div class="ods-box">`` tags: both are default tags that create the default frame of any OpenDataSoft page. If you want to keep this frame, make sure to add the code of the tutorial between these default tags.
es: Dependiendo de si prueba este tutorial en una página nueva o un panel ya existente, tal vez vea las etiquetas ``<div class="container">`` y ``<div class="ods-box">``: ambas son etiquetas predeterminadas que crean el marco predeterminado de cualquier página de OpenDataSoft. Si quiere conservar este marco, asegúrese de añadir el código del tutorial entre estas etiquetas predeterminadas.
fr: En fonction de l'environnement (nouvelle page ou tableau de bord existant) dans lequel vous effectuez ce tutoriel, vous pourrez peut-être voir les tags ``<div class="container">`` et ``<div class="ods-box">``. Il s'agit des tags par défaut qui créent le cadre par défaut d'une page OpenDataSoft. Si vous souhaitez conserver ce cadre, veillez à ajouter le code du tutoriel entre ces tags par défaut.
nl: Afhankelijk van het feit of u deze handleiding uitprobeert op een nieuwe pagina of in een bestaand dashboard, zult u misschien de tags ``<div class="container">`` en ``<div class="ods-box">`` zien: beide zijn standaard tags die het standaard kader van een OpenDataSoft-pagina aanmaken. Indien u dit kader wilt behouden, zorg er dan voor dat u de code van de handleiding tussen deze standaard tags toevoegt.

source: 6 + Second, we are going to give a bit more style to the tab contents. This time, instead of creating a whole new CSS class, we are going to use an already existing one. ``ods-box`` is a default OpenDataSoft CSS style that wraps the HTML items into a thin border. It will help us give the impression that our tab contents are a little bit 'outside' the rest of the page content. Add a ``<div>`` tag wrapping all the tab contents, with the ``ods-box`` CSS class in it.
es: 6 + En segundo lugar, vamos a dar un poco más de estilo al contenido de las fichas. En esta ocasión, en lugar de crear una nueva clase CSS, vamos a usar una ya existente. ``ods-box`` es un estilo CSS predeterminado de OpenDataSoft que delimita los elementos HTML con un borde fino. Nos ayudará a crear la impresión de que el contenido de las fichas está un poco más ''afuera'' que el contenido restante de la página. Añada una etiqueta ``<div>`` para delimitar todo el contenido de las fichas, con la clase CSS ``ods-box`` dentro.
fr: 6 + Ensuite, nous allons mettre en page les contenus d'onglet. Cette fois, au lieu de créer une toute nouvelle classe CSS, nous allons en utiliser une existante. ``ods-box`` est un style CSS OpenDataSoft par défaut qui enveloppe les éléments HTML dans une bordure fine. Cela nous permet de donner l'impression que les contenus de notre onglet sont légèrement "en dehors" du reste du contenu de la page. Ajoutez un tag ``<div>`` qui enveloppe tous les contenus de l'onglet avec la classe CSS ``ods-box``.
nl: 6 + Ten tweede gaan we de content van het tabblad iets meer stijl geven. Deze keer gaan we een reeds bestaande CSS-klasse gebruiken in plaats van een volledige nieuwe aan te maken. "ods-box" is een standaard CSS-stijl in OpenDataSoft die de HTML-items met een dunne rand omringt. Het zal ons helpen om de indruk te geven dat de contents van ons tabblad iets "buiten" de rest van de paginacontent ligt. Voeg een ``<div>`` tag toe die de contents van alle tabbladen omringt en waarin de CSS-klasse ``ods-box`` in zit.
