Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_make_visualizations_match_filters.po
Languages: de, es, fr, nl

source: How to make visualizations match filters (with AngularJS)
de: Wie man Visualisierungen auf Filter abstimmt (mit AngularJS)
es: Cómo hacer que las visualizaciones se correspondan con los filtros (con AngularJS)
fr: Créer des visualisations qui correspondent à des filtres (avec AngularJS)
nl: Hoe ervoor zorgen dat weergaves overeenstemmen met filters (met AngularJS)

source: ★★★ Advanced - time: 30 minutes
de: ★★★ Sachkundige - Dauer: 30 Minuten
es: ★★★ Avanzado - Tiempo: 30 minutos
fr: ★★★ Avancé - durée : 30 minutes
nl: ★★★ Geavanceerd - tijd: 30 minuten

source: *This tutorial will teach you how to create different visualizations options to match related filters. This can be useful especially with charts, since they can sometimes become useless once related filters are activated. This tutorial will be fully customizable and reusable in any dashboard or piece of content created with HTML/CSS on OpenDataSoft.*
de: *In diesem Tutorial erfahren Sie, wie Sie verschiedene Visualisierungsoptionen erstellen können, um die dazugehörigen Filter anzupassen. Dies kann insbesondere bei Diagrammen nützlich sein, die unbrauchbar sind, wenn bestimmte Filter aktiviert sind. Dieses Tutorial ist komplett anpassbar und wiederverwendbar in jedem Dashboard oder Inhalt, der mit HTML/CSS auf OpenDataSoft* erstellt wurde.
es: *Con este tutorial aprenderá a crear diferentes opciones de visualizaciones para hacer que se correspondan con los filtros relacionados. Puede resultar especialmente útil con los gráficos, dado que en ocasiones estos se vuelven innecesarios una vez activados los filtros relacionados. Este tutorial será totalmente personalizable y reutilizable en cualquier panel o elemento de contenido creado con HTML/CSS en OpenDataSoft.*

source: During this tutorial, you will learn:
de: Dieses Tutorial vermittelt Ihnen Folgendes:
es: En este tutorial, aprenderá:
fr: Au cours de ce tutoriel, vous allez apprendre :
nl: Met deze handleiding leert u:

source: how to use the ``ng-if`` AngularJS directive
de: wie man die AngularJS-Richtlinie ``ng-if`` verwendet
es: cómo utilizar la directiva AngularJS ``ng-if``
fr: comment utiliser la directive AngularJS ``ng-if``
nl: hoe moet de ``ng-if``-richtlijn van AngularJS worden gebruikt

source: when and how to use the ``context.parameters`` object inside the ``ng-if`` directive
de: wann und wie man das Objekt ``context.parameters`` innerhalb der Richtlinie ``ng-if`` verwendet
es: cuándo y cómo utilizar el objeto ``context.parameters`` dentro de la directiva ``ng-if``
fr: quand et comment utiliser l'objet ``context.parameters`` dans la directive ``ng-if``
nl: wanneer en hoe moet het voorwerp ``context.parameters`` in de ``ng-if``-richtlijn worden gebruikt

source: **PREREQUISITES**
de: **VORRAUSSETZUNGEN**
es: **REQUISITOS PREVIOS**
fr: **PRÉREQUIS**
nl: **VOORVEREISTEN**

source: In order to test this tutorial and/or integrate the hide/show configuration on widgets in an already existing page, you need to have access to the back office of an OpenDataSoft portal and be granted the "Edit all pages" permission.
de: Um dieses Tutorial zu testen und/oder die Verbergen/Anzeigen-Konfiguration von Widgets in eine bereits bestehende Seite zu integrieren, benötigen Sie Zugriff auf das Backoffice eines OpenDataSoft-Portals und die Berechtigung "Alle Seiten bearbeiten".
es: Para probar este tutorial o integrar la configuración de ocultar/mostrar de los widgets en una página ya existente, debe tener acceso al back office de un portal OpenDataSoft y disponer del permiso "Editar todas las páginas".

source: Since this tutorial is labeled as "Advanced" in terms of difficulty level, we assume that you already know HTML and CSS well enough to recognize and understand their structures and how they work. Other more technical elements will however be explained in details.
de: Dieses Tutorial fällt unter den Schwierigkeitsgrad "Sachkundige". Deshalb gehen wir davon aus, dass Sie HTML und CSS bereits ausreichend kennen, um ihre Strukturen und Funktionsweise zu erkennen und zu verstehen. Andere eher technische Elemente werden jedoch genauer erläutert.
es: Dado que este tutorial está categorizado con el nivel de dificultad "Avanzado", suponemos que ya tiene los conocimientos suficientes de HTML y CSS para reconocer y entender sus estructuras y funcionamiento. No obstante, se explicarán en detalle otros elementos más técnicos.
fr: Le niveau de difficulté de ce tutoriel étant "Avancé", nous partons du principe que vous connaissez suffisamment bien HTML et CSS pour reconnaître et comprendre leurs structures et fonctionnements respectifs. Toutefois, d'autres points plus techniques seront expliqués en détail.
nl: Aangezien deze handleiding aangemerkt staat als "Geavanceerd" in termen van moeilijkheidsgraad, nemen we aan dat u al voldoende vertrouwd bent met HTML en CSS om de structuren ervan te herkennen en te begrijpen en om te weten hoe ze werken. Andere meer technische elementen zullen echter gedetailleerd worden uitgelegd.

source: We highly recommend to follow the tutorial with the `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ dataset, used throughout the whole tutorial. If you however choose to follow the tutorial with another dataset, keep in mind that you will need to adapt each step.
de: Wir empfehlen Ihnen, für dieses Tutorial den Datensatz "Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>"_ zu nutzen. Diesen Datensatz verwenden wir als Beispiel im gesamten Tutorial. Wenn Sie das Tutorial mit einem anderen Datensatz fortsetzen möchten, müssen Sie jeden Schritt entsprechend anpassen.
es: Recomendamos vivamente seguir el tutorial con el conjunto de datos `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_, que se utiliza a lo largo de todo el tutorial. Sin embargo, si desea seguir el tutorial con otro conjunto de datos, tenga presente que deberá adaptar todos los pasos.
fr: Nous vous recommandons vivement de suivre ce tutoriel avec le jeu de données <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_, qui est utilisé ici. Toutefois, si vous préférez choisir un autre jeu de données pour suivre le tutoriel, pensez à adapter chaque étape.
nl: We raden sterk aan om de handleiding te volgen met de `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ dataset, die in de volledige handleiding wordt gebruikt. Indien u echter kiest om de handleiding met een andere dataset te gebruiken, denk er dan aan dat u elke stap zal moeten aanpassen.

source: Show all images
de: Alle Bilder anzeigen
es: Mostrar todas las imágenes
fr: Afficher toutes les images
nl: Alle afbeeldingen tonen

source: Hide all images
de: Alle Bilder verbergen
es: Ocultar todas las imágenes
fr: Masquer toutes les images
nl: Alle afbeeldingen verbergen

source: Create the base
de: Erstellen Sie die Basis
es: Crear la base
fr: Créer la base
nl: De basis aanmaken

source: In this tutorial, we will create a page comprised of a visualization and its related dataset filter, using the `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ dataset that can be found on our OpenDataSoft data network.
de: In diesem Tutorial erstellen wir eine Seite, die aus einer Visualisierung und dem dazugehörigen Datensatz-Filter besteht. Dafür verwenden wir den Datensatz `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_, den Sie in unserem OpenDataSoft-Datennetzwerk finden.
es: En este tutorial, crearemos una página formada por una visualización y su filtro de conjunto de datos relacionado, tomando como punto de partida el conjunto de datos `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ disponible en la red de datos de OpenDataSoft.

source: 1 + Let's start our page by adding the widget code of the visualization of our choice. Here, we chose to display a scatter plot chart representing the top 20 of the best countries in the ranking. For each country, the chart shows their average score.
de: 1 + Beginnen wir unsere Seite mit dem Hinzufügen des Widget-Codes der gewünschten Visualisierung. Wir haben uns im vorliegenden Fall für die Darstellung eines Streudiagramms entschieden, das die 20 besten Länder im Ranking zeigt. Für jedes Land zeigt das Diagramm den Durchschnittswert an.
es: 1 + Comenzaremos la página añadiendo el código de widget de la visualización deseada. En este caso, hemos decidido visualizar un gráfico de dispersión que representa la lista de los 20 mejores países de la clasificación. Para cada uno de los países, el gráfico muestra su puntuación promedio.
fr: 1 + Commençons à créer notre page en ajoutant le code de widget de la visualisation souhaitée. Ici, nous avons choisi d'afficher un nuage de points représentant le top 20 des meilleurs pays du classement. Pour chaque pays, le graphe indique le score moyen.
nl: 1 + We beginnen onze pagina met het toevoegen van de widgetcode van de weergave van onze keuze. Hier kiezen we ervoor om een spreidingsgrafiek weer te geven die de top 20 vertegenwoordigt van de beste landen in de rangschikking. Voor elk land toont de grafiek de gemiddelde score.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: Depending on whether you try this tutorial on a new page or in an existing dashboard, you will perhaps see the ``<div class="container">`` and ``<div class="ods-box">`` tags: both are default tags that create the default frame of any OpenDataSoft page. If you want to keep this frame, make sure to add the code of the tutorial between these default tags.
de: Je nachdem, ob Sie dieses Tutorial auf einer neuen Seite oder in einem bestehenden Dashboard ausprobieren, sehen Sie ggf. die Tags ``<div class="container">`` und ``<div class="ods-box">``: bei beiden handelt es sich um Standard-Tags, die den Standardrahmen einer OpenDataSoft-Seite bilden. Wenn Sie diesen Rahmen beibehalten möchten, stellen Sie sicher, dass Sie den Code des Tutorials zwischen diese Standard-Tags einfügen.
es: Dependiendo de si prueba este tutorial en una página nueva o un panel ya existente, tal vez vea las etiquetas ``<div class="container">`` y ``<div class="ods-box">``: ambas son etiquetas predeterminadas que crean el marco predeterminado de cualquier página de OpenDataSoft. Si quiere conservar este marco, asegúrese de añadir el código del tutorial entre estas etiquetas predeterminadas.

source: 2 + Before going any further, declare the unique context of your page, using the `odsDatasetContext <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsDatasetContext>`_ widget. This will allow our widgets to interact with one another - and it always is the proper way to build a dashboard.
de: 2 + Bevor Sie fortfahren, definieren Sie den eindeutigen Kontext Ihrer Seite mit dem Widget `odsDatasetContext <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsDatasetContext>`_. Auf diese Weise können unsere Widgets miteinander interagieren. Dies ist immer die richtige Vorgehensweise, um ein einwandfreies Dashboard zu erstellen.
es: 2 + Antes de continuar, declare el contexto único de la página, con el widget `odsDatasetContext <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsDatasetContext>`_. Con ello hacemos posible la interacción mutua de todos nuestros widgets (y siempre es la forma adecuada de construir un panel).
fr: 2 + Avant de continuer, déclarez le contexte unique de votre page à l'aide du widget `odsDatasetContext <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsDatasetContext>`_. Cela va permettre à nos widgets d'interagir entre eux, et constitue une étape importante dans la création d'un tableau de bord.
nl: 2 + Alvorens verder te gaan, geeft de unieke context van uw pagina aan door gebruik te maken van de `odsDatasetContext <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsDatasetContext>`_ widget. Deze zal toelaten dat onze widgets met elkaar in interactie treden - en het is altijd de juiste manier om een dashboard op te bouwen.

source: Important
de: Wichtig
es: Importante
nl: Belangrijk

source: Don't forget to delete the ``ods-dataset-context`` tag above the code of the chart widget. Also, replace the current context name (here, ``shanghaiworlduniversityrankingpublic``) by the new one (here, ``worlduniversityranking``).
de: Denken Sie daran, das Tag ``ods-dataset-context`` oberhalb des Codes des Diagramm-Widgets zu löschen. Ersetzen Sie außerdem den aktuellen Kontextnamen (hier: ``shanghaiworlduniversityrankingpublic``) durch den neuen (hier: ``worlduniversityranking``).
es: No olvide suprimir la etiqueta ``ods-dataset-context`` sobre el código del widget de gráfico. Asimismo, sustituya el nombre de contexto actual (aquí, ``shanghaiworlduniversityrankingpublic``) por el nuevo (aquí, ``worlduniversityranking``).
fr: Pensez à supprimer le tag ``ods-dataset-context`` au-dessus du code du widget de graphe. Remplacez également le nom du contexte actuel (ici, ``shanghaiworlduniversityrankingpublic``) par le nouveau (ici ``worlduniversityranking``).
nl: Vergeet niet om de tag ``ods-dataset-context`` boven de code van de grafiekwidget te verwijderen. Vervang ook de huidige contextnaam (hier ``shanghaiworlduniversityrankingpublic``) door de nieuwe (hier ``worlduniversityranking``).

source: 3 + Add a filter related to the chosen dataset, using the `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_ widget. Here, we retrieved the Country filter that already is an existing facet on the dataset published on Data.
de: 3 + Fügen Sie einen Filter entsprechend des ausgewählten Datensatzes hinzu. Verwenden Sie dafür das Widget `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_. In diesem Fall haben wir den Länderfilter abgerufen, der bereits ein bestehendes Facet des veröffentlichten Datensatzes ist.
es: 3 + Añada un filtro relacionado con el conjunto de datos elegido, mediante el widget `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_. En este caso, hemos recuperado el filtro de país que ya está en una faceta existente del conjunto de datos publicado en Datos.
fr: 3 + Ajoutez un filtre associé au jeu de données choisi à l'aide du widget `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_. Ici, nous avons récupéré le filtre Country, qui est une facette existante du jeu de données publié sur Données.
nl: 3 + Voeg een filter toe die verband houdt met de gekozen dataset en gebruik daarbij de `odsFacets <https://help.opendatasoft.com/widgets/#/api/ods-widgets.directive:odsFacets>`_ widget. Hier halen we de landfilter op die reeds in een bestaande facet staat op de dataset die gepubliceerd staat op Data.

source: 4 + Click on :tutorial-keycap:`Preview`. Technically, everything works well: the chart indeed updates according to the chosen filter option. However, the filtered chart becomes completely useless, because it only displays one single point.
de: 4 + Klicken Sie auf :tutorial-keycap:`Vorschau`. In technischer Hinsicht funktioniert alles einwandfrei: Das Diagramm wird entsprechend der gewählten Filteroption aktualisiert. Das gefilterte Diagramm ist jedoch völlig nutzlos, da es nur einen einzigen Punkt anzeigt.
es: 4 + Haga clic en :tutorial-keycap:`Vista previa`. Técnicamente, todo funciona bien: el gráfico se actualiza según la opción de filtro elegida. No obstante, el gráfico filtrado se vuelve totalmente innecesario, porque solo visualiza un punto.
fr: 4 + Cliquez sur :tutorial-keycap:`Aperçu`. D'un point de vue technique, tout fonctionne correctement : le graphe se met à jour en fonction de l'option de filtre choisie. Toutefois, le graphe filtré devient complètement inutile, puisqu'il n'affiche qu'un seul point.
nl: 4 + Klik op tutorial-keycap:`Voorbeeldweergave`. Technisch gezien werkt alles prima: de grafiek wordt inderdaad bijgewerkt volgens de gekozen filteroptie. De gefilterde grafiek wordt evenwel volkomen nutteloos omdat slechts één enkel punt wordt weergegeven.

source: We need an alternative visualization, that will only be displayed if the filter is used. This alternative visualization will replace the default, unfiltered chart that becomes useless once filtered. Let's do this!
de: Wir benötigen eine alternative Visualisierung, die nur bei Verwendung des Filters angezeigt wird. Diese alternative Visualisierung ersetzt das standardmäßige, ungefilterte Diagramm, das nach dem Einsatz des Filters nutzlos ist. Los geht´s!
es: Necesitamos una visualización alternativa, que solo se visualizará si se utiliza el filtro. Esta visualización alternativa sustituirá al gráfico sin filtrar predeterminado que se vuelve innecesario una vez filtrado. ¡Adelante!
fr: Nous avons besoin d'une autre visualisation, qui s'affiche uniquement si le filtre est utilisé. Cette visualisation alternative remplace celle par défaut, c'est-à-dire le graphe non filtré qui perd de son intérêt une fois filtré. C'est parti !
nl: We hebben een andere weergave nodig die enkel zal worden weergegeven wanneer de filter wordt gebruikt. Deze andere weergave zal de standaard weergave, waarbij ongefilterde grafieken nutteloos worden eenmaal ze worden gefilterd, vervangen. Aan het werk!

source: Add an alternative visualization, with AngularJS
de: Hinzufügen einer alternativen Visualisierung mit AngularJS
es: Añadir una visualización alternativa con AngularJS
fr: Ajouter une visualisation alternative avec AngularJS
nl: Voeg met AngularJS een andere weergave toe

source: 5 + Before diving into AngularJS directives and expressions, let's add the widget code of our alternative visualization, right below the first one. Here, we chose to display a column chart representing the top 10 of the best universities in the ranking. For each university, the chart shows their average score. Keep in mind that this chart will only be displayed when the filter is used, meaning that the new alternative chart will always show the top 10 universities per chosen country.
de: 5 + Bevor wir uns mit den Richtlinien und Ausdrücken von AngularJS befassen, fügen wir den Widget-Code unserer alternativen Visualisierung unmittelbar unter dem ersten hinzu. Hier haben wir uns für die Darstellung eines Säulendiagramms entschieden, das die 10 besten Universitäten im Ranking zeigt. Für jede Universität zeigt das Diagramm den Durchschnittswert an. Beachten Sie, dass dieses Diagramm nur dargestellt wird, wenn der Filter verwendet wird, d.h. das neue alternative Diagramm zeigt immer die 10 besten Universitäten des ausgewählten Landes an.
es: 5 + Antes de introducirnos en las expresiones y directivas AngularJS, vamos a añadir el código de widget de la visualización alternativa, justo bajo la primera. En este caso, hemos decidido visualizar un gráfico de columnas que representa la lista de las 10 mejores universidades de la clasificación. Para cada una de las universidades, el gráfico muestra su puntuación promedio. Tenga presente que este gráfico solo se visualizará cuando se utilice el filtro, lo que significa que el nuevo gráfico alternativo siempre mostrará las 10 mejores universidades por país seleccionado.
fr: 5 + Avant d'explorer les expressions et directives AngularJS, ajoutons le code de widget de notre visualisation optionnelle juste en dessous du premier. Ici, nous avons choisi d’afficher un diagramme en bâtons représentant le top 10 des meilleures universités du classement. Pour chaque université, le score moyen est affiché dans le graphe. Gardez à l'esprit que ce graphe est uniquement affiché quand le filtre est utilisé, ce qui signifie que le nouveau graphe optionnel affichera toujours le top 10 des universités par pays choisi.
nl: 5 + Alvorens dieper in te gaan op de AngularJS-richtlijnen en -uitdrukkingen, gaan we eerst de widgetcode van onze andere weergave toevoegen net onder de eerste. Hier kiezen we ervoor om een kolomgrafiek weer te geven die de top 10 van de beste universiteiten in de rangschikking vertegenwoordigt. Voor elke universiteit toont de grafiek de gemiddelde score. Denk eraan dat deze grafiek enkel zal worden weergegeven wanneer de filter wordt gebruikt, met andere woorden de nieuwe alternatieve grafiek toont altijd de 10 beste universiteiten per gekozen land.

source: Don't forget to clean the code and to replace the context name with the one we declared earlier (see step 2).
de: Denken Sie daran, den Code zu entfernen und den Kontextnamen durch denjenigen zu ersetzen, den wir zuvor angegeben haben (siehe Schritt 2).
es: No olvide limpiar el código y sustituir el nombre de contexto por el que hemos declarado con anterioridad (consulte el paso 2).
fr: N'oubliez pas d'effacer le code et de remplacer le nom du contexte par celui déclaré plus tôt (cf. étape 2).
nl: Vergeet niet om de code te zuiveren en om de contextnaam te vervangen door een die we eerder al hebben aangegeven (zie stap 2).
