Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_make_visualizations_match_filters.po
Languages: de, es, fr, nl

source: 14 + And finally, let's add titles and textual indications, to make sure that everyone understands how the page and its content work.
de: 14 + Schließlich können wir noch Titel und Texthinweise hinzufügen, um sicherzustellen, dass jeder versteht, wie die Seite und ihr Inhalt funktionieren.
es: 14 + Por último, vamos a añadir títulos e indicaciones textuales para asegurarnos de que todo el mundo entiende el funcionamiento de la página y su contenido.
fr: 14 + Pour finir, ajoutons des titres et des indications textuelles pour garantir que tout le monde comprend le fonctionnement de la page et de son contenu.
nl: 14 + Tot slot gaan we titels en tekstuele indicaties toevoegen om ervoor te zorgen dat iedereen begrijpt hoe de pagina en de content ervan werkt.

source: **CONGRATULATIONS!**
de: **HERZLICHEN GLÜCKWUNSCH!**
es: **¡ENHORABUENA!**
fr: **FÉLICITATIONS !**
nl: **GEFELICITEERD!**

source: You have finished this tutorial and you now know how to create different visualizations options to make sure they match the filters of the page. And hopefully your now feel comfortable enough with the combination of ``ng-if`` and ``context.parameters`` to be able to use it again on your own!
de: Sie haben dieses Tutorial abgeschlossen und wissen jetzt, wie man verschiedene Visualisierungsoptionen erstellt, damit sie den Filtern der Seite entsprechen. Wir hoffen, dass Sie jetzt mit dem Umgang mit ``ng-if`` und ``context.parameters`` vertraut sind und sie das nächste Mal selbstständig nutzen werden!
es: Ha completado este tutorial, y ahora ya sabe cómo crear diferentes opciones de visualizaciones para hacer que se correspondan con los filtros de la página. ¡Y esperamos que se sienta lo suficientemente cómodo con el uso de ``ng-if`` y ``context.parameters`` para hacerlo por sí solo en adelante!
fr: Vous avez terminé ce tutoriel et savez maintenant comment créer différentes options de visualisations pour vous assurer qu'elles correspondent aux filtres de la page. De plus, vous devez suffisamment maîtriser la combinaison de ``ng-if`` et ``context.parameters`` pour l'utiliser à votre guise !
nl: U heeft deze handleiding volledig doorlopen en weet nu hoe u verschillende weergaveopties moet aanmaken om ervoor te zorgen dat deze overeenstemmen met de filters van de pagina. Hopelijk bent u nu voldoende vertrouwd met combinatie van ``ng-if`` en ``context.parameters`` om deze later zelfstandig opnieuw te kunnen gebruiken!

source: *This tutorial will teach you how to create different visualizations options to match related filters. This can be useful especially with charts, since they can sometimes become useless once related filters are activated. This tutorial will be fully customizable and reusable in any dashboard or piece of content created with HTML/CSS on Opendatasoft.*
fr: *Dans ce tutoriel, vous allez apprendre à créer différentes options de visualisations qui correspondent à des filtres associés. Cela peut être particulièrement utile avec les graphes, puisque ces derniers perdent de leur intérêt une fois les filtres associés activés. Ce tutoriel peut être entièrement personnalisé et réutilisé avec n'importe quel tableau de bord ou élément de contenu créé avec HTML/CSS sur Opendatasoft.*
nl: *In deze handleiding leert u hoe u verschillende weergaveopties kunt aanmaken om overeen te stemmen met eraan verbonden filters. Dit kan vooral nuttig zijn met grafieken aangezien deze soms nutteloos kunnen worden eenmaal de eraan verbonden filters worden geactiveerd. Deze handleiding kan volledig worden gepersonaliseerd en opnieuw worden gebruikt in elke dashboard of stuk content dat aangemaakt wordt met HTML/CSS op Opendatasoft.*

source: In order to test this tutorial and/or integrate the hide/show configuration on widgets in an already existing page, you need to have access to the back office of an Opendatasoft portal and be granted the "Edit all pages" permission.
fr: Pour tester ce tutoriel et/ou intégrer la configuration masquer/afficher aux widgets d'une page existante, vous avez besoin d'un accès à l'interface d'administration d'un portail Opendatasoft, ainsi que de la permission "Éditer toutes les pages".
nl: Om deze handleiding uit te testen en/of de configuratie van widgets in een reeds bestaande pagina te verbergen of te tonen, moet u toegang hebben tot de back office van een Opendatasoft-portaal en moet u de toelating "Alle pagina's bewerken" hebben.

source: In this tutorial, we will create a page comprised of a visualization and its related dataset filter, using the `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ dataset that can be found on our Opendatasoft data network.
fr: Dans ce tutoriel, nous allons créer une page composée d'une visualisation et de son filtre de jeu de données associé à l'aide du jeu de données `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`, disponible sur notre réseau de données Opendatasoft.
nl: In deze handleiding zullen we een pagina aanmaken die bestaat uit een weergave en de eraan verbonden datasetfilter. We gebruiken hierbij de `Shanghai World University Ranking <https://data.opendatasoft.com/explore/dataset/shanghai-world-university-ranking%40public/>`_ dataset die terug te vinden is op ons Opendatasoft datanetwerk.

source: Depending on whether you try this tutorial on a new page or in an existing dashboard, you will perhaps see the ``<div class="container">`` and ``<div class="ods-box">`` tags: both are default tags that create the default frame of any Opendatasoft page. If you want to keep this frame, make sure to add the code of the tutorial between these default tags.
fr: En fonction de l'environnement (nouvelle page ou tableau de bord existant) dans lequel vous effectuez ce tutoriel, vous pourrez peut-être voir les tags ``<div class="container">`` et ``<div class="ods-box">``. Il s'agit des tags par défaut qui créent le cadre par défaut d'une page Opendatasoft. Si vous souhaitez conserver ce cadre, veillez à ajouter le code du tutoriel entre ces tags par défaut.
nl: Afhankelijk van het feit of u deze handleiding uitprobeert op een nieuwe pagina of in een bestaand dashboard, zult u misschien de tags ``<div class="container">`` en ``<div class="ods-box">`` zien: beide zijn standaard tags die het standaard kader van een Opendatasoft-pagina aanmaken. Indien u dit kader wilt behouden, zorg er dan voor dat u de code van de handleiding tussen deze standaard tags toevoegt.
