Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_create_tabs.po
Languages: de, es, fr, nl

source: Third comes the value. It must always be written between single quotes ``'``. The value is the identifier of a tab. Each tab that is created must have its very own identifier. There again, make sure that the name of the value is self-explanatory. In this tutorial, we will have 3 values for the 3 tabs, and we will name them ``firsttab``, ``secondtab`` and ``thirdtab``.
de: Als drittes kommt der Wert. Er muss immer zwischen einfachen Anführungszeichen (``'``) geschrieben werden. Der Wert ist die Kennung eines Tabs. Auch hier ist darauf zu achten, dass der Name des Wertes selbsterklärend ist. In diesem Tutorial haben wir 3 Werte für die 3 Tabs und wir nennen sie ``firsttab``, ``secondtab`` und ``thirdtab``.
es: En tercera posición viene el valor. Debe escribirse siempre entre comillas simples ``'``. El valor es el identificador de una ficha. Cada una de las fichas creadas debe tener su propio identificador. De nuevo, cerciórese de que el nombre del valor sea descriptivo. En este tutorial, tendremos 3 valores para las 3 fichas, y las llamaremos ``firsttab``, ``secondtab`` y ``thirdtab``.
fr: Enfin, la valeur ferme la marche. Elle doit toujours être placée entre des guillemets simples ``'``. La valeur joue le rôle d'identifiant d'un onglet ; chaque onglet créé doit avoir un identifiant unique. Une fois encore, veillez à ce que le nom de la valeur soit explicite. Dans ce tutoriel, nous allons avoir 3 valeurs pour les 3 onglets, nommés ``firsttab``, ``secondtab`` et ``thirdtab``.
nl: Ten derde komt de waarde. Deze moet altijd geschreven staan tussen enkele aanhalingstekens ``'``. De waarde is de identifier van een tabblad. Elk tabblad dat wordt aangemaakt moet zijn eigen specifieke identifier hebben. Zorg er opnieuw voor dat de naam van de waarde voor zich spreekt. In deze handleiding zullen we 3 waarden hebben voor de 3 tabbladen en zullen we ze de naam ``firsttab``, ``secondtab`` en ``thirdtab`` geven.

source: 9 + Add the ``ng-click`` directive in the HTML ``<a>`` tag of each tab title. At this point, we have indicated to AngularJS that we have 3 different clickable entities: our 3 tab titles.
de: 9 + Fügen Sie die Richtlinie ``ng-click`` im HTML ``<a>``-Tag jedes Tab-Titels hinzu. Zu diesem Zeitpunkt haben wir AngularJS mitgeteilt, dass wir 3 verschiedene anklickbare Einheiten haben: unsere 3 Tab-Titel.
es: 9 + Añada la directiva ``ng-click`` en la etiqueta HTML ``<a>`` de cada uno de los títulos de las fichas. En este punto, hemos indicado a AngularJS que tenemos 3 entidades interactivas distintas: nuestros 3 títulos de fichas.
fr: 9 + Ajoutez la directive ``ng-click`` dans le tag HTML ``<a>`` de chaque titre d'onglet. À ce stade, nous avons indiqué à AngularJS que nous avons 3 entités cliquables différentes : nos 3 titres d'onglet.
nl: 9 + Voeg de richtlijn ``ng-click`` toe in de HTML ``<a>`` tag van elke tabbladtitel. Op dit moment hebben we aan AngularJS aangegeven dat we 3 verschillende entiteiten hebben die kunnen worden aangeklikt: onze 3 tabbladtitels.

source: 10 + On to ``ng-if`` now! The ``ng-if`` directive is a conditional expression that determines whether an HTML element should be displayed or not. In our case, ``ng-if`` will allow us to display the right tab content when clicking on a tab title.
de: 10 + Jetzt geht es weiter mit ``ng-if``! Die Richtlinie ``ng-if`` ist ein bedingter Ausdruck, der bestimmt, ob ein HTML-Element angezeigt werden soll oder nicht. In unserem Fall ermöglicht uns ``ng-if```, den richtigen Tab-Inhalt anzuzeigen, wenn wir auf einen Tab-Titel klicken.
es: 10 + ¡Y ahora a por ``ng-if``! La directiva ``ng-if`` es una expresión condicional que determina si un elemento HTML debe visualizarse o no. En este caso, ``ng-if`` nos permitirá visualizar el contenido adecuado de la ficha al hacer clic en un título de ficha.
fr: 10 + Passons maintenant à ``ng-if`` ! La directive ``ng-if`` est une expression conditionnelle qui détermine si un élément HTML doit être affiché ou non. Ici, ``ng-if`` nous permet d'afficher le contenu d'onglet approprié lorsque l'utilisateur clique sur un titre d'onglet.
nl: 10 + Nu is het de beurt aan ``ng-if``! De richtlijn ``ng-if`` is een voorwaardelijke uitdrukking die bepaalt of een HTML-element al dan niet moet worden weergegeven. In ons geval zal ``ng-if`` ons toelaten om de juiste tabcontent weer te geven wanneer op een tabbladtitel wordt geklikt.

source: Let's take a look at the syntax to understand how to use the ``ng-if`` directive.
de: Werfen wir einen Blick auf die Syntax, um zu verstehen, wie man die Richtlinie ``ng-click`` verwendet.
es: Veamos la sintaxis para entender cómo utilizar la directiva ``ng-if``.
fr: Observons la syntaxe pour comprendre comment utiliser la directive ``ng-if``.
nl: Laten we een kijkje nemen naar de syntax om te begrijpen hoe we de richtlijn ``ng-if`` moeten gebruiken.

source: The structure of the ``ng-if`` directive is the same as for ``ng-click``. The name of the directive is followed by an equals sign ``=`` and the expression that will be evaluated by the ``ng-if`` directive is written between double quotes ``"``.
de: Die Struktur der Richtlinie ``ng-if`` ist die gleiche wie bei ``ng-click``. Auf den Namen der Richtlinie folgt ein Gleichheitszeichen ``=``. Der Ausdruck, der von der Richtlinie ``ng-if`` ausgewertet wird, steht zwischen doppelten Anführungszeichen ``"``.
es: La estructura de la directiva ``ng-if`` es la misma que la de ``ng-click``. El nombre de la directiva va seguido de un signo de igual ``=`` y la expresión que será evaluada por la directiva ``ng-if`` se escribe entre comillas dobles ``"``.
fr: La structure de la directive ``ng-if`` est identique à celle de ``ng-click``. Le nom de la directive est suivi d'un signe égal, ``=``, et l'expression évaluée par la directive ``ng-if`` est placée entre des guillemets doubles ``"``.
nl: De structuur van de ``ng-if``-richtlijn is dezelfde als die voor ``ng-click``. De naam van de richtlijn wordt gevolgd door een gelijkheidsteken ``=`` en de uitdrukking die wordt geëvalueerd door de ``ng-if``-richtlijn wordt geschreven tussen dubbele aanhalingstekens ``"``.

source: But the syntax differs a little bit. In the expression,
de: Die Syntax ist jedoch ein wenig anders. Im Ausdruck
es: Pero la sintaxis varía un poco. En la expresión:
fr: Toutefois, la syntaxe diffère légèrement. Dans l'expression,
nl: Maar de syntax is iets anders. In de uitdrukking,

source: The variable is the same we created in step 8.
de: Ist die Variable die gleiche, die wir in Schritt 8 erstellt haben.
es: La variable es la misma que hemos creado en el paso 8.
fr: La variable est identique à celle créée à l'étape 8.
nl: De variabele is dezelfde als diegene die we hebben aangemaakt in stap 8.

source: Here is where the syntax differs: this time, the variable and value must be separated by 2 equals signs ``==``. It indicates that we express a condition.
de: Hier unterscheidet sich die Syntax: Diesmal müssen die Variable und der Wert durch 2 Gleichheitszeichen (``==``). getrennt werden. Auf diese Weise wird angezeigt, dass wir eine Bedingung ausdrücken.
es: Aquí es donde la sintaxis cambia: esta vez, la variable y el valor deben ir separados por 2 signos de igual ``==``. Esto indica que expresamos una condición.
fr: Voici ce qui diffère au niveau de la syntaxe : cette fois, la variable et la valeur doivent être séparées par 2 signes égal, ``==``. Cela indique qu'il s'agit d'une condition.
nl: Het is hier dat de syntax verschillend is: dit keer moeten de variabele en de waarde gescheiden worden door 2 gelijkheidstekens ``==``. Hiermee wordt aangegeven dat we een voorwaarde uitdrukken.

source: The value (written between single quotes ``'``) is the same we created in step 8.
de: Der Wert (geschrieben zwischen einfachen Anführungszeichen ``'``) ist der gleiche, den wir in Schritt 8 erstellt haben.
es: El valor (escrito entre comillas simples ``'``) es el mismo que hemos creado en el paso 8.
fr: La valeur (placée entre des guillemets simples ``'``) est identique à celle créée à l'étape 8.
nl: De waarde (die geschreven staat tussen enkele aanhalingstekens ``'``) is dezelfde als diegene die we aangemaakt hebben in stap 8.

source: Basically, the ``ng-if`` syntax could be read as such: "If ``myvariable`` equals ``myvalue``, [display the content of the HTML element corresponding to ``myvalue``]".
de: Grundsätzlich könnte die ``ng-if``-Syntax folgendermaßen gelesen werden: "Wenn ``myvariable`` gleich ``myvalue`` ist, [den Inhalt des HTML-Elements anzeigen, der ``myvalue`` entspricht]".
es: En definitiva, la sintaxis de ``ng-if`` puede leerse así: "Si ``myvariable`` es igual a ``myvalue``, [visualizar el contenido del elemento HTML correspondiente a ``myvalue``]".
fr: Pour faire simple, la syntaxe ``ng-if`` signifie : " Si ``myvariable`` est égal à ``myvalue``, [le contenu de l'élément HTML correspondant à ``myvalue`` est affiché`] ".
nl: In essentie zou de ``ng-if``-syntax gelezen kunnen worden als volgt: "Wanneer ``myvariable`` gelijk is aan ``myvalue``, [de content weergeven van het HTML-element dat overeenstemt met ``myvalue``]".

source: 11 + Add the ``ng-if`` directive in the HTML ``<div>`` tag of each tab content. Don't forget to put all 3 values to match the 3 tab contents. At this point, we have indicated AngularJS which tab content to display depending on which tab title is selected.
de: 11 + Fügen Sie die Richtlinie ``ng-if`` im HTML ``<div>``-Tag jedes Tab-Inhalts hinzu. Vergessen Sie nicht, alle 3 Werte so zu setzen, dass sie mit dem Inhalt der 3 Tabs übereinstimmen. Zu diesem Zeitpunkt haben wir AngularJS mitgeteilt, welcher Tab-Inhalt je nachdem, welcher Tab-Titel ausgewählt wurde, angezeigt werden soll.
es: 11 + Añada la directiva ``ng-if`` en la etiqueta HTML ``<div>`` del contenido de cada una de las fichas. No olvide poner los 3 valores para el contenido de las 3 fichas. En este punto, hemos indicado a AngularJS qué contenido de ficha debe visualizar en función del título de ficha seleccionado.
fr: 11 + Ajoutez la directive ``ng-if`` dans le tag HTML ``<div>`` de chaque contenu d'onglet. N'oubliez pas d'ajouter les 3 valeurs correspondant aux 3 contenus d'onglet. À ce stade, nous avons indiqué à AngularJS quel contenu d'onglet afficher en fonction du titre d'onglet sélectionné.
nl: 11 + Voeg de ``ng-if``-richtlijn toe in de HTML ``<div>`` tag van elke tabcontent. Vergeet niet om alle 3 de waarden te plaatsen om overeen te stemmen met de 3 tabcontents. Op dit moment hebben we aan AngularJS aangegeven welke tabcontent moet worden weergegeven afhankelijk van welke tabbladtitel is geselecteerd.

source: 12 + It's time to tackle ``ng-init``! This directive is used to initialize a variable: it basically means that when a web page is loaded, the code behind that page is going to be read from the first to the last line. ``ng-init`` will indicate that from there, AngularJS will be used, and which variable will be used. In our case, ``ng-init`` will also be used to indicate which tab content should be displayed by default.
de: 12 + Jetzt geht es weiter mit ``ng-init``! Diese Richtlinie wird verwendet, um eine Variable zu initialisieren: das bedeutet im Grunde genommen, dass beim Laden einer Webseite der Code hinter dieser Seite von der ersten bis zur letzten Zeile gelesen wird. ``ng-init`` gibt an, dass an dieser Stelle AngularJS verwendet wird und welche Variable verwendet wird. In unserem Fall wird ``ng-init`` außerdem verwendet, um anzugeben, welcher Tab-Inhalt standardmäßig angezeigt werden soll.
es: 12 + ¡Es la hora de ``ng-init``! Esta directiva se utiliza para inicializar una variable: en definitiva, significa que cuando se carga una página web, el código subyacente de esa página se leerá de la primera a la última línea. ``ng-init`` indicará que a partir de ahí se usará AngularJS, y qué variable se usará. En este caso, ``ng-init`` también servirá para indicar qué contenido de ficha debe visualizarse de forma predeterminada.
fr: 12 + Il est temps de nous intéresser à ``ng-init`` ! Cette directive sert à initialiser une variable, c'est-à-dire que quand une page Web est chargée, le code se trouvant derrière la page en question va être lu de la première à la dernière ligne. ``ng-init`` indique qu'à partir d'ici, AngularJS est utilisé et spécifie le type de variable appliqué. Ici, ``ng-init`` permet également d'indiquer quel contenu d'onglet doit être affiché par défaut.
nl: 12 + Het is nu tijd om dieper in te gaan op ``ng-init``! Deze richtlijn wordt gebruikt om een variabele te initialiseren: dit betekent dat wanneer een webpagina wordt opgeladen, de code achter die pagina gelezen gaat worden van de eerste tot de laatste lijn. ``ng-init`` zal aangeven dat vanaf dan AngularJS zal worden gebruikt en welke variabele zal worden gebruikt. In ons geval zal ``ng-init`` ook gebruikt worden welke tabcontent standaard dient te worden weergegeven.

source: Let's take a look at the syntax to understand how to use the ``ng-init`` directive.
de: Werfen wir einen Blick auf die Syntax, um zu verstehen, wie man die Richtlinie ``ng-init`` verwendet.
es: Veamos la sintaxis para entender cómo utilizar la directiva ``ng-init``.
fr: Observons la syntaxe pour comprendre comment utiliser la directive ``ng-init``.
nl: Laten we een kijkje nemen naar de syntax om te begrijpen hoe de ``ng-init``-richtlijn moet worden gebruikt.

source: The syntax of the ``ng-init`` directive is exactly the same as for ``ng-click`` (see step 8).
de: Die Syntax der Richtlinie ``ng-init`` entspricht exakt derjenigen von ``ng-click`` (siehe Schritt 8).
es: La sintaxis de la directiva ``ng-init`` coincide exactamente con la de ``ng-click`` (consulte el paso 8).
fr: La syntaxe de la directive ``ng-init`` est en tout point identique à celle de ``ng-click`` (cf. étape 8).
nl: De syntax van de ``ng-init``-richtlijn is precies dezelfde als voor ``ng-click`` (zie stap 8).

source: In the expression:
de: In diesem Ausdruck:
es: En la expresión:
fr: Dans l'expression :
nl: In de uitdrukking:

source: The variable is the same we created in step 8 and have been using since.
de: Ist die Variable die gleiche, die wir in Schritt 8 erstellt und seitdem verwendet haben.
es: La variable es la misma que hemos creado en el paso 8 y hemos venido utilizando en adelante.
fr: La variable est identique à celle créée à l'étape 8 et utilisée jusqu'alors.
nl: De variabele is dezelfde als diegene die we hebben aangemaakt in stap 8 en die we sindsdien hebben gebruikt.

source: The value (written between single quotes ``'``) is the identifier of the tab which content will be display by default.
de: Der Wert (geschrieben zwischen einfachen Anführungszeichen ``'``) ist die Kennung des Tabs, dessen Inhalt standardmäßig angezeigt wird.
es: El valor (escrito entre comillas simples ``'``) es el identificador de la ficha cuyo contenido se visualizará de forma predeterminada.
fr: La valeur (placée entre des guillemets simples ``'``) est l'identifiant de l'onglet dont le contenu sera affiché par défaut.
nl: De waarde (die geschreven staat tussen enkele aanhalingstekens ``'``) is de identifier van het tabblad waarvan de content standaard zal worden weergegeven.

source: 13 + Add the ``ng-init`` directive in an HTML tag that wraps the whole code of the tabs. For this tutorial, since we created a whole new page, our whole page code is already wrapped in 2 default frame tags: ``<div class="container-fluid">`` and ``<div class="ods-box">``. We will thus put ``ng-init`` in the default ``<div class="ods-box">`` tag. At this point, our tabs are fully functional!
de: 13 + Fügen Sie die Richtlinie ``ng-init`` in ein HTML-Tag ein, das den gesamten Code der Tabs umgibt. Da wir in diesem Tutorial eine komplett neue Seite erstellt haben, ist unser gesamter Seitencode bereits von 2 standardmäßigen Frame Tags umgeben: ``<div class="container-fluid">`` und ``<div class="ods-box">``. Wir fügen also ``ng-init`` in das standardmäßige ``<div class="ods-box">``-Tag ein. Von nun an sind unsere Tabs voll funktionsfähig!
es: 13 + Añada la directiva ``ng-init`` en una etiqueta HTML que delimita todo el código de las fichas. Para este tutorial, como hemos creado una página nueva, el código de la página ya está delimitado por 2 etiquetas de marco predeterminadas: ``<div class="container-fluid">`` y ``<div class="ods-box">``. Por consiguiente, pondremos ``ng-init`` en la etiqueta ``<div class="ods-box">`` predeterminada. ¡Nuestras fichas ya están plenamente operativas!
fr: 13 + Ajoutez la directive ``ng-init`` à un tag HTML qui enveloppe l'ensemble du code des onglets. Dans le cadre de ce tutoriel, puisque nous avons créé une nouvelle page, le code de la page est enveloppé dans 2 tags de cadre par défaut : ``<div class="container-fluid">`` et ``<div class="ods-box">``. Nous allons ensuite placer ``ng-init`` dans le tag ``<div class="ods-box">`` par défaut. Nos onglets sont maintenant fonctionnels !
nl: 13 + Voeg de ``ng-init``-richtlijn toe in een HTML tag die de volledige code van de tabbladen omringt. Voor deze handleiding en aangezien we een volledig nieuwe pagina hebben aangemaakt, is onze volledige paginacode reeds omringd in 2 standaard kadertags: ``<div class="container-fluid">`` en ``<div class="ods-box">``. Bijgevolg plaatsen we ``ng-init`` in de standaard ``<div class="ods-box">`` tag. Op dit moment zijn onze tabbladen volledig functioneel!

source: If you did not create a whole new page for this tutorial and do not have these default frame tags, you could add regular ``<div>`` tag to wrap the tabs code, and add the ``ng-init`` directive in it.
de: Wenn Sie keine komplett neue Seite für dieses Tutorial erstellt haben und diese Standard-Frame-Tags nicht verwenden, können Sie ein reguläres ``<div>``-Tag hinzufügen, um den Code des Tabs zu umgeben, und die Richtlinie ``ng-init`` darin hinzuzufügen.
es: Si no ha creado una página nueva para este tutorial y no tiene estas etiquetas de marco predeterminadas, puede añadir la etiqueta ``<div>`` normal para delimitar el código de las fichas y añadir la directiva ``ng-init`` dentro.
fr: Si vous n'avez pas créé de page pour ce tutoriel, et si vous n'avez pas ces tags de cadre par défaut, vous pouvez ajouter un tag ``<div>`` normal pour envelopper le code des onglets et ajouter la directive ``ng-init`` dans celui-ci.
nl: Indien u geen volledig nieuwe pagina heeft aangemaakt voor deze handleiding en deze standaard kadertags niet heeft, zou u een gewone ``<div>`` tag kunnen toevoegen om de code van de tabbladen te omringen en er een ``ng-init`` -richtlijn in kunnen toevoegen.

source: 14 + Check the preview. Although our tabs fully work by now, there is still something that is missing. Nothing indicates which tab is selected! Let's do this, starting with the creation of a "selected tab" style.
de: 14 + Sehen Sie sich die Vorschau an. Obwohl unsere Tabs inzwischen einwandfrei funktionieren, fehlt noch etwas. Es wird nicht angezeigt, welcher Tab ausgewählt ist! Kümmern wir uns darum, indem wir einen "selected tab"-Stil erstellen.
es: 14 + Revise la vista previa. Aunque en este momento las fichas ya están plenamente operativas, todavía falta algo. ¡No hay nada que indique la ficha que está seleccionada! Vamos a por ello, empezando por crear un estilo de tipo "ficha seleccionada".
fr: 14 + Consultez l'aperçu. Même si nos onglets sont entièrement fonctionnels, il manque un petit quelque chose... En effet, rien n'indique quel onglet est sélectionné. Remédions à cela en commençant par créer un style "onglet sélectionné".
nl: 14 + Controleer de voorbeeldweergave. Hoewel onze tabbladen nu volledig werken, ontbreekt er nog altijd iets. Er is niets dat aangeeft welk tabblad is geselecteerd! Laten we dit nu doen, te beginnen met aanmaken van een stijl "geselecteerd tabblad".

source: 15 + Go back to the CSS section of the page you are working on, to create a distinct style which easily indicates which tab is selected. Here, we will call this CSS class ``activetab`` and play with both the text color and a bold border under the text.
de: 15 + Wechseln Sie zurück zum CSS-Abschnitt der Seite, an der Sie gerade arbeiten. Hier können Sie einen eigenen Stil erstellen, der anzeigt, welcher Tab ausgewählt ist. In diesem Fall nennen wir diese CSS-Klasse ``activetab`` und arbeiten sowohl mit der Textfarbe als auch mit einem fetten Rand unter dem Text.
es: 15 + Vuelva a la sección CSS de la página en que está trabajando, para crear un estilo específico que indique fácilmente qué ficha está seleccionada. En este caso, denominaremos la clase CSS ``activetab`` y jugaremos tanto con el color del texto como con un borde en negrita bajo el texto.
fr: 15 + Revenez à la section CSS de la page sur laquelle vous travaillez, puis créez un style distinct qui indique de façon claire l'onglet actuellement sélectionné. Nous allons appeler cette classe CSS ``activetab``, puis jouer avec la couleur du texte et une bordure en gras sous le texte.
nl: 15 + Keer terug naar de CSS-sectie van de pagina waar u aan werkt om een afzonderlijke stijl aan te maken die gemakkelijk aangeeft welk tabblad is geselecteerd. We zullen deze CSS-klasse hier ``activetab`` noemen en met zowel de tekstkleur als een dikke rand onder de tekst spelen.

source: 16 + Go back to the HTML section of the page you are working on. We will now apply our CSS style using our fourth (and last!) AngularJS directive: ``ng-class``. This directive is a conditional expression that determines whether a CSS class will apply on an HTML element or not. In our case, ``ng-class`` will be used to apply a particular style to a tab title when it is selected.
de: 16 + Wechseln Sie zurück zum HTML-Abschnitt der Seite, an der Sie gerade arbeiten.Wir werden unseren CSS-Stil jetzt mit unserer vierten (und letzten!) AngularJS-Richtlinie anwenden: ``ng-class``. Diese Richtlinie ist ein bedingter Ausdruck. Er bestimmt, ob eine CSS-Klasse auf ein HTML-Element angewendet wird oder nicht. In unserem Fall wird ``ng-class`` verwendet, um einen bestimmten Stil für einen Tab-Titel anzuwenden, wenn dieser ausgewählt ist.
es: 16 + Vuelva a la sección HTML de la página en que está trabajando. Ahora aplicaremos nuestro estilo CSS con la ayuda de nuestra cuarta (¡y última!) directiva AngularJS: ``ng-class``. Esta directiva es una expresión condicional que determina si una clase CSS se aplicará a un elemento HTML o no. En este caso, ``ng-class`` servirá para aplicar un estilo concreto a un título de ficha al seleccionarse.
fr: 16 + Revenez à la section HTML de la page sur laquelle vous travaillez. Nous allons maintenant appliquer notre style CSS à l'aide de notre quatrième (et dernière !) directive AngularJS : ``ng-class``. Cette directive est une expression conditionnelle qui détermine si une classe CSS va être appliquée à un élément HTML ou non. Ici, ``ng-class`` va être utilisée pour appliquer un style particulier au titre d'un onglet quand celui-ci est sélectionné.
nl: 16 + Keer terug naar de HTML-sectie van de pagina waar u aan werkt. We gaan nu onze CSS-stijl toepassen door gebruik te maken van onze vierde (en laatste) AngularJS-richtlijn: ``ng-class``. Deze richtlijn is een voorwaardelijke uitdrukking die bepaalt of een CSS-klasse op een HTML-element zal worden toegepast of niet. In ons geval zal ``ng-class`` worden gebruik om een welbepaalde stijl toe te passen op een tabbladtitel wanneer deze wordt geselecteerd.
