Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_make_visualizations_match_filters.po
Languages: de, es, fr, nl

source: 6 + It is now time to tackle AngularJS! We will need to add an AngularJS directive to both visualizations: the default one (that should NOT be displayed if the filter is used) and the alternative chart (that should ONLY be displayed if the filter is used). Since any AngularJS directive must be added into an HTML tag, and seeing our code, the best way to do in order to keep our code clean is to add ``div`` tags. Wrap each chart between ``div`` tags.
de: 6 + Jetzt geht es weiter mit AngularJS! Wir müssen für beide Visualisierungen eine AngularJS-Richtlinie hinzufügen: das Standard-Diagramm (das NICHT angezeigt werden sollte, wenn der Filter verwendet wird) und das alternative Diagramm (das NUR DANN angezeigt werden sollte, wenn der Filter verwendet wird). Da jede AngularJS-Richtlinie in ein HTML-Tag eingefügt werden muss und angesichts unseres Codes, sollten wir zum Zwecke der Übersichtlichkeit ``div``-Tags verwenden. Umgeben Sie jedes Diagramm mit ``div``-Tags.
es: 6 + ¡Es la hora de AngularJS! Tendremos que añadir una directiva AngularJS a ambas visualizaciones: el gráfico predeterminado (el que NO se visualizará si se emplea el filtro) y el alternativo (el que SOLO se visualizará si se emplea el filtro). Puesto que cualquier directiva AngularJS debe añadirse en una etiqueta HTML, y viendo nuestro código, la mejor manera de hacerlo para mantener limpio el código es añadir etiquetas ``div``. Delimite cada uno de los gráficos mediante etiquetas ``div``.
fr: 6 + Le moment est venu de s'intéresser à AngularJS. Nous allons devoir ajouter une directive AngularJS aux deux visualisations : celle par défaut (qui NE doit PAS être affichée si le filtre est utilisé) et le graphe optionnel (qui doit UNIQUEMENT être affiché si le filtre est utilisé). Les directives AngularJS devant être ajoutées dans un tag HTML, la meilleure méthode pour ce faire après avoir observé le code est d'ajouter des tags ``div``. De cette façon, le code pourra rester propre. Enveloppez maintenant chaque graphe entre des tags ``div``.
nl: 6 + Het is nu tijd om dieper in te gaan op AngularJS. We moeten een AngularJS-richtlijn toevoegen aan beide weergaves: de standaard (die NIET mag worden weergegeven wanneer de filter wordt gebruikt) en de alternatieve grafiek (die ENKEL mag worden weergegeven wanneer de filter wordt gebruikt). Aangezien een AngularJS-richtlijn moet worden toegevoegd in een HTML-tag en wanneer we onze code bekijken, is de beste manier om te werk te gaan om onze code zuiver te houden ``div`` tags toevoegen. Omring elke grafiek tussen ``div`` tags.

source: 7 + We now have a perfect place to write our AngularJS directives! Let's start with the alternative chart, the one that must only be displayed if the filter is used. To do so, we need to use the ``ng-if`` AngularJS directive. The ``ng-if`` directive is a conditional expression that determines whether an HTML element should be displayed or not.
de: 7 + Wir haben jetzt einen perfekten Ort, um unsere AngularJS-Richtlinien zu schreiben! Beginnen wir mit dem alternativen Diagramm, das nur angezeigt werden soll, wenn der Filter verwendet wird. Dazu müssen wir die AngularJS-Richtlinie ``ng-if`` verwenden. Die Richtlinie ``ng-if`` ist ein bedingter Ausdruck, der bestimmt, ob ein HTML-Element angezeigt werden soll oder nicht.
es: 7 + ¡Ahora ya tenemos el lugar perfecto para escribir nuestras directivas AngularJS! Comenzaremos con el gráfico alternativo, el que solo se visualizará si se emplea el filtro. Para ello, tenemos que utilizar la directiva AngularJS ``ng-if``. La directiva ``ng-if`` es una expresión condicional que determina si un elemento HTML debe visualizarse o no.
fr: 7 + Nous disposons désormais de l'environnement idéal pour écrire nos directives AngularJS ! Commençons par le graphe alternatif, celui qui doit uniquement être affiché si le filtre est utilisé. Pour ce faire, nous devons utiliser la directive AngularJS ``ng-if``. Il s'agit d'une expression conditionnelle qui détermine si un élément HTML doit être affiché ou non.
nl: 7 + We hebben nu de perfecte plaats om onze AngularJS-richtlijnen te schrijven! We beginnen met de alternatieve grafiek, zijnde diegene die enkel mag worden weergegeven wanneer de filter wordt gebruikt. Hiervoor moeten we de ``ng-if``-richtlijn van AngularJS gebruiken. De ``ng-if``-richtlijn is een voorwaardelijke uitdrukking die bepaalt of een HTML-element al dan niet mag worden weergegeven.

source: Let's take a look at the syntax of the expression we are going to use.
de: Werfen wir einen Blick auf die Syntax des Ausdrucks.
es: Veamos la sintaxis de la expresión que vamos a usar.
fr: Observons la syntaxe de l'expression que nous allons utiliser.
nl: Laten we een kijkje nemen naar de syntax van de uitdrukking die we gaan gebruiken.

source: ``ng-if`` is the AngularJS directive. It is always followed by an equals sign ``=`` which indicates that what comes after is an expression. This expression will be evaluated by the directive, and it must always be written between double quotes ``"``.
de: ``ng-if`` ist eine AngularJS-Richtlinie. Darauf folgt immer ein Gleichheitszeichen ``=``. Es weist auf einen folgenden Ausdruck hin. Dieser Ausdruck wird von der Richtlinie ausgewertet und muss immer in doppelten Anführungszeichen geschrieben werden ``"``.
es: ``ng-if`` es la directiva AngularJS. Siempre va seguida de un signo de igual ``=`` que indica que lo que va a continuación es una expresión. Esta expresión será evaluada por la directiva y debe escribirse siempre entre comillas dobles ``"``.
fr: ``ng-click`` est la directive AngularJS. Elle est toujours suivie d'un signe égal, ``=``, qui indique que ce qui vient après est une expression. Cette expression sera évaluée par la directive et doit toujours se trouver entre des guillemets doubles ``"``.
nl: ``ng-if`` is de AngularJS-richtlijn. Ze wordt altijd gevolgd door een gelijkheidsteken ``=`` dat aangeeft dat wat erna komt een uitdrukking is. Deze uitdrukking zal door de richtlijn worden geëvalueerd en moet altijd geschreven worden tussen twee dubbele aanhalingstekens ``"``.

source: ``mycontext.parameters`` can be seen as an object which contains a list of context-related parameters that act as filters. The list of parameters must be written between brackets ``[ ]``, and each separate parameter must be written between single quotes ``'``. For this tutorial, since it is the use of the ``Country`` filter that will determine which chart visualization option should be displayed, we need the ``mycontext.parameters`` object to use the filter parameter in our ``ng-if`` expression. ``mycontext`` must be replaced by the name of the page context.
de: ``mycontext.parameters`` kann als ein Objekt betrachtet werden, das eine Liste von kontextbezogenen Parametern enthält, die als Filter dienen. Die Liste der Parameter muss in Klammern gesetzt werden ``[ ]`` und jeder einzelne Parameter muss in einfache Anführungszeichen gesetzt werden ``'``. Da für dieses Tutorial die Verwendung des Filters ``Country`` bestimmt, welche Diagrammvisualisierung angezeigt werden soll, muss das Objekt ``mycontext.parameters`` den Filterparameter im Ausdruck ``ng-if`` verwenden. ``mycontext`` muss durch den Namen des Seitenkontextes ersetzt werden.
es: ``mycontext.parameters`` puede entenderse como un objeto que contiene una lista de parámetros relacionados con el contexto que actúan como filtros. La lista de parámetros debe escribirse entre corchetes ``[ ]`` y cada uno de los parámetros debe escribirse entre comillas simples ``'``. Para este tutorial, como es el uso del filtro ``Country`` el que determinará qué opción de visualización de gráfico se mostrará, necesitamos que el objeto ``mycontext.parameters`` utilice el parámetro de filtro en nuestra expresión ``ng-if``. ``mycontext`` debe sustituirse por el nombre del contexto de la página.
fr: ``mycontext.parameters`` peut être vu comme un objet qui contient une liste de paramètres en lien avec le contexte, qui jouent le rôle de filtres. La liste de paramètres doit être placée entre des crochets ``[ ]``, et chaque paramètre doit être placé entre des guillemets simples ``'``. Dans le cadre de ce tutoriel, puisque c'est l'utilisation du filtre ``Country``qui va déterminer l'option de visualisation de graphe à afficher, nous avons besoin de l'objet ``mycontext.parameters`` pour utiliser le paramètre de filtre dans notre expression ``ng-if``. ``mycontext`` doit être remplacé par le nom du contexte de la page.
nl: ``mycontext.parameters`` kan beschouwd worden als een voorwerp dat een lijst met contextgerelateerde parameters bevat die werken als filters. De lijst met parameters moet tussen haakjes ``[ ]`` staan en elke afzonderlijke parameter moet geschreven worden tussen twee enkele aanhalingstekens ``'``. Voor deze handleiding en aangezien het het gebruik van de filter "Land" is die zal bepalen of welke grafiekweergaveoptie moet worden weergegeven, hebben we het voorwerp ``mycontext.parameters`` nodig om de filterparameter te gebruiken in onze ``ng-if``-uitdrukking. ``mycontext`` moet vervangen worden door de naam van de paginacontext.

source: ``refine`` indicates that we use a filter parameter.
de: ``refine`` zeigt an, dass wir einen Filterparameter verwenden.
es: ``refine`` indica que utilizamos un parámetro de filtro.
fr: ``refine`` indique que nous utilisons un paramètre de filtre.
nl: ``refine`` geeft aan dat we een filterparameter gebruiken.

source: ``.field_ID`` allows us to precise which specific filter we are going to use. ``field_ID`` must be replaced by the technical identifier of the field that is used as filter.
de: ``.field_ID`` ermöglicht uns, genau zu bestimmen, welchen spezifischen Filter wir verwenden werden. ``field_ID`` muss durch die technische Kennung des Feldes ersetzt werden, das als Filter verwendet wird.
es: ``.field_ID`` nos permite precisar qué filtro específico vamos a usar. ``field_ID`` debe sustituirse por el identificador técnico del campo empleado como filtro.
fr: ``.field_ID`` nous permet de préciser le filtre spécifique que nous allons appliqué. ``field_ID`` doit être remplacé par l'identifiant technique du champ utilisé comme filtre.
nl: ``.field_ID`` laat ons toe te verduidelijken welke specifieke filter we gaan gebruiken. ``field_ID`` moet vervangen worden door de technische identifier van het veld dat gebruikt wordt als filter.

source: Basically, the ``ng-if`` syntax could be read as such: "If ``mycontext`` is filtered with ``field_ID``, [display the related HTML elements]".
de: Grundsätzlich könnte die ``ng-if``-Syntax folgendermaßen gelesen werden: Wenn ``mycontext`` mit ``field_ID`` gefiltert wird, [die zugehörigen HTML-Elemente anzeigen]".
es: En definitiva, la sintaxis de ``ng-if`` puede leerse de este modo: "Si ``mycontext`` se filtra con ``field_ID``, [visualizar los elementos HTML relacionados]".
fr: Pour faire simple, la syntaxe ``ng-if`` signifie : " Si ``mycontext`` est filtré avec ``field_ID``, [les éléments HTML associés sont affichés] ".
nl: In essentie zou de ``ng-if``-syntax gelezen kunnen worden als volgt: "Wanneer ``mycontext`` wordt gefilterd met ``field_ID``, [de aanverwante HTML-elementen weergeven]".

source: 8 + Add the ``ng-if`` directive into the ``div`` tag wrapping the alternative chart. Don't forget to replace ``mycontext`` with the name of page context (see step 2) and ``field_ID`` with the technical identifier of the dataset field that we use as filter (see step 3). In this tutorial, ``mycontext`` is replaced with ``worlduniversityranking`` and ``field_ID`` is replaced with ``country``.
de: 8 + Fügen Sie die Richtlinie ``ng-if`` in das ``div``-Tag ein, das das alternative Diagramm umgibt. Denken Sie daran, ``mycontext`` durch den Namen des Seitenkontexts (siehe Schritt 2) und ``field_ID`` durch die technische Kennung des Datensatzfeldes zu ersetzen, das wir als Filter verwenden (siehe Schritt 3). In diesem Tutorial wird ``mycontext`` durch ``worlduniversityranking`` ersetzt und ``field_ID`` durch ``country``.
es: 8 + Añada la directiva ``ng-if`` en la etiqueta ``div`` que delimita el gráfico alternativo. No olvide sustituir ``mycontext`` por el nombre del contexto de la página (consulte el paso 2) y ``field_ID`` por el identificador técnico del campo del conjunto de datos que utilizamos como filtro (consulte el paso 3). En este tutorial, ``mycontext`` se sustituye por ``worlduniversityranking`` y ``field_ID`` se sustituye por ``country``.
fr: 8 + Ajoutez la directive ``ng-if`` au tag ``div`` enveloppant le graphe alternatif. Pensez à remplacer ``mycontext`` par le nom du contexte de la page (cf. étape 2) et ``field_ID`` par l'identifiant technique du champ du jeu de données que nous utilisons en tant que filtre (cf. étape 3). Dans ce tutoriel, ``mycontext`` est remplacé par ``worlduniversityranking``, et ``field_ID`` par ``country``.
nl: 8 + Voeg de ``ng-if``-richtlijn toe in de ``div`` tag die de alternatieve grafiek omringt. Vergeet niet om ``mycontext`` te vervangen door de naam van de paginacontext (zie stap 2) en ``field_ID`` door de technische identifier van het datasetveld dat we gebruiken als filter (zie stap 3). In deze handleiding is ``mycontext`` vervangen door ``worlduniversityranking`` en is ``field_ID`` vervangen door ``country``.

source: 9 + Click on :tutorial-keycap:`Preview`: by default, our alternative chart is hidden. But when the filter is used, it appears!
de: 9 + Klicken Sie auf :tutorial-keycap:`Vorschau`: standardmäßig ist unser alternatives Diagramm ausgeblendet. Wird jedoch der Filter verwendet, so erscheint es!
es: 9 + Haga clic en :tutorial-keycap:`Vista previa`: de forma predeterminada, nuestro gráfico alternativo está oculto. En cambio, cuando se usa el filtro, ¡aparece!
fr: 9 + Cliquez sur :tutorial-keycap:`Aperçu` : notre graphe optionnel est masqué par défaut. Mais une fois le filtre utilisé, il apparaît !
nl: 9 + Klik op :tutorial-keycap:`Voorbeeldweergave`: standaard is onze alternatieve grafiek verborgen. Maar wanneer de filter wordt gebruikt, verschijnt hij!

source: 10 + It's time to make the default chart disappear when the filter is used (and the alternative chart is displayed)! Basically, we want this expression to do the exact opposite of what the previous did. The good news is: there is a way to do so, that doesn't require the rewriting of a whole new expression. All we need is to reuse our previous expression, and add one single character at the beginning of it: an exclamation mark ``!``.
de: 10 + Es ist an der Zeit, das Standard-Diagramm ausblenden zu lassen, wenn der Filter verwendet wird (und das alternative Diagramm angezeigt wird)! Im Grunde genommen wollen wir, dass dieser Ausdruck das genaue Gegenteil von dem tut, was der vorherige getan hat. Die gute Nachricht ist: hierfür muss kein komplett neuer Ausdruck geschrieben werden. Es reicht aus, unseren vorherigen Ausdruck wiederzuverwenden und ein einziges Zeichen am Anfang hinzuzufügen: ein Ausrufezeichen ``!``.
es: 10 + ¡Es el momento de hacer desaparecer el gráfico predeterminado cuando se usa el filtro (y visualizar el gráfico alternativo)! En último término, queremos que esta expresión haga justo lo contrario que la anterior. Por fortuna, hay una forma de conseguirlo sin necesidad de volver a escribir una nueva expresión. Tan solo tenemos que reutilizar la expresión anterior y añadir un único carácter al principio: un signo de exclamación ``!``.
fr: 10 + Il est temps de faire disparaître le graphe par défaut quand le filtre est utilisé (et le graphe alternatif affiché) ! Nous voulons simplement que cette expression fasse l'exact opposé de ce que nous avons fait précédemment. La bonne nouvelle ? Vous pouvez le faire sans avoir à écrire une toute nouvelle expression. Nous avons seulement besoin de réutiliser l'expression précédente et d'ajouter un seul caractère au début de celle-ci : un point d'exclamation ``!``.
nl: 10 + Het is nu tijd om ervoor te zorgen dat de standaard grafiek verdwijnt wanneer de filter wordt gebruikt (en dat de alternatieve grafiek wordt weergegeven)! In essentie willen we dat deze uitdrukking precies het omgekeerde doet van wat de vorige deed. Het goede nieuws is: hier is een manier om dit te doen waarbij er niet opnieuw een volledig nieuwe uitdrukking moet worden geschreven. We moeten alleen onze vorige uitdrukking hergebruiken en één enkel karakter toevoegen aan het begin ervan: een uitroepingsteken ``!``.

source: An exclamation mark ``!``, placed at the beginning of an expression, reverses its behaviour. Basically, this expression could be read: "If ``mycontext`` is filtered with ``field_ID``, [DO NOT display the related HTML elements]".
de: Ein Ausrufezeichen ``!`` zu Beginn eines Ausdrucks kehrt dessen Verhalten um. Grundsätzlich könnte dieser Ausdruck so gelesen werden: "Wenn ``mycontext`` mit ``field_ID`` gefiltert wird, [die zugehörigen HTML-Elemente NICHT anzeigen]".
es: Un signo de exclamación ``!`` colocado al principio de una expresión invierte su comportamiento. En definitiva, esta expresión puede leerse así: "Si ``mycontext`` se filtra con ``field_ID``, [NO visualizar los elementos HTML relacionados]".
fr: Placé au début d'une expression, un point d'exclamation ``!`` inverse le comportement de celle-ci. Pour faire simple, l'expression signifie : "Si ``mycontext`` est filtré avec ``field_ID``, [les éléments HTML associés NE sont PAS affichés] ".
nl: Een uitroepingsteken ``!`` dat aan het begin van een uitdrukking wordt geplaatst, keert het gedrag ervan om. In essentie zou deze uitdrukking kunnen gelezen worden als: "Wanneer ``mycontext`` wordt gefilterd met ``field_ID``, [geef de aanverwante HTML-elementen NIET weer]".

source: 11 + Add the ``ng-if`` directive into the ``div`` tag wrapping the first, default chart. Don't forget to replace ``mycontext`` and ``field_ID`` as in the previous expression (see step 8).
de: 11 + Fügen Sie die Richtlinie ``ng-if`` in das ``div``-Tag ein, welches das erste Standard-Diagramm umgibt. Denken Sie daran, ``mycontext`` und ``field_ID`` wie im vorherigen Ausdruck zu ersetzen (siehe Schritt 8).
es: 11 + Añada la directiva ``ng-if`` en la etiqueta ``div`` que delimita el primer gráfico predeterminado. No olvide sustituir ``mycontext`` y ``field_ID`` como en la expresión anterior (consulte el paso 8).
fr: 11 + Ajoutez la directive ``ng-if`` dans le tag ``div`` enveloppant le premier graphe par défaut. Pensez à remplacer ``mycontext`` et ``field_ID`` comme dans l'expression précédente (cf. étape 8).
nl: 11 + Voeg de ``ng-if``-richtlijn toe in de ``div`` tag die de eerste, standaard grafiek omringt. Vergeet niet om ``mycontext`` en ``field_ID`` te vervangen, net zoals in de vorige uitdrukking (zie stap 8).

source: You can also copy the previous ``ng-if`` directive with its expression, and add a ``!`` at the beginning.
de: Sie können auch die vorherige ``ng-if``-Richtlinie samt ihrem Ausdruck kopieren und am Anfang ein ``!`` anfügen.
es: También puede copiar la directiva ``ng-if`` anterior con su expresión y añadir un ``!`` al principio.
fr: Vous pouvez également copier la directive ``ng-if`` précédente avec son expression et ajouter ``!`` au début de celle-ci.
nl: U kunt ook de vorige ``ng-if``-richtlijn met de uitdrukking ervan kopiëren en een ``!`` aan het begin toevoegen.

source: 12 + Click on :tutorial-keycap:`Preview`: it all works perfectly!
de: 12 + Klicken Sie auf :tutorial-keycap:`Vorschau`: alles funktioniert perfekt!
es: 12 + Haga clic en :tutorial-keycap:`Vista previa`: ¡todo funciona a la perfección!
fr: 12 + Cliquez sur :tutorial-keycap:`Aperçu` : tout fonctionne parfaitement !
nl: 12 + Klik op :tutorial-keycap:`Voorbeeldweergave`: alles werkt perfect!

source: Add the finishing touches
de: Der letzte Schliff
es: Añadir los retoques finales
fr: Ajouter la touche finale
nl: De finishing touch toevoegen

source: 13 + At this point, the only thing left to do is to make the page prettier! Let's organize our HTML elements using Bootstap. For this tutorial, we are going to use a single row, that will be split in 2: the visualization will be on the left while the the filter will be displayed on the right. Considering the size of a visualization compared of that of a list of filters, we will use 9 columns for the visualization and 3 for the filters.
de: 13 + Jetzt kann das Ganze noch verschönert werden! Organisieren wir unsere HTML-Elemente mit Bootstrap. Für dieses Tutorial werden wir eine einzelne Zeile verwenden, die in 2 Teile aufgeteilt wird: die Visualisierung befindet sich auf der linken Seite, während der Filter auf der rechten Seite angezeigt wird. In Anbetracht der Größe einer Visualisierung im Vergleich zu der einer Filterliste werden wir 9 Spalten für die Visualisierung und 3 Spalten für die Filter verwenden.
es: 13 + ¡En este punto, solo resta mejorar el aspecto de la página! Vamos a organizar los elementos HTML con Bootstrap. Para este tutorial, usaremos una sola fila, que estará dividida en dos: la visualización aparecerá a la izquierda mientras se visualiza el filtro a la derecha. A tenor del tamaño de una visualización en comparación con el de una lista de filtros, utilizaremos 9 columnas para la visualización y 3 para los filtros.
fr: 13 + À ce stade, il ne nous reste plus qu'à embellir la page ! Organisons nos éléments HTML à l'aide de Bootstrap. Dans le cadre de ce tutoriel, nous allons utiliser une seule ligne qui sera divisée en 2 : la visualisation se trouvera à gauche, tandis que le filtre s'affichera à droite. Compte tenu de la taille d'une visualisation par rapport à celle d'une liste de filtres, nous allons utiliser 9 colonnes pour la visualisation et 3 pour les filtres.
nl: 13 + Het enige wat we nu nog moeten doen is de pagina mooier maken! Laten we onze HTML-elementen organiseren met behulp van Bootstrap. Voor deze handleiding gebruiken we één enkele rij die we in 2 zullen delen: de weergave zal links staan terwijl de filter rechts zal worden weergegeven. Gezien de grootte van een weergave in vergelijking met die van een lijst met filters, gebruiken we 9 kolommen voor de weergave en 3 voor de filters.

source: If you are not familiar with Bootstrap and how it allows to organize a web page, check our :doc:`"How to build a dashboard (part 2)" tutorial </dashboard/how_to_build_dashboard_part2>` (section "Format your dashboard: organize your widgets in rows and columns").
de: Wenn Sie sich mit Bootstrap und der Möglichkeit der Organisation einer Webseite vertraut machen möchten, dann besuchen Sie unser Tutorial :doc:`"Ein Dashboard aufbauen (2. Teil)" </dashboard/how_to_build_dashboard_part2>` (Abschnitt: "Formatieren Sie Ihr Dashboard: Organisieren Sie Ihre Widgets in Zeilen und Spalten").
es: Si no está familiarizado con Bootstrap y cómo permite organizar una página web, consulte nuestro tutorial :doc:`"Cómo crear un panel (parte 2)" </dashboard/how_to_build_dashboard_part2>` (sección "Dar formato al panel: organizar los widgets en filas y columnas").
fr: Si vous ne maîtrisez pas Bootstrap, ni la façon dont il organise une page Web, consultez notre tutoriel :doc:`"Créer un tableau de bord (2e partie)"</dashboard/how_to_build_dashboard_part2>` (section "Mettre en forme votre tableau de bord : organiser vos widgets en lignes et en colonnes").
nl: Indien u niet vertrouwd bent met Bootstrap en hoe u hiermee een webpagina kunt organiseren, raadpleeg dan onze handleiding :doc:`"Hoe een dashboard opbouwen (deel 2)" </dashboard/how_to_build_dashboard_part2>` (deel "Uw dashboard formatteren: uw widgets in rijen en kolommen organiseren").
