Repository: opendatasoft/ods-documentation-landing-page
Catalog: ods-tutorial/source/_locale/*/LC_MESSAGES/dashboard_modules/how_to_create_tabs.po
Languages: de, es, fr, nl

source: How to create tabs (with AngularJS)
de: Tabs erstellen (mit AngularJS)
es: Cómo crear fichas (con AngularJS)
fr: Créer des onglets (avec AngularJS)
nl: Hoe tabbladen aanmaken (met AngularJS)

source: ★★★ Advanced - time: 45 minutes
de: ★★★ Sachkundige - Dauer: 45 Minuten
es: ★★★ Avanzado - Tiempo: 45 minutos
fr: ★★★ Avancé - durée : 45 minutes
nl: ★★★ Geavanceerd - tijd: 45 minuten

source: *This tutorial will teach you how to create tabs using AngularJS. These tabs will be fully customizable and reusable in any dashboard or piece of content created with HTML/CSS on Opendatasoft.*
de: *In diesem Tutorial erfahren Sie, wie Sie Tabs mit AngularJS erstellen können. Diese Tabs sind komplett anpassbar und wiederverwendbar in jedem Dashboard oder Inhalt, der mit HTML/CSS auf Opendatasoft erstellt wurde.*

source: During this tutorial, you will learn how to use 4 AngularJS directives:
de: In diesem Tutorial erfahren Sie, wie Sie 4 AngularJS-Richtlinie verwenden:
es: En este tutorial, aprenderá a utilizar 4 directivas AngularJS:
fr: Au cours de ce tutoriel, vous allez apprendre à utiliser 4 directives AngularJS :
nl: In deze handleiding leert u hoe u 4 AngularJS-richtlijnen moet gebruiken:

source: **PREREQUISITES**
de: **VORRAUSSETZUNGEN**
es: **REQUISITOS PREVIOS**
fr: **PRÉREQUIS**
nl: **VOORVEREISTEN**

source: In order to test this tutorial and/or integrate the tabs in an already existing page, you need to have access to the back office of an Opendatasoft portal and be granted the "Edit all pages" permission.
de: Um dieses Tutorial zu testen und/oder die Tabs in eine bereits bestehende Seite zu integrieren, benötigen Sie Zugriff auf das Backoffice eines Opendatasoft-Portals und die Berechtigung "Alle Seiten bearbeiten".

source: Since this tutorial is labeled as "Advanced" in terms of difficulty level, we assume that you already know HTML and CSS well enough to recognize and understand their structures and how they work. Other more technical elements will however be explained in details.
de: Dieses Tutorial fällt unter den Schwierigkeitsgrad "Sachkundige". Deshalb gehen wir davon aus, dass Sie HTML und CSS bereits ausreichend kennen, um ihre Strukturen und Funktionsweise zu erkennen und zu verstehen. Andere eher technische Elemente werden jedoch genauer erläutert.
es: Dado que este tutorial está categorizado con el nivel de dificultad "Avanzado", suponemos que ya tiene los conocimientos suficientes de HTML y CSS para reconocer y entender sus estructuras y funcionamiento. No obstante, se explicarán en detalle otros elementos más técnicos.
fr: Le niveau de difficulté de ce tutoriel étant "Avancé", nous partons du principe que vous connaissez suffisamment bien HTML et CSS pour reconnaître et comprendre leurs structures et fonctionnements respectifs. Toutefois, d'autres points plus techniques seront expliqués en détail.
nl: Aangezien deze handleiding aangemerkt staat als "Geavanceerd" in termen van moeilijkheidsgraad, nemen we aan dat u al voldoende vertrouwd bent met HTML en CSS om de structuren ervan te herkennen en te begrijpen en om te weten hoe ze werken. Andere meer technische elementen zullen echter gedetailleerd worden uitgelegd.

source: Show all images
de: Alle Bilder anzeigen
es: Mostrar todas las imágenes
fr: Afficher toutes les images
nl: Alle afbeeldingen tonen

source: Hide all images
de: Alle Bilder verbergen
es: Ocultar todas las imágenes
fr: Masquer toutes les images
nl: Alle afbeeldingen verbergen

source: Create the structure
de: Erstellen Sie die Struktur
es: Crear la estructura
fr: Créer la structure
nl: De structuur aanmaken

source: 1 + In this tutorial, we will create 3 tabs, considering that each tab is comprised of a clickable tab title and the content of the tab. In our code, we will manage the tab titles on the one hand and the tab contents on the other hand. Let's start with the structure of our tab titles! Put each tab title in an ``<a>`` tag, and all ``<a>`` tags into a ``<div>`` tag.
de: 1 + In diesem Tutorial werden wir 3 Tabs erstellen, wobei jeder Tab aus einem anklickbaren Titel und dem Inhalt des Tabs besteht. Beginnen wir mit der Struktur unserer Tab-Titel! Fügen Sie jeden Tab-Titel in einen ``<a>``-Tag ein und alle ``<a>``-Tags in ein ``<div>``-Tag.
es: 1 + En este tutorial crearemos 3 fichas, teniendo en cuenta que cada una de las fichas consta de un título de ficha interactivo y del contenido de la ficha. En el código, gestionaremos los títulos de las fichas por una parte y el contenido de las fichas por otra. ¡Vamos a empezar con la estructura de los títulos de las fichas! Ponga cada uno de los títulos de las fichas en una etiqueta ``<a>`` y todas las etiquetas ``<a>`` dentro de una etiqueta ``<div>``.
fr: 1 + Dans ce tutoriel, nous allons créer 3 onglets, chacun comprenant un titre cliquable et un contenu. Dans notre code, nous allons gérer les titres d'onglet d'un côté et les contenus de l'autre. Commençons dès maintenant par la structure de nos titres d'onglet : placez chaque titre d'onglet dans un tag ``<a>``, puis tous les tags ``<a>`` dans un tag ``<div>``.
nl: 1 + In deze handleiding maken we 3 tabbladen aan, waarbij we ervan uitgaan dat elk tabblad bestaat uit een tabbladtitel die kan worden aangeklikt en de content van het tabblad. In onze code zullen we enerzijds de tabbladtitels en anderzijds de tabbladcontent beheren. Laten we beginnen met de structuur van onze tabbladtitels! Plaats elke tabbladtitel in een ``<a>`` tag, and all ``<a>`` tags into a ``<div>`` tag.

source: Note
de: Hinweis
es: Nota
fr: Remarque
nl: Opmerking

source: For this tutorial, we chose to put the tab titles in an ``<a>`` tag for accessibility reasons. That tag is also handy because it allows all titles to be displayed on the same line. If you feel comfortable enough with HTML/CSS, you can put your tab titles in another tag, but keep in mind that you will probably have to use more CSS to make them look like in this tutorial.
de: Für dieses Tutorial haben wir uns aus praktischen Gründen dazu entscheiden, den Tab in ein ``<a>``-Tag einzufügen. Außerdem ermöglicht dieses Tag, alle Titel in derselben Zeile anzuzeigen. Wenn Sie sich mit HTML/CSS auskennen, können Sie Ihre Tab-Titel in ein anderes Tag einfügen. In diesem Fall müssen Sie jedoch wahrscheinlich mehr CSS verwenden, damit sie wie in diesem Tutorial aussehen.
es: En este tutorial, hemos decidido poner los títulos de las fichas en una etiqueta ``<a>`` por motivos de accesibilidad. Esta etiqueta también es práctica porque permite visualizar todos los títulos en la misma línea. Si se siente lo suficientemente cómodo con HTML/CSS, puede poner los títulos de las fichas en otra etiqueta, pero tenga presente que probablemente tendrá que usar más CSS para conseguir la misma apariencia que en este tutorial.
fr: Dans le cadre de ce tutoriel, nous avons choisi de placer les titres d'onglet dans des tags ``<a>`` à des fins d’accessibilité. Ce tag est aussi pratique, puisqu'il permet d'afficher tous les titres sur la même ligne. Si vous maîtrisez suffisamment HTML/CSS, vous pouvez placer vos titres d'onglet dans un autre tag, mais gardez à l'esprit que vous allez probablement devoir utiliser davantage CSS pour qu'ils ressemblent à l'exemple donné dans ce tutoriel.
nl: Voor deze handleiding kiezen we ervoor om de tabbladtitels omwille van toegankelijkheidsredenen in een ``<a>`` tag te plaatsen. Deze tag is ook handig omdat hij toelaat dat alle titels op dezelfde lijn worden weergegeven. Wanneer u denkt voldoende vertrouwd te zijn met HTML/CSS, kunt u uw tabbladtitels in een andere tag plaatsen, maar denk eraan dat u waarschijnlijk meer CSS zal moeten gebruiken om ze er te laten uitzien zoals in deze handleiding.

source: Depending on whether you try this tutorial on a new page or in an existing dashboard, you will perhaps see the ``<div class="container">`` and ``<div class="ods-box">`` tags: both are default tags that create the default frame of any Opendatasoft page. If you want to keep this frame, make sure to add the code of the tutorial between these default tags.
de: Je nachdem, ob Sie dieses Tutorial auf einer neuen Seite oder in einem bestehenden Dashboard ausprobieren, sehen Sie ggf. die Tags ``<div class="container">`` und ``<div class="ods-box">``: bei beiden handelt es sich um Standard-Tags, die den Standardrahmen einer Opendatasoft-Seite bilden. Wenn Sie diesen Rahmen beibehalten möchten, stellen Sie sicher, dass Sie den Code des Tutorials zwischen diese Standard-Tags einfügen.

source: 2 + Right under the tab titles, let's add the tab contents. Put each of them in a ``<div>`` tag.
de: 2 + Rechts unter den Tab-Titeln können Sie die Tab-Inhalte hinzufügen. Fügen Sie sie jeweils in ein ``<div>``-Tag ein.
es: 2 + Justo debajo de los títulos de las fichas, vamos a añadir el contenido de las fichas. Ponga cada uno de ellos en una etiqueta ``<div>``.
fr: 2 + Ajoutons maintenant les contenus d'onglet sous les titres d'onglet. Placez-les dans un tag ``<div>``.
nl: 2 + Rechts onder de tabbladtitels voegen we de content van het tabblad toe. Plaats elk ervan in een ``<div>`` tag.

source: 3 + Now that we have the base, we should add some CSS for the tabs to look like proper tabs. Go to the CSS section of the page you are working on.
de: 3 + Nun, da wir die Basis haben, sollten wir etwas CSS hinzufügen, damit die Tabs wie richtige Tabs aussehen. Öffnen Sie den CSS-Bereich der Seite, an der Sie gerade arbeiten.
es: 3 + Ahora que ya tenemos la base, debemos añadir CSS para que las fichas tengan la apariencia adecuada. Vaya a la sección CSS de la página en que está trabajando.
fr: 3 + La base étant créée, nous devons ajouter des éléments CSS pour que nos onglets ressemblent à des onglets dignes de ce nom. Accédez à la section CSS de la page sur laquelle vous travaillez.
nl: 3 + Nu we de basis hebben zouden we enkele CSS kunnen toevoegen om de tabbladen er te laten uitzien als echte tabbladen. Ga naar de CSS-sectie van de pagina waar u aan werkt.

source: 4 + First, create the default CSS class that will be applied on each tab title. Here, we will especially work on the ``padding`` property to make sure the tabs are seen as 3 separate items. We will also change the color of the text.
de: 4 + Erstellen Sie zunächst die Standard-CSS-Klasse, die für jeden Tab-Titel angewendet wird. An dieser Stelle arbeiten wir insbesondere mit der Eigenschaft ``padding``, um sicherzustellen, dass die Tabs als 3 separate Elemente dargestellt werden. Außerdem ändern wir die Farbe des Texts.
es: 4 + En primer lugar, cree la clase CSS predeterminada que se aplicará a cada uno de los títulos de las fichas. En este caso, trabajaremos especialmente con la propiedad ``padding`` para que las fichas aparezcan como 3 elementos distintos. También cambiaremos el color del texto.
fr: 4 + Commencez par créer la classe CSS par défaut, qui sera appliquée à tous les titres d'onglet. Nous allons tout particulièrement travailler sur la propriété ``padding`` pour nous assurer que les onglets apparaissent comme 3 éléments distincts. En outre, nous allons modifier la couleur du texte.
nl: 4 + Maak eerst de standaard CSS-klasse aan die toegepast zal worden op elke tabbladtitel. Hier zult u vooral werken aan de eigenschap "padding" om er zeker van te zijn dat de tabbladen worden gezien als 3 afzonderlijke items. We zullen ook de kleur van de tekst wijzigen.

source: For this tutorial, comments have been added in the CSS code. They are here as reminders to know which class or property does what. If you feel comfortable with CSS, don't hesitate to remove these comments. Note also that the name of the CSS class, ``tab``, has been chosen because it is easy to read and to understand on which HTML element it will be applied. Do feel free to rename it though.
de: Für dieses Tutorial wurden Kommentare in den CSS-Code eingefügt. Diese sollen Sie daran erinnern, welche Funktionen die unterschiedlichen Klassen oder Eigenschaften haben. Wenn Sie sich gut mit CSS auskennen, können Sie diese Kommentare entfernen. Beachten Sie auch, dass der Name der CSS-Klasse "Tab" gewählt wurde, weil damit leicht zu verstehen ist, auf welches HTML-Element er angewendet wird. Sie können den Namen gerne ändern.
es: Para este tutorial, se han añadido comentarios en el código CSS. Son recordatorios acerca de qué clase o propiedad hace qué. Si se siente cómodo con CSS, puede eliminar estos comentarios. Además, se ha elegido el nombre de la clase CSS, ``tab``, porque es fácil de leer y permite entender a qué elemento HTML se aplicará. Si lo desea, puede cambiarle el nombre.
fr: Dans le cadre de ce tutoriel, nous avons ajouté des commentaires dans le code CSS, ainsi que des rappels pour expliquer le rôle de chaque classe ou propriété. Si vous maîtrisez CSS, n'hésitez pas à supprimer ces commentaires. Notez également que le nom de la classe CSS, ``tab``, a été choisi car il est lisible et permet de comprendre à quel élément HTML il va être appliqué. Néanmoins, vous pouvez le renommer si vous le souhaitez.
nl: Voor deze handleiding werden er commentaren toegevoegd in de CSS-code. Ze zijn daar als geheugensteuntje om te weten welke klasse of eigenschap wat doet. Wanneer u met CSS vertrouwd bent, aarzel dan niet om deze commentaren te verwijderen. Merk ook op dat de naam van de CSS-klasse, "tab", werd gekozen om deze gemakkelijk kan worden gelezen en om te begrijpen op welk HTML-element ze zal worden toegepast. Het staat u evenwel vrij om deze een andere naam te geven.

source: 5 + Go back to the HTML section of the page you are working on. Now that the CSS class has been created, we can apply it on the HTML tags containing the tabs titles.
de: 5 + Wechseln Sie zurück zum HTML-Bereich der Seite, an der Sie gerade arbeiten. Nachdem die CSS-Klasse erstellt wurde, können wir sie auf die HTML-Tags anwenden, welche die Tab-Titel beinhalten.
es: 5 + Vuelva a la sección HTML de la página en que está trabajando. Una vez creada la clase CSS, podemos aplicarla a las etiquetas HTML que contienen los títulos de las fichas.
fr: 5 + Revenez à la section HTML de la page sur laquelle vous travaillez. Puisque la classe CSS a été créée, nous pouvons l'appliquer aux tags HTML qui contiennent les titres d'onglet.
nl: 5 + Keer terug naar de HTML-sectie van de pagina waar u aan werkt. Nu de CSS-klasse werd aangemaakt, kunnen we deze toepassen op de HTML-tags waarin de tabbladtitels staan.

source: 6 + Second, we are going to give a bit more style to the tab contents. This time, instead of creating a whole new CSS class, we are going to use an already existing one. ``ods-box`` is a default Opendatasoft CSS style that wraps the HTML items into a thin border. It will help us give the impression that our tab contents are a little bit 'outside' the rest of the page content. Add a ``<div>`` tag wrapping all the tab contents, with the ``ods-box`` CSS class in it.
de: 6 + Anschließend verleihen wir dem Inhalt des Tabs etwas mehr Stil. Anstatt eine völlig neue CSS-Klasse zu erstellen, werden wir diesmal eine bereits bestehende verwenden. ``ods-box`` ist ein standardmäßiger Opendatasoft-CSS-Stil, der die HTML-Elemente mit einen dünnen Rand umgibt. Damit wird der Eindruck erweckt, dass unser Tab-Inhalt ein wenig "außerhalb" des restlichen Seiteninhalts liegt. Fügen Sie ein ``<div>``-Tag hinzu, das den gesamten Tab-Inhalt umgibt, einschließlich der CSS-Klasse ``ods-box``.

source: 7 + Check the preview of your page. We have created the structure of our tabs!
de: 7 + Sehen Sie sich die Vorschau Ihrer Seite an. Wir haben die Struktur unserer Tabs erstellt!
es: 7 + Revise la vista previa de la página. ¡Ya hemos creado la estructura de las fichas!
fr: 7 + Consultez l'aperçu de votre page. C'est fait, nous avons créé la structure de nos onglets !
nl: 7 + Controleer de voorbeeldweergave van uw pagina. We hebben de structuur van onze tabbladen aangemaakt!

source: Add AngularJS
de: AngularJS hinzufügen
es: Añadir AngularJS
fr: Ajouter AngularJS
nl: Voeg AngularJS toe

source: 8 + It's now time for AngularJS to come into play! We will need to use 4 AngularJS directives to make our tabs work. Let's start with ``ng-click``. This directive is basically used to tell AngularJS what to do when clicking on an HTML element. In our case, ``ng-click`` will allow us to switch from one tab to another.
de: 8 + Es ist jetzt an der Zeit, dass AngularJS ins Spiel kommt! Wir müssen 4 AngularJS-Richtlinien einsetzen, damit unsere Tabs funktionieren. Beginnen wir mit ``ng-click``. Diese Richtlinie wird im Wesentlichen verwendet, um AngularJS mitzuteilen, was es tun soll, wenn auf ein HTML-Element geklickt wird. In unserem Fall ermöglicht uns ``ng-click`` von einem Tab zum anderen zu wechseln.
es: 8 + ¡Es el turno de AngularJS! Tendremos que utilizar 4 directivas AngularJS para que las fichas funcionen. Empezaremos con ``ng-click``. Esta directiva se utiliza básicamente para indicar a AngularJS qué hacer cuando se hace clic en un elemento HTML. En este caso, ``ng-click`` nos permitirá pasar de una ficha a otra.
fr: 8 + C'est le moment où AngularJS entre en jeu ! Nous allons avoir besoin d'utiliser 4 directives AngularJS pour que nos onglets fonctionnent. Commençons par ``ng-click``, une directive essentiellement utilisée pour indiquer à AngularJS ce qu'il doit faire lorsqu'un utilisateur clique sur un élément HTML. Ici, ``ng-click`` va nous permettre de basculer d'un onglet à l'autre.
nl: 8 + Het is nu tijd om AngularJS erbij te betrekken! We moeten 4 AngularJS-richtlijnen gebruiken om onze tabbladen te laten werken. We beginnen met ``ng-click``. Deze richtlijn wordt vooral gebruikt om AngularJS te vertellen wat moet gebeuren wanneer een HTML-element wordt aangeklikt. In ons geval zal ``ng-click`` ons toelaten van het ene tabblad naar een ander over te schakelen.

source: First thing first: let's take a look at the syntax to understand how to use the ``ng-click`` directive.
de: Zunächst werfen wir einen Blick auf die Syntax, um zu verstehen, wie man die Richtlinie ``ng-click`` verwendet.
es: Antes que nada, veamos la sintaxis para entender cómo utilizar la directiva ``ng-click``.
fr: Commençons déjà par observer la syntaxe pour comprendre comment utiliser la directive ``ng-click``.
nl: We beginnen bij het begin: laten we een kijkje nemen naar de syntax om te begrijpen hoe we de richtlijn ``ng-click`` moeten gebruiken.

source: ``ng-click`` is the AngularJS directive. It is always followed by an equals sign ``=`` which indicates that what comes after is an expression. This expression will be evaluated by the directive, and it must always be written between double quotes ``"``.
de: ``ng-click`` ist eine AngularJS-Richtlinie. Darauf folgt immer ein Gleichheitszeichen ``=``. Es weist auf einen folgenden Ausdruck hin. Dieser Ausdruck wird von der Richtlinie ausgewertet und muss immer in doppelten Anführungszeichen geschrieben werden ``"``.
es: ``ng-click`` es la directiva AngularJS. Siempre va seguida de un signo de igual ``=`` que indica que lo que va a continuación es una expresión. Esta expresión será evaluada por la directiva y debe escribirse siempre entre comillas dobles ``"``.
fr: ``ng-click`` est la directive AngularJS. Elle est toujours suivie d'un signe égal, ``=``, qui indique que ce qui vient après est une expression. Cette expression sera évaluée par la directive et doit toujours se trouver entre des guillemets doubles ``"``.
nl: ``ng-click`` is de AngularJS-richtlijn. Deze wordt altijd gevolgd door een gelijkheidsteken ``=`` dat aangeeft dat wat erna komt, een uitdrukking is. Deze uitdrukking zal worden geëvalueerd door de richtlijn en moet altijd geschreven zijn tussen twee dubbele aanhalingstekens ``"``.

source: In the expression, we will assign a value to a variable. At this point, neither the variable nor the value exist, we must create them.
de: Im Ausdruck weisen wir einer Variablen einen Wert zu. Zurzeit existiert weder die Variable noch der Wert, deshalb müssen wir sie erstellen.
es: En la expresión, asignaremos un valor a una variable. En este punto no existe ni la variable ni el valor, por lo que debemos crearlos.
fr: Dans l'expression, nous allons attribuer une valeur à une variable. Comme aucune variable ni valeur n'existe à ce stade, nous devons les créer.
nl: In de uitdrukking zullen we een waarde toekennen aan een variabele. Op dit moment bestaan noch de variabele, noch de waarde. We moeten deze aanmaken.

source: The variable comes first. The variable is the link between all the AngularJS directives that will be used throughout this tutorial. Choose a name that is self-explanatory, to make sure that your code can be understood by someone else. In this tutorial, we will name the variable ``tabselector``.
de: Zunächst kommt die Variable. Die Variable ist die Verbindung zwischen allen AngularJS-Richtlinien, die in diesem Tutorial verwendet werden. Wählen Sie einen selbsterklärenden Namen, damit Ihr Code von anderen verstanden wird. In diesem Tutorial nennen wir die Variable ``tabselector``.
es: Primero viene la variable. La variable es el vínculo entre todas las directivas AngularJS que se usarán a lo largo del tutorial. Elija un nombre descriptivo, para que el código sea comprensible para cualquier persona ajena. En este tutorial, la variable se denominará ``tabselector``.
fr: La variable se trouve au début. Elle constitue le lien entre toutes les directives AngularJS qui seront utilisées au cours de ce tutoriel. Choisissez un nom explicite pour vous assurer que votre code peut être compris par tout le monde. Dans ce tutoriel, nous allons nommer la variable ``tabselector``.
nl: Eerst komt de variabele. De variabele is een link tussen alle AngularJS-richtlijnen die doorheen deze volledige handleiding zal worden gebruikt. Kies een naam die voor zich spreekt om ervoor te zorgen dat uw code door iemand anders kan worden begrepen. In deze handleiding zullen we de variabele de naam ``tabselector`` geven.

source: Second comes an equals sign ``=`` which separates the variable from the value.
de: Anschließend kommt ein Gleichheitszeichen ``=```, das die Variable vom Wert trennt.
es: En segunda posición viene un signo de igual ``=`` que separa la variable del valor.
fr: Arrive ensuite le signe égal, ``=``, qui sépare la variable de la valeur.
nl: Daarna komt een gelijkheidsteken ``=`` dat de variabele scheidt van de waarde.
